#Область ПрограммныйИнтерфейс

&НаКлиенте
Функция ПроверитьНомерСчета(НомерСчета) Экспорт
	
    ЧетыреЗнака  = Лев(НомерСчета, 4);
	ЧистаяСтрока = Сред(НомерСчета, 5) + ЧетыреЗнака;
	
	Ном = 0;
	СтрокаСчета = "";
	
	МатрицаЗнаков = ПостроитьМатрицуЗнаков();
	
	Для Ном = 1 По СтрДлина(ЧистаяСтрока) Цикл
		
		СтрокаСчета = СтрокаСчета + МатрицаЗнаков.Получить(Сред(ЧистаяСтрока, Ном, 1));    
		
	КонецЦикла; 
	
	Число132 = Число(СтрокаСчета);
	Число133 = Цел(Число132 / 97);
	Число134 = Число133 * 97;
	Число135 = Число132 - Число134;
	
	Возврат (Число135 = 1);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПостроитьМатрицуЗнаков()
	
	МатрицаЗнаков = Новый Соответствие;
	МатрицаЗнаков.Вставить("0","0");
	МатрицаЗнаков.Вставить("1","1");
	МатрицаЗнаков.Вставить("2","2");
	МатрицаЗнаков.Вставить("3","3");
	МатрицаЗнаков.Вставить("4","4");
	МатрицаЗнаков.Вставить("5","5");
	МатрицаЗнаков.Вставить("6","6");
	МатрицаЗнаков.Вставить("7","7");
	МатрицаЗнаков.Вставить("8","8");
	МатрицаЗнаков.Вставить("9","9");
	МатрицаЗнаков.Вставить("A","10");
	МатрицаЗнаков.Вставить("B","11");
	МатрицаЗнаков.Вставить("C","12");
	МатрицаЗнаков.Вставить("D","13");
	МатрицаЗнаков.Вставить("E","14");
	МатрицаЗнаков.Вставить("F","15");
	МатрицаЗнаков.Вставить("G","16");
	МатрицаЗнаков.Вставить("H","17");
	МатрицаЗнаков.Вставить("I","18");
	МатрицаЗнаков.Вставить("J","19");
	МатрицаЗнаков.Вставить("K","20");
	МатрицаЗнаков.Вставить("L","21");
	МатрицаЗнаков.Вставить("M","22");
	МатрицаЗнаков.Вставить("N","23");
	МатрицаЗнаков.Вставить("O","24");
	МатрицаЗнаков.Вставить("P","25");
	МатрицаЗнаков.Вставить("Q","26");
	МатрицаЗнаков.Вставить("R","27");
	МатрицаЗнаков.Вставить("S","28");
	МатрицаЗнаков.Вставить("T","29");
	МатрицаЗнаков.Вставить("U","30");
	МатрицаЗнаков.Вставить("V","31");
	МатрицаЗнаков.Вставить("W","32");
	МатрицаЗнаков.Вставить("X","33");
	МатрицаЗнаков.Вставить("Y","34");
	МатрицаЗнаков.Вставить("Z","35");
	
	Возврат МатрицаЗнаков;
	
КонецФункции

#КонецОбласти