
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НаРасходыБудущихПериодов = (Параметры.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов);

	РазрешитьРедактированиеВариантРаспределенияРасходов = Истина;
	Если НаРасходыБудущихПериодов И Параметры.ЗаполненаСтатьяРасходовСписания Тогда
		РазрешитьРедактированиеАналитикаРасходов = Ложь;
		Элементы.РазрешитьРедактированиеАналитикаРасходов.Доступность = Ложь;
		Элементы.ОписаниеАналитикаРасходов.Заголовок = 
			НСтр("ru = 'Используется аналитика расходов, указанная в выбранной статье списания расходов'");
	Иначе
		РазрешитьРедактированиеАналитикаРасходов = Истина;
	КонецЕсли;
	РазрешитьРедактированиеВариантРаздельногоУчетаНДС = Истина;
	
	Элементы.ОписаниеСтатьяСписанияРасходов.Видимость = НаРасходыБудущихПериодов;
	Элементы.РазрешитьРедактированиеСтатьиРасходов.Видимость = НаРасходыБудущихПериодов;
	
	РазрешитьРедактированиеНастроекРегламентированногоУчета = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	Если РазрешитьРедактированиеВидаДетятельностиИВариантаРаспределенияРасходов Тогда
		Результат.Добавить("ВидДеятельностиРасходов");
		Результат.Добавить("ВариантРаспределенияРасходов");
	КонецЕсли;
	Если РазрешитьРедактированиеСтатьиРасходов Тогда
		Результат.Добавить("СтатьяРасходов");
	КонецЕсли;
	Если РазрешитьРедактированиеАналитикаРасходов Тогда
		Результат.Добавить("ТипЗначенияНаНаправленияДеятельности");
		Результат.Добавить("ТипЗначенияНаСебестоимостьТоваров");
		Результат.Добавить("ТипЗначенияНаРасходыБудущихПериодов");
		Результат.Добавить("ТипЗначенияНаПроизводственныеЗатраты");
		Результат.Добавить("ТипЗначенияНеРаспределять");
		Результат.Добавить("ВидЦенностиНДС");
	КонецЕсли;
	Если РазрешитьРедактированиеВариантРаздельногоУчетаНДС Тогда
		Результат.Добавить("ВариантРаздельногоУчетаНДС");
	КонецЕсли;
	Если РазрешитьРедактированиеНастроекРегламентированногоУчета Тогда
		Результат.Добавить("ВидАктива");
		Результат.Добавить("ПринятиеКналоговомуУчету");
		Результат.Добавить("ВидРасходов");
		Результат.Добавить("ВидПрочихРасходов");
		Результат.Добавить("КосвенныеЗатратыНУ");
		Результат.Добавить("ВидРБП");
		Результат.Добавить("ПризнаватьРасходамиПриУСН");
		Результат.Добавить("ВидДеятельностиДляНалоговогоУчетаЗатрат");
	КонецЕсли;
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти
