
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
//
// Параметры:
// 		КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	
	
КонецПроцедуры

// Заполняет список команд создания на основании.
//
// Параметры:
// 		КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПереоценкаОС) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.ПереоценкаОС.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.ПереоценкаОС);
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьРеглУчет";
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru = 'Переоценка ОС'"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	
	ТекстыЗапроса = Новый СписокЗначений;
	УчетОСВызовСервера.ПрочиеРасходы(ТекстыЗапроса, Регистры, ПрочиеРасходы(ТекстыЗапроса));
	УчетОСВызовСервера.ПартииПрочихРасходов(ТекстыЗапроса, Регистры, ПартииПрочихРасходов(ТекстыЗапроса));
	УчетОСВызовСервера.ПрочиеДоходы(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ПрочиеАктивыПассивы(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ПорядокОтраженияПрочихОпераций(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ОтражениеДокументовВРеглУчете(ТекстыЗапроса, Регистры);
	ПараметрыАмортизацииОСБухгалтерскийУчет(ТекстыЗапроса, Регистры);
	ПараметрыАмортизацииОСНалоговыйУчет(ТекстыЗапроса, Регистры);
	СобытияОСОрганизаций(ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Ложь, Ложь, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.СобытиеОС КАК СобытиеОС,
	|	ДанныеДокумента.СчетДооценки КАК СчетДооценки,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяДоходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаДоходов,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ЕСТЬNULL(ДанныеДокумента.СтатьяРасходов.ПринятиеКналоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету
	|ИЗ
	|	Документ.ПереоценкаОС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	УчетОСВызовСервера.ИнициализироватьПараметрыЗапросаПриОтраженииАмортизации(Запрос, ДополнительныеСвойства);
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	Запрос.УстановитьПараметр("Граница", Новый Граница(НачалоМесяца(Реквизиты.Период), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КонецМесяца", Новый Граница(КонецМесяца(Реквизиты.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НазваниеДокумента", НСтр("ru='Переоценка ОС'"));
	Запрос.УстановитьПараметр("ГраницаМесяцОкончание", Новый Граница(КонецМесяца(Реквизиты.Период), ВидГраницы.Включая));
	
КонецПроцедуры

Процедура ВременнаяТаблицаПоДокументу(ТекстыЗапроса)
	
	ИмяТаблицы = "втТаблицаПоДокументу";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втТаблицаПоДокументу
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.Ссылка КАК Ссылка,
	|	втТаблицаПоДокументу.НомерСтроки КАК НомерСтроки,
	|	втТаблицаПоДокументу.ОсновноеСредство КАК ОбъектУчета,
	|	втТаблицаПоДокументу.Ссылка.Организация КАК Организация,
	|	втТаблицаПоДокументу.Ссылка.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(втТаблицаПоДокументу.ОсновноеСредство.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	втТаблицаПоДокументу.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ втТаблицаПоДокументу
	|ИЗ
	|	Документ.ПереоценкаОС.ОС КАК втТаблицаПоДокументу
	|ГДЕ
	|	втТаблицаПоДокументу.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОсновноеСредство,
	|	Организация,
	|	Подразделение"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаАмортизацияПоДокументу(ТекстыЗапроса)
	
	ИмяТаблицы = "втАмортизацияПоДокументу";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	УчетОСВызовСервера.ВременнаяТаблицаНачисленнаяАмортизация(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втАмортизацияПоДокументу
	|"+
	"ВЫБРАТЬ
	|	втНачисленнаяАмортизация.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втНачисленнаяАмортизация.СуммаБУ) КАК Сумма
	|ПОМЕСТИТЬ втАмортизацияПоДокументу
	|ИЗ
	|	втНачисленнаяАмортизация КАК втНачисленнаяАмортизация
	|
	|СГРУППИРОВАТЬ ПО
	|	втНачисленнаяАмортизация.ОбъектУчета"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаУчета(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаУчета";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаУчета
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации КАК СчетАмортизации,
	|	ПараметрыЦелевогоФинансирования.СчетУчета КАК СчетУчетаЦФ,
	|	ПараметрыЦелевогоФинансирования.СчетАмортизации КАК СчетАмортизацииЦФ,
	|	ЕСТЬNULL(ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования, ЛОЖЬ) КАК ПрименениеЦелевогоФинансирования
	|ПОМЕСТИТЬ втСчетаУчета
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				&Период,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|		ПО втТаблицаПоДокументу.ОбъектУчета = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
	|				&Период,
	|				Регистратор <> &Ссылка
	|					И ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							Т.ОбъектУчета
	|						ИЗ
	|							втТаблицаПоДокументу КАК Т)) КАК ПараметрыЦелевогоФинансирования
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ПараметрыЦелевогоФинансирования.ОсновноеСредство
	|			И (ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования)"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаУчетаСгруппированные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчета(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаУчетаСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета КАК ОбъектУчета,
	|	втСчетаУчета.СчетУчета КАК Счет
	|ПОМЕСТИТЬ втСчетаУчетаСгруппированные
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета,
	|	втСчетаУчета.СчетУчетаЦФ
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|ГДЕ
	|	втСчетаУчета.ПрименениеЦелевогоФинансирования"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаАмортизацииСгруппированные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчета(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаАмортизацииСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета КАК ОбъектУчета,
	|	втСчетаУчета.СчетАмортизации КАК Счет
	|ПОМЕСТИТЬ втСчетаАмортизацииСгруппированные
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета,
	|	втСчетаУчета.СчетАмортизацииЦФ
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|ГДЕ
	|	втСчетаУчета.ПрименениеЦелевогоФинансирования"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаСгруппированные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчетаСгруппированные.Счет КАК Счет
	|ПОМЕСТИТЬ втСчетаСгруппированные
	|ИЗ
	|	втСчетаУчетаСгруппированные КАК втСчетаУчетаСгруппированные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаАмортизацииСгруппированные.Счет
	|ИЗ
	|	втСчетаАмортизацииСгруппированные КАК втСчетаАмортизацииСгруппированные"+";";;
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаОстаткиПоСчетам(ТекстыЗапроса)
	
	ИмяТаблицы = "втОстаткиПоСчетам";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаСчетаСгруппированные(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втОстаткиПоСчетам
	|"+
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК ОбъектУчета,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма
	|ПОМЕСТИТЬ втОстаткиПоСчетам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Т.Счет
	|				ИЗ
	|					втСчетаСгруппированные КАК Т),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|			(Организация, Подразделение, Субконто1, НаправлениеДеятельности) В
	|				(ВЫБРАТЬ
	|					Т.Организация,
	|					Т.Подразделение,
	|					Т.ОбъектУчета,
	|					Т.НаправлениеДеятельности
	|				ИЗ
	|					втТаблицаПоДокументу КАК Т)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Счет"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаОстаткиСтоимости(ТекстыЗапроса)
	
	ИмяТаблицы = "втОстаткиСтоимости";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаОстаткиПоСчетам(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втОстаткиСтоимости
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ВосстановительнаяСтоимость.Сумма, 0) + ЕСТЬNULL(ВосстановительнаяСтоимостьЦФ.Сумма, 0)) КАК ВосстановительнаяСтоимость,
	|	СУММА(ЕСТЬNULL(-НакопленнаяАмортизация.Сумма, 0) + ЕСТЬNULL(-НакопленнаяАмортизацияЦФ.Сумма, 0)) КАК НакопленнаяАмортизация
	|ПОМЕСТИТЬ втОстаткиСтоимости
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчета
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втСчетаУчета.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК ВосстановительнаяСтоимость
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ВосстановительнаяСтоимость.ОбъектУчета
	|			И (втСчетаУчета.СчетУчета = ВосстановительнаяСтоимость.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК НакопленнаяАмортизация
	|		ПО втТаблицаПоДокументу.ОбъектУчета = НакопленнаяАмортизация.ОбъектУчета
	|			И (втСчетаУчета.СчетАмортизации = НакопленнаяАмортизация.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК ВосстановительнаяСтоимостьЦФ
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ВосстановительнаяСтоимостьЦФ.ОбъектУчета
	|			И (втСчетаУчета.СчетУчетаЦФ = ВосстановительнаяСтоимостьЦФ.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК НакопленнаяАмортизацияЦФ
	|		ПО втТаблицаПоДокументу.ОбъектУчета = НакопленнаяАмортизацияЦФ.ОбъектУчета
	|			И (втСчетаУчета.СчетАмортизацииЦФ = НакопленнаяАмортизацияЦФ.Счет)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектовСгруппированная(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектовСгруппированная";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектовСгруппированная
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектовСгруппированная
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.СчетУчета
	|					ИЗ
	|						РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втТаблицаПоДокументу.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета" + ";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектов(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектов";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПредыдущаяПереоценкаОбъектовСгруппированная(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектов
	|"+
	"ВЫБРАТЬ
	|	втПредыдущаяПереоценкаОбъектовСгруппированная.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки > втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки
	|			ТОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки - втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки > втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки
	|			ТОГДА втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаУценки - втПредыдущаяПереоценкаОбъектовСгруппированная.СуммаДооценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектов
	|ИЗ
	|	втПредыдущаяПереоценкаОбъектовСгруппированная КАК втПредыдущаяПереоценкаОбъектовСгруппированная" + ";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса)
	
	ИмяТаблицы = "втДанныеДляПроведения";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаОстаткиСтоимости(ТекстыЗапроса);
	ВременнаяТаблицаАмортизацияПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаПредыдущаяПереоценкаОбъектов(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втДанныеДляПроведения
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.Ссылка,
	|	втТаблицаПоДокументу.НомерСтроки,
	|	втТаблицаПоДокументу.ОбъектУчета,
	|	втТаблицаПоДокументу.Организация КАК Организация,
	|	втТаблицаПоДокументу.Подразделение КАК Подразделение,
	|	втТаблицаПоДокументу.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) КАК ВосстановительнаяСтоимость,
	|	ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0) КАК НакопленнаяАмортизация,
	|	втТаблицаПоДокументу.Стоимость КАК НоваяСтоимость,
	|	ВЫБОР
	|		КОГДА втОстаткиСтоимости.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втТаблицаПоДокументу.Стоимость < втОстаткиСтоимости.ВосстановительнаяСтоимость
	|			ТОГДА 0
	|		ИНАЧЕ втТаблицаПоДокументу.Стоимость -втОстаткиСтоимости.ВосстановительнаяСтоимость
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втОстаткиСтоимости.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втОстаткиСтоимости.ВосстановительнаяСтоимость < втТаблицаПоДокументу.Стоимость
	|			ТОГДА 0
	|		ИНАЧЕ втОстаткиСтоимости.ВосстановительнаяСтоимость - втТаблицаПоДокументу.Стоимость
	|	КОНЕЦ КАК СуммаУценки,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаОбъектов.СуммаДооценки, 0) КАК СуммаПрошлойДооценки,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаОбъектов.СуммаУценки, 0) КАК СуммаПрошлойУценки
	|ПОМЕСТИТЬ втДанныеДляПроведения
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиСтоимости КАК втОстаткиСтоимости
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втОстаткиСтоимости.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАмортизацияПоДокументу КАК втАмортизацияПоДокументу
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втАмортизацияПоДокументу.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаОбъектов КАК втПредыдущаяПереоценкаОбъектов
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втПредыдущаяПереоценкаОбъектов.ОбъектУчета"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ПараметрыАмортизацииОСБухгалтерскийУчет(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПараметрыАмортизацииОСБухгалтерскийУчет";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ПараметрыАмортизацииОСБухгалтерскийУчет
	|"+
	"ВЫБРАТЬ
	|	втДанныеДляПроведения.НомерСтроки,
	|	
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокИспользованияДляВычисленияАмортизации,
	|
	|	ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации 
	|		+ втДанныеДляПроведения.СуммаДооценки 
	|		- втДанныеДляПроведения.СуммаУценки КАК СтоимостьДляВычисленияАмортизации,
	|
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|
	|	ПараметрыАмортизацииОСБУ.КоэффициентАмортизации КАК КоэффициентАмортизации,
	|	ПараметрыАмортизацииОСБУ.КоэффициентУскорения КАК КоэффициентУскорения
	|	
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|		&Период,
	|		Организация = &Организация
	|		И Регистратор <> &Ссылка
	|		И ОсновноеСредство В (ВЫБРАТЬ Т.ОбъектУчета ИЗ втДанныеДляПроведения КАК Т)
	|	) КАК ПараметрыАмортизацииОСБУ
	|	ПО втДанныеДляПроведения.ОбъектУчета = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	|	
	|УПОРЯДОЧИТЬ ПО
	|	втДанныеДляПроведения.НомерСтроки"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры

Процедура ПараметрыАмортизацииОСНалоговыйУчет(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПараметрыАмортизацииОСНалоговыйУчет";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ПараметрыАмортизацииОСНалоговыйУчет
	|"+
	"ВЫБРАТЬ
	|	втДанныеДляПроведения.НомерСтроки,
	|	
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	ПараметрыАмортизацииОСНУ.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОСНУ.КоэффициентАмортизации КАК КоэффициентАмортизации,
	|	ПараметрыАмортизацииОСНУ.ПРДляВычисленияАмортизации + втДанныеДляПроведения.СуммаДооценки - втДанныеДляПроведения.СуммаУценки КАК ПРДляВычисленияАмортизации
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(
	|		&Период,
	|		Организация = &Организация
	|		И Регистратор<>&Ссылка
	|		И ОсновноеСредство В (ВЫБРАТЬ Т.ОбъектУчета ИЗ втДанныеДляПроведения КАК Т)
	|	) КАК ПараметрыАмортизацииОСНУ
	|	ПО втДанныеДляПроведения.ОбъектУчета = ПараметрыАмортизацииОСНУ.ОсновноеСредство
	|	
	|УПОРЯДОЧИТЬ ПО
	|	втДанныеДляПроведения.НомерСтроки"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры

Процедура СобытияОСОрганизаций(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "СобытияОСОрганизаций";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица СобытияОСОрганизаций
	|"+
	"ВЫБРАТЬ
	|	втДанныеДляПроведения.НомерСтроки,
	|	
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.ОбъектУчета КАК ОсновноеСредство,
	|	
	|	&СобытиеОС КАК Событие,
	|	
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&Номер КАК НомерДокумента,
	|	0 КАК СуммаЗатратБУ,
	|	0 КАК СуммаЗатратНУ,
	|	0 КАК СуммаЗатратУСН
	|
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|УПОРЯДОЧИТЬ ПО
	|	втДанныеДляПроведения.НомерСтроки"+";";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра, Истина);
	
КонецПроцедуры

Функция ПрочиеРасходы(ТекстыЗапроса)
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Возврат
	"ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СуммаРегл,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	0 КАК СуммаПрочихАктивов,
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК РегистрацияВНалоговомОргане,
	|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка) КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК КорСтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК КорПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
	|	ЛОЖЬ КАК РасчетСебестоимости
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаУценки > втДанныеДляПроведения.СуммаПрошлойДооценки
	|	И НЕ ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из доли уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	0 КАК СуммаПрочихАктивов,
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК РегистрацияВНалоговомОргане,
	|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка) КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК КорСтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК КорПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
	|	ЛОЖЬ КАК РасчетСебестоимости
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки < втДанныеДляПроведения.СуммаПрошлойУценки
	|	И НЕ ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	0 КАК СуммаПрочихАктивов,
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК РегистрацияВНалоговомОргане,
	|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка) КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК КорСтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК КорПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
	|	ЛОЖЬ КАК РасчетСебестоимости
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки >= втДанныеДляПроведения.СуммаПрошлойУценки
	|	И НЕ ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)";
	
КонецФункции

Функция ПартииПрочихРасходов(ТекстыЗапроса)
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Возврат
	"ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	втДанныеДляПроведения.СуммаУценки - втДанныеДляПроведения.СуммаПрошлойДооценки КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРеализации,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяОтраженияРасходов
	|	
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаУценки > втДанныеДляПроведения.СуммаПрошлойДооценки
	|	И ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из доли уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРеализации,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяОтраженияРасходов
	|	
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки < втДанныеДляПроведения.СуммаПрошлойУценки
	|	И ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из уценки
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаПрошлойУценки / втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРеализации,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяОтраженияРасходов
	|	
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки >= (втДанныеДляПроведения.СуммаПрошлойУценки)
	|	И ПВХСтатьиРасходов.ВариантРаспределенияРасходов В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)";
	
КонецФункции

#КонецОбласти

#Область ПроведениеПоРеглУчету

Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	Возврат УчетОСВызовСервера.ТекстЗапросаВТОтраженияВРеглУчетеНачисленнойАмортизации("ПереоценкаОС")
		+ УчетОСВызовСервера.ТекстЗапросаВТОтраженияВРеглУчетеОстаткиПоСчетам()
		+ ВТДанныеДокумента()
		+ ВТПредыдущаяПереоценкаОбъектов()
		+ ВТДанныеДляПроведения();
	
КонецФункции

Функция ВТДанныеДокумента()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втТаблицаОбъектов
	|"+
	"ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.НомерСтроки КАК НомерСтроки,
	|	Операция.Дата КАК Дата,
	|	Операция.Организация КАК Организация,
	|	Операция.Подразделение КАК Подразделение,
	|	Строки.ОсновноеСредство КАК ОбъектУчета,
	|	ЕСТЬNULL(Строки.ОсновноеСредство.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	Строки.Стоимость КАК Стоимость,
	|	Операция.СчетДооценки,
	|	Операция.СтатьяДоходов,
	|	Операция.АналитикаДоходов,
	|	Операция.СтатьяРасходов,
	|	Операция.АналитикаРасходов
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.ПереоценкаОС КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС.ОС КАК Строки
	|		ПО Операция.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета" + ";";
	
КонецФункции

Функция ВТПредыдущаяПереоценкаОбъектов()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектов
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета КАК Счет
	|ПОМЕСТИТЬ втВсеСчетаУчетаСтоимости
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|		ПО втОбъектыДокумента.ОбъектУчета = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыЦелевогоФинансированияОС.СчетУчета
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияОС КАК ПараметрыЦелевогоФинансированияОС
	|		ПО втОбъектыДокумента.ОбъектУчета = ПараметрыЦелевогоФинансированияОС.ОсновноеСредство
	|			И (ПараметрыЦелевогоФинансированияОС.ПрименениеЦелевогоФинансирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимостиДанные
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаСтоимости КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) > 0
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) < 0
	|			ТОГДА -ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|				&ГраницаМесяцНачало,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т)) КАК ПервоначальныеСведения
	|		ПО втОбъектыДокумента.ОбъектУчета = ПервоначальныеСведения.ОсновноеСредство
	|ГДЕ
	|	ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаСтоимостиДанные.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втПредыдущаяПереоценкаСтоимостиДанные.СуммаДооценки) КАК СуммаДооценки,
	|	СУММА(втПредыдущаяПереоценкаСтоимостиДанные.СуммаУценки) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимостиСгруппированная
	|ИЗ
	|	втПредыдущаяПереоценкаСтоимостиДанные КАК втПредыдущаяПереоценкаСтоимостиДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредыдущаяПереоценкаСтоимостиДанные.ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаСтоимостиСгруппированная.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки > втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки
	|			ТОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки - втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки > втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки
	|			ТОГДА втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаУценки - втПредыдущаяПереоценкаСтоимостиСгруппированная.СуммаДооценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимости
	|ИЗ
	|	втПредыдущаяПереоценкаСтоимостиСгруппированная КАК втПредыдущаяПереоценкаСтоимостиСгруппированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК Счет
	|ПОМЕСТИТЬ втВсеСчетаУчетаАмортизации
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|		ПО втОбъектыДокумента.ОбъектУчета = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыЦелевогоФинансированияОС.СчетАмортизации
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияОС КАК ПараметрыЦелевогоФинансированияОС
	|		ПО втОбъектыДокумента.ОбъектУчета = ПараметрыЦелевогоФинансированияОС.ОсновноеСредство
	|			И (ПараметрыЦелевогоФинансированияОС.ПрименениеЦелевогоФинансирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаДооценки,
	|	0 КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизацииДанные
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаАмортизации КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриростСтоимостиПоПереоценке)),
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	0,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0))
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаАмортизации КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаОС)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|			И (ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0) > 0
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0) < 0
	|			ТОГДА -ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|				&ГраницаМесяцНачало,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т)) КАК ПервоначальныеСведения
	|		ПО втОбъектыДокумента.ОбъектУчета = ПервоначальныеСведения.ОсновноеСредство
	|ГДЕ
	|	ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаАмортизацииДанные.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втПредыдущаяПереоценкаАмортизацииДанные.СуммаДооценки) КАК СуммаДооценки,
	|	СУММА(втПредыдущаяПереоценкаАмортизацииДанные.СуммаУценки) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизацииСгруппированная
	|ИЗ
	|	втПредыдущаяПереоценкаАмортизацииДанные КАК втПредыдущаяПереоценкаАмортизацииДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредыдущаяПереоценкаАмортизацииДанные.ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаАмортизацииСгруппированная.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки > втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки
	|			ТОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки - втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки > втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки
	|			ТОГДА втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаУценки - втПредыдущаяПереоценкаАмортизацииСгруппированная.СуммаДооценки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизации
	|ИЗ
	|	втПредыдущаяПереоценкаАмортизацииСгруппированная КАК втПредыдущаяПереоценкаАмортизацииСгруппированная" + ";";
	
КонецФункции

Функция ВТДанныеДляПроведения()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втДанныеДляПроведения
	|"+
	"ВЫБРАТЬ
	|	втДанныеДокумента.Ссылка КАК Ссылка,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	втДанныеДокумента.Дата КАК Дата,
	|	втДанныеДокумента.ОбъектУчета,
	|	втДанныеДокумента.Организация КАК Организация,
	|	втДанныеДокумента.Подразделение КАК Подразделение,
	|	втДанныеДокумента.СчетДооценки КАК СчетДооценки,
	|	втДанныеДокумента.СтатьяДоходов КАК СтатьяДоходов,
	|	втДанныеДокумента.АналитикаДоходов КАК АналитикаДоходов,
	|	втДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	втДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	втСчетаОтражения.СчетУчета КАК СчетУчета,
	|	втСчетаОтражения.СчетНачисленияАмортизации КАК СчетАмортизации,
	|	втСчетаОтражения.СчетУчетаЦФ КАК СчетУчетаЦФ,
	|	втСчетаОтражения.СчетНачисленияАмортизацииЦФ КАК СчетАмортизацииЦФ,
	|	втСчетаОтражения.ПрименениеЦелевогоФинансирования КАК ПрименениеЦелевогоФинансирования,
	|	втСчетаОтражения.СтатьяДоходов КАК СтатьяДоходовЦФ,
	|	втСчетаОтражения.АналитикаДоходов КАК АналитикаДоходовЦФ,
	|	втДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) КАК ВосстановительнаяСтоимость,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ, 0) КАК ВосстановительнаяСтоимостьСобственныхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) КАК ВосстановительнаяСтоимостьЦелевыхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0) КАК НакопленнаяАмортизация,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0) КАК НакопленнаяАмортизацияСобственныхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0) КАК НакопленнаяАмортизацияЦелевыхСредств,
	|	втДанныеДокумента.Стоимость КАК НоваяСтоимость,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втДанныеДокумента.Стоимость < втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ
	|			ТОГДА 0
	|		ИНАЧЕ втДанныеДокумента.Стоимость - (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ)
	|	КОНЕЦ КАК СуммаДооценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ < втДанныеДокумента.Стоимость
	|			ТОГДА 0
	|		ИНАЧЕ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ - втДанныеДокумента.Стоимость
	|	КОНЕЦ КАК СуммаУценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втДанныеДокумента.Стоимость < втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ = 0
	|			ТОГДА 0
	|		ИНАЧЕ - (втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ) + ВЫРАЗИТЬ((втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ)*(втДанныеДокумента.Стоимость / (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаДооценкиАмортизации,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ < втДанныеДокумента.Стоимость
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ = 0
	|			ТОГДА 0
	|		ИНАЧЕ (втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ) - ВЫРАЗИТЬ((втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ)*(втДанныеДокумента.Стоимость / (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаУценкиАмортизации,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ < втДанныеДокумента.Стоимость
	|			ТОГДА 0
	|		ИНАЧЕ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ - втДанныеДокумента.Стоимость
	|	КОНЕЦ КАК СуммаУценкиСтоимостиЦелевыхСредств,
	|	ВЫБОР
	|		КОГДА (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ) = 0
	|			ТОГДА 0
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ < ВЫРАЗИТЬ((втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ)*(втДанныеДокумента.Стоимость / (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ)) КАК ЧИСЛО(15, 2))
	|			ТОГДА 0
	|		ИНАЧЕ втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ - ВЫРАЗИТЬ((втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ)*(втДанныеДокумента.Стоимость / (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаУценкиАмортизацииЦелевыхСредств,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаСтоимости.СуммаДооценки, 0) КАК СуммаПрошлойДооценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаСтоимости.СуммаУценки, 0) КАК СуммаПрошлойУценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаАмортизации.СуммаДооценки, 0) КАК СуммаПрошлойДооценкиАмортизации,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаАмортизации.СуммаУценки, 0) КАК СуммаПрошлойУценкиАмортизации
	|ПОМЕСТИТЬ втДанныеДляПроведения
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаОтражения КАК втСчетаОтражения
	|		ПО втДанныеДокумента.ОбъектУчета = втСчетаОтражения.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК втОстаткиПоСчетам
	|		ПО втДанныеДокумента.ОбъектУчета = втОстаткиПоСчетам.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаСтоимости КАК втПредыдущаяПереоценкаСтоимости
	|		ПО втДанныеДокумента.ОбъектУчета = втПредыдущаяПереоценкаСтоимости.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаАмортизации КАК втПредыдущаяПереоценкаАмортизации
	|		ПО втДанныеДокумента.ОбъектУчета = втПредыдущаяПереоценкаАмортизации.ОбъектУчета" + ";";
	
КонецФункции

Функция ТекстОтраженияВРеглУчете() Экспорт
	
	Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
	
	Возврат УчетОСВызовСервера.ТекстОтраженияВРеглУчетеНачисленнойАмортизации()
		
		+ Разделитель + ДооценкаВосстановительнойСтоимости()
		+ Разделитель + ДооценкаВосстановительнойСтоимостиИзДолиУценки()
		+ Разделитель + ДооценкаВосстановительнойСтоимостиИзУценки()
		
		+ Разделитель + ДооценкаНакопленнойАмортизации()
		+ Разделитель + ДооценкаНакопленнойАмортизацииИзДолиУценки()
		+ Разделитель + ДооценкаНакопленнойАмортизацииИзУценки()
		
		+ Разделитель + УценкаВосстановительнойСтоимости()
		+ Разделитель + УценкаВосстановительнойСтоимостиЦФ()
		+ Разделитель + УценкаВосстановительнойСтоимостиИзДолиДооценки()
		+ Разделитель + УценкаВосстановительнойСтоимостиИзДооценки()
		
		+ Разделитель + УценкаНакопленнойАмортизации()
		+ Разделитель + УценкаНакопленнойАмортизацииЦФ()
		+ Разделитель + УценкаНакопленнойАмортизацииИзДолиДооценки()
		+ Разделитель + УценкаНакопленнойАмортизацииИзДооценки()
		
		+ Разделитель + ПризнаниеДоходовОтЦелевогоФинансирования();
	
КонецФункции

Функция ДооценкаВосстановительнойСтоимости()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости (Дт СчетУчета :: Кт СчетДооценки)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка восстановительной стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаВосстановительнойСтоимостиИзДолиУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости из уценки (Дт СчетУчета :: Кт 91.01)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка восстановительной стоимости из предыдущей уценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости < втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаВосстановительнойСтоимостиИзУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости из предыдущей уценки (Дт СчетУчета :: Кт 91.01)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка восстановительной стоимости из предыдущей уценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации (Дт СчетДооценки :: Кт СчетАмортизации)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка накопленной амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаДооценкиАмортизации > втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизацииИзДолиУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации из уценки (Дт 91.02 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка накопленной амортизации из предыдущей уценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаДооценкиАмортизации < втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизацииИзУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации из уценки (Дт 91.02 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка накопленной амортизации из предыдущей уценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаДооценкиАмортизации >= втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимости()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости (Дт 91.02 :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости - втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости - втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости - втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка восстановительной стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости + втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиЦФ()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка целевых средств в восстановительной стоимости (Дт 91.02 :: Кт СчетУчетаЦФ)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчетаЦФ КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка целевых средств в восстановительной стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств > 0
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиИзДолиДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости из дооценки (Дт СчетДооценки :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка восстановительной стоимости из предыдущей дооценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости < втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиИзДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости из предыдущей дооценки (Дт СчетДооценки :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка восстановительной стоимости из предыдущей дооценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаНакопленнойАмортизации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации (Дт СчетАмортизации :: Кт 91.01)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка накопленной амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаУценкиАмортизации > втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации + втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция УценкаНакопленнойАмортизацииЦФ()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка целевых средств в накопленной амортизации (Дт СчетАмортизации :: Кт 91.01)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизацииЦФ КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка целевых средств в накопленной амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств > 0
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция УценкаНакопленнойАмортизацииИзДолиДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации из дооценки (Дт СчетАмортизации :: Кт СчетДооценки)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка накопленной амортизации из предыдущей дооценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаУценкиАмортизации < втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция УценкаНакопленнойАмортизацииИзДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации из дооценки (Дт СчетАмортизации :: Кт СчетДооценки)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка накопленной амортизации из предыдущей дооценки"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|		ПО втДанныеДляПроведения.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаУценкиАмортизации >= втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации
	|	И втПервоначальныеСведения.ЕстьСчетАмортизации
	|";
КонецФункции

Функция ПризнаниеДоходовОтЦелевогоФинансирования()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Признание доходов от целевого финансирования (Дт 98 :: Кт 91)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК Сумма,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияОС) КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходовЦФ КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходовЦФ КАК СубконтоКт1,
	|	втДанныеДляПроведения.АналитикаДоходовЦФ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Признание доходов от целевого финансирования при уценке остаточной стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств > 0
	|	И втДанныеДляПроведения.ПрименениеЦелевогоФинансирования
	|";
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации)
	
	ВходящиеДанные = Новый Соответствие;
	
	УчетОСВызовСервера.ЗаполнитьВходящиеДанныеАмортизации(ВходящиеДанные);
	
	ЗакрытиеМесяцаУТВызовСервера.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
