#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоТорговаяНадбавка = Параметры.ЭтоТорговаяНадбавка;
	
	СтруктураПараметров = ПолучитьПараметры(Параметры, ЭтоТорговаяНадбавка);
	СтруктураПараметров.Вставить("ВыделенныеСтроки", Параметры.ВыделенныеСтроки); 
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураПараметров);

	Если ЭтоТорговаяНадбавка Тогда
		ЭтаФорма.Заголовок = "Ставка торговой надбавки";
		Элементы.СтавкаТН.Видимость = Истина;
		Элементы.РозничнаяСтавкаНДС.Видимость = Ложь;		
	Иначе
		ЭтаФорма.Заголовок = "Ставка розничного НДС";
		Элементы.СтавкаТН.Видимость = Ложь;
		Элементы.РозничнаяСтавкаНДС.Видимость = истина
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПараметры(Источник, ЭтоТорговаяНадбавка)
	
	СтруктураПараметров = Новый Структура("СтавкаТН, РозничнаяСтавкаНДС, ВыделенныеСтроки");			
   	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И Не СохранитьПараметры Тогда
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
		СписокКнопок.Добавить("НеЗакрывать", НСтр("ru = 'Не закрывать'"));
		
		ОтветНаВопрос = Вопрос(НСтр("ru = 'Закрыть форму без сохранения реквизитов?'"), СписокКнопок);
		
		Если ОтветНаВопрос = "НеЗакрывать" Тогда
			Отказ = Истина;
			СохранитьПараметры = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИзменяемыеРеквизиты(Источник)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СтавкаТН", Источник.СтавкаТН);
	СтруктураПараметров.Вставить("РозничнаяСтавкаНДС", Источник.РозничнаяСтавкаНДС);
	СтруктураПараметров.Вставить("ВыделенныеСтроки", Источник.ВыделенныеСтроки);
		
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если СохранитьПараметры Тогда	
		СтруктураПараметров = ИзменяемыеРеквизиты(ЭтаФорма);
		ОповеститьОВыборе(СтруктураПараметров);		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьПараметры = Истина;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

