
#Область ПрограммныйИнтерфейс

// Возвращает таблицу видов аналитик с колонкой типов
// 
// Возвращаемое значение:
//	ТаблицаЗначений - все доступные виды аналитик
//		* Ссылка      - ПланыВидовХарактеристик.АналитикиСтатейБюджетов - вид аналитики
//		* ТипЗначения - ОписаниеТипов - тип вида аналитики
// 
Функция ТипыВидовВидыАналитик() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	АналитикиСтатейБюджетов.Ссылка,
	|	АналитикиСтатейБюджетов.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.АналитикиСтатейБюджетов КАК АналитикиСтатейБюджетов");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
