#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	КомандаОтчет = КомандыОтчетов.Добавить();
	КомандаОтчет.Идентификатор = Метаданные.Отчеты.ТоварыСхемыОбеспечения.ПолноеИмя();
	КомандаОтчет.Представление = НСтр("ru = 'Товары без схемы обеспечения'");
	КомандаОтчет.СписокФорм = "ФормаСписка";
	КомандаОтчет.Порядок       = 50;
	КомандаОтчет.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
	КомандаОтчет.МестоРазмещенияКоманды = "ПодменюОтчетыПерейти";
	КомандаОтчет.ПараметрыФормы.Вставить("КлючВарианта", "ТоварыБезСхемыОбеспеченияКонтекст");
	КомандаОтчет.ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
КонецПроцедуры

// Возвращает количество товаров для которых используется указанная схема обеспечения.
// 
// Параметры:
//   СхемаОбеспечения - СправочникСсылка.СхемыОбеспечения - Ссылка на схему обеспечения
//
Функция КоличествоИспользований(СхемаОбеспечения) Экспорт
	
	Если Не ЗначениеЗаполнено(СхемаОбеспечения) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоИспользований
	|ИЗ
	|	Справочник.Номенклатура КАК Таблица
	|ГДЕ
	|	Таблица.СхемаОбеспечения = &Ссылка
	|	И НЕ Таблица.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", СхемаОбеспечения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоИспользований = 0;
	Если Выборка.Следующий() Тогда
		КоличествоИспользований = Выборка.КоличествоИспользований;
	КонецЕсли;
	
	Возврат КоличествоИспользований;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		Параметры.Вставить("Источник", "СхемаОбеспечения");
		ВыбраннаяФорма = Метаданные.Обработки.НастройкаСпособовОбеспеченияПотребностей.Формы.Форма;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

