
Функция СтруктураРегистра() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	БланкиСтрогойОтчетности.Период КАК Период,
	|	БланкиСтрогойОтчетности.Регистратор КАК Регистратор,
	|	БланкиСтрогойОтчетности.НомерСтроки КАК НомерСтроки,
	|	БланкиСтрогойОтчетности.ВидДвижения КАК ВидДвижения,
	|	БланкиСтрогойОтчетности.Склад КАК Склад,
	|	БланкиСтрогойОтчетности.ФизическоеЛицо КАК ФизическоеЛицо,
	|	БланкиСтрогойОтчетности.Номенклатура КАК Номенклатура,
	|	БланкиСтрогойОтчетности.Характеристика КАК Характеристика,
	|	БланкиСтрогойОтчетности.Тип КАК Тип,
	|	БланкиСтрогойОтчетности.Серия КАК Серия,
	|	БланкиСтрогойОтчетности.Номер КАК Номер,
	|	БланкиСтрогойОтчетности.Количество КАК Количество,
	|	БланкиСтрогойОтчетности.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.БланкиСтрогойОтчетности КАК БланкиСтрогойОтчетности";
	
	ТаблицаНабор = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаНабор;
	
КонецФункции