#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьОбязательныеНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбязательныеНастройки()
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ЕдиницаИзмеренияЭтапа",
		НСтр("ru='единиц/партий'"));
		
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ОбозначениеЭтап",
		НСтр("ru='Этап'"));
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ОбозначениеПродукция",
		НСтр("ru='Продукция'"));
		
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ОбозначениеПобочнаяПродукция",
		НСтр("ru='Побочная продукция'"));
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ОбозначениеПолуфабрикат",
		НСтр("ru='Полуфабрикат'"));
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"СтатусГрафика",
		РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли