
// Процедура формирования движений по регистру "Обороты бюджетов".
//
Процедура ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаЗначенияНефинансовыхПоказателей = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗначенияНефинансовыхПоказателей;
	
	Если Отказ ИЛИ ТаблицаЗначенияНефинансовыхПоказателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЛимитыРасходаДенежныхСредств = Движения.ЗначенияНефинансовыхПоказателей;
	ДвиженияЛимитыРасходаДенежныхСредств.Записывать = Истина;
	ДвиженияЛимитыРасходаДенежныхСредств.Загрузить(ТаблицаЗначенияНефинансовыхПоказателей);
	
КонецПроцедуры
