
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Фильтр", НСтр("ru = 'Файлы ЭСЧФ (*.xml)'") + "|*.xml" );
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораФайла", ЭтотОбъект);
	Идентификатор = Новый УникальныйИдентификатор;
	
	ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, НастройкиДиалога, Новый УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораФайла(Знач РезультатПомещенияФайлов, Знач ДополнительныеПараметры) Экспорт 
	
	ОчиститьСообщения();
	
	Если РезультатПомещенияФайлов.ОписаниеОшибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПомещенияФайлов.ОписаниеОшибки);
		Возврат;
	КонецЕсли;	
	
	ЗагрузитьИзXML(РезультатПомещенияФайлов);
	Оповестить("ОбновитьСостояниеЭД");
	
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьИзXML(РезультатПомещенияФайлов)
	
	ЭлектронныеСчетаФактуры.ЗагрузитьИзXML(РезультатПомещенияФайлов);
	
КонецПроцедуры	
