
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Интеграция1СБухфон
	ЕстьПравоДоступаКБухфону = ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.Запустить1СБухфон);
	Если ЕстьПравоДоступаКБухфону Тогда
		НастройкиПользователя = Интеграция1СБухфонВызовСервера.НастройкиУчетнойЗаписиПользователя();
		Элементы.ОбщаяКомандаЗапустить1СБухфон.Видимость = НастройкиПользователя.ВидимостьКнопки1СБухфон;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Интеграция1СБухфон
	
	Если НЕ Элементы.ОбщаяКомандаЗапустить1СБухфон.Видимость Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Интеграция1СБухфон
	Если ЕстьПравоДоступаКБухфону Тогда
		ТехнологияСервисаИнтеграцияСБСПКлиент.Интеграция1СБухфонКлиентОбработкаОповещения(ИмяСобытия, Элементы.ОбщаяКомандаЗапустить1СБухфон);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Интеграция1СБухфон

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Интеграция1СБухфон
&НаКлиенте
Процедура Запустить1СБухфон(Команда)
	
	Интеграция1СБухфонКлиент.Запустить1СБухфон();
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Интеграция1СБухфон

#КонецОбласти