#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Процедура заполняет значения ставки рефинансирования.
// Центрального Банка Российской Федерации 
//
Процедура ЗаполнитьЗначенияСтавкиРефинансированияЦБ() Экспорт
	
	КлассификаторXML = РегистрыСведений.СтавкаРефинансированияЦБ.ПолучитьМакет("СтавкаРефинансированияЦБ").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.СтавкаРефинансированияЦБ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Период = Дата(СтрокаКлассификатора.Date);
		СтрокаНабора.Размер	= Число(СтрокаКлассификатора.Rate);
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли