#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	
	
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НаДату > '20080601' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.Версия500;
	ИначеЕсли НаДату > '20050101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.Версия300;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2017кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом ФНС России от 10.10.2016 г. № ММВ-7-11/552@";
	НоваяФорма.РедакцияФормы	  = "от 10.10.2016 г. № ММВ-7-11/552@";
	НоваяФорма.ДатаНачалоДействия = '20160101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2016кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом ФНС России от 25.11.2015 г. № ММВ-7-11/544@";
	НоваяФорма.РедакцияФормы	  = "от 25.11.2015 г. № ММВ-7-11/544@";
	НоваяФорма.ДатаНачалоДействия = '20150101';
	НоваяФорма.ДатаКонецДействия  = '20151231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом ФНС России от 24.12.2014 г. № ММВ-7-11/671@";
	НоваяФорма.РедакцияФормы	  = "от 24.12.2014 г. № ММВ-7-11/671@";
	НоваяФорма.ДатаНачалоДействия = '20140101';
	НоваяФорма.ДатаКонецДействия  = '20151231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2014кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом ФНС России от 10.11.2011 г. № ММВ-7-3/760@ (в редакции приказа ФНС России от 14.11.2013 г. N ММВ-7-3/501@)";
	НоваяФорма.РедакцияФормы	  = "от 14.11.2013 г. N ММВ-7-3/501@";
	НоваяФорма.ДатаНачалоДействия = '20130101';
	НоваяФорма.ДатаКонецДействия  = '20141231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2011кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом ФНС России от 10.11.2011 г. № ММВ-7-3/760@";
	НоваяФорма.РедакцияФормы	  = "от 10.11.2011 г. № ММВ-7-3/760@";
	НоваяФорма.ДатаНачалоДействия = '20110101';
	НоваяФорма.ДатаКонецДействия  = '20131231';
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
		
	ТаблицаДанныхРеглОтчета = ИнтерфейсыВзаимодействияБРО.НовыйТаблицаДанныхРеглОтчета();
	
	ДанныеРеглОтчета = ЭкземплярРеглОтчета.ДанныеОтчета.Получить();
	Если ТипЗнч(ДанныеРеглОтчета) <> Тип("Структура") Тогда
		Возврат ТаблицаДанныхРеглОтчета;
	КонецЕсли;
	
	Если ЭкземплярРеглОтчета.ВыбраннаяФорма = "ФормаОтчета2015кв1"
		ИЛИ ЭкземплярРеглОтчета.ВыбраннаяФорма = "ФормаОтчета2016кв1"
		ИЛИ ЭкземплярРеглОтчета.ВыбраннаяФорма = "ФормаОтчета2017кв1"
		Тогда
		
		// Сумма платежа
		// Раздел 1 (многостраничный)
		// 020 - КБК
		// 030 - ОКТМО
		// 040 - сумма
		
		ИмяКБК     = "П000100001020"; // 020
		ИмяОКТМО   = "П000100001030"; // 030
		ИмяСумма   = "П000100001040"; // 040
		ИмяРаздела = "Раздел1";
		
	Иначе
		
		// Сумма платежа
		// Раздел 6 (многостраничный)
		// 020 - КБК
		// 030 - ОКАТО
		// 040 - сумма
		
		ИмяКБК     = "П000060002003"; // 020
		ИмяОКТМО   = "П000060003003"; // 030
		ИмяСумма   = "П000060004003"; // 040
		ИмяРаздела = "Раздел6";
		
	КонецЕсли;
	
	Если ДанныеРеглОтчета.ДанныеМногостраничныхРазделов.Свойство(ИмяРаздела) Тогда
		
		Раздел = ДанныеРеглОтчета.ДанныеМногостраничныхРазделов[ИмяРаздела];
		
		Период = ЭкземплярРеглОтчета.ДатаОкончания;
		
		Для Каждого Страница Из Раздел Цикл
			
			Данные = Страница.Данные;
			
			Сумма = ТаблицаДанныхРеглОтчета.Добавить();
			Сумма.Период = Период;
			Сумма.КБК    = Данные[ИмяКБК];
			Сумма.ОКАТО  = Данные[ИмяОКТМО];
			Сумма.Сумма  = Данные[ИмяСумма];
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	Возврат ТаблицаДанныхРеглОтчета;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");
	
	СтрокаФормыПоФормату = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "1151020", '20111110', "ММВ-7-3/760@", "ФормаОтчета2011Кв1");
	ОпределитьФорматВДеревеФормИФорматов(СтрокаФормыПоФормату, "5.07");
	
	СтрокаФормыПоФормату = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "1151020", '20131114', "ММВ-7-3/501@", "ФормаОтчета2014кв1");
	ОпределитьФорматВДеревеФормИФорматов(СтрокаФормыПоФормату, "5.08");
	
	СтрокаФормыПоФормату = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "1151020", '20141224', "ММВ-7-11/671@", "ФормаОтчета2015кв1");
	ОпределитьФорматВДеревеФормИФорматов(СтрокаФормыПоФормату, "5.09");
	
	СтрокаФормыПоФормату = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "1151020", '20151125', "ММВ-7-11/544@", "ФормаОтчета2016кв1");
	ОпределитьФорматВДеревеФормИФорматов(СтрокаФормыПоФормату, "5.10");
	
	СтрокаФормыПоФормату = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "1151020", '20161010', "ММВ-7-11/552@", "ФормаОтчета2017кв1");
	ОпределитьФорматВДеревеФормИФорматов(СтрокаФормыПоФормату, "5.11");
	
	Возврат ФормыИФорматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр                       = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код                   = СокрЛП(Код);
	НовСтр.ДатаПриказа           = ДатаПриказа;
	НовСтр.НомерПриказа          = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия    = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта            = СокрЛП(ИмяОбъекта);
	НовСтр.Описание              = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр                       = Форма.Строки.Добавить();
	НовСтр.Код                   = СокрЛП(Версия);
	НовСтр.ДатаПриказа           = ДатаПриказа;
	НовСтр.НомерПриказа          = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия    = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта            = СокрЛП(ИмяОбъекта);
	НовСтр.Описание              = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

#КонецОбласти

#КонецЕсли