#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетФактураКомиссионеру") Тогда
		// Это исправление счета-фактуры
		ЗаполнитьПоСчетуФактуреОснованию(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Дата") Тогда
			Дата = ДанныеЗаполнения.Дата;
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	// 4D:ERP для Беларуси
	// ЭСЧФ
	// {
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Основание = ОпределитьДокументОснованиеДляЗаполнения(ДанныеЗаполнения);
		ЗаполнитьОсновныеРеквизиты(Основание);
		ЗаполнитьВидДокумента(Основание);
		ЗаполнитьУсловияПоставки(Основание);
		ЗаполнитьТабличнуюЧасть(Основание);
	КонецЕсли;
	// }
	// 4D
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ЗначениеЗаполнено(ДокументОснование) И НЕ ЗначениеЗаполнено(Дата) Тогда
		
		ДатаДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");
		Дата = ?(ДатаДокументаОснования = КонецДня(ДатаДокументаОснования), ДатаДокументаОснования, ДатаДокументаОснования + 1);
		
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	Сводный = (Покупатели.Количество() > 1); 
	
	// 4D:ERP для Беларуси 
	// ЭСЧФ
	// {
	ЭлектронныеСчетаФактуры.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	СуммаАкциза = Товары.Итог("СуммаАкциза");
	СуммаНДС = Товары.Итог("СуммаНДС");
	СуммаДокумента = Товары.Итог("СуммаСНДС");
	// }
	// 4D 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.СчетФактураКомиссионеру.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДоходыИРасходыСервер.ОтразитьЖурналУчетаСчетовФактур(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьНДСЗаписиКнигиПродаж(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Проведен") Тогда
		
		ТекстСообщения = НСтр("ru = 'Счет-фактуру можно провести только на основании проведенного документа.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"ДокументОснование",
			, // ПутьКДанным 
			Отказ);
	
	КонецЕсли;
	
	Если Организация = Комиссионер Тогда
		
		ТекстСообщения = НСтр("ru = 'Комиссионер не должен совпадать с организацией.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"Комиссионер",
			, // ПутьКДанным 
			Отказ);
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НомерИсправления");
	КонецЕсли;
	
	Если НЕ Исправление Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетФактураОснование");
		МассивНепроверяемыхРеквизитов.Добавить("НомерИсправления");
	КонецЕсли;
	
	Если Дата < Константы.ДатаНачалаПримененияПостановления1137.Получить() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Валюта");
		МассивНепроверяемыхРеквизитов.Добавить("КодВидаОперации");
	КонецЕсли;
	
	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить("Покупатель");
	КлючевыеРеквизиты.Добавить("НомерСчетаФактуры");
	ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(ЭтотОбъект, "Покупатели", КлючевыеРеквизиты, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	// 4D:ERP для Беларуси, ВалентинМ, 19.06.2017 16:05:48 
	// ЭСЧФ
	// {
	ДополнительныеСвойства.Вставить("ПроведениеИзФормыДокумента", Ложь);
	// }
	// 4D 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Запись наборов записей
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтчетыКомиссионеров = Новый Массив;
	ОтчетыКомиссионеров.Добавить(ЭтотОбъект.ДокументОснование);
	РегистрыСведений.СчетаФактурыКомиссионерамКОформлению.ОбновитьСостояние(ОтчетыКомиссионеров);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если Исправление Тогда
		
		// Установка номера по исходному документу.
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсходныеДокументы.Номер КАК Номер,
		|	ЕСТЬNULL(Исправления.НомерИсправления, 0) КАК НомерИсправления
		|ИЗ
		|	Документ.СчетФактураКомиссионеру КАК ИсходныеДокументы
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		Документ.СчетФактураКомиссионеру КАК Исправления
		|	ПО 
		|		Исправления.ДокументОснование = ИсходныеДокументы.ДокументОснование
		|		И Исправления.Проведен
		|		И Исправления.Исправление
		|ГДЕ
		|	ИсходныеДокументы.Ссылка = &СчетФактураОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерИсправления УБЫВ
		|";
		
		Запрос.УстановитьПараметр("Основание", ДокументОснование);
		Запрос.УстановитьПараметр("СчетФактураОснование", СчетФактураОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			СтандартнаяОбработка = Ложь;
			
			// Установка номера и переопределение префикса информационной базы.
			Префикс = "И";
			ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, СтандартнаяОбработка, Префикс);
			
			НомерБезПрефикса = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(Выборка.Номер, Истина, Истина);
			Если СтрДлина(СокрП(НомерБезПрефикса)) = 7 Тогда
				НомерБезПрефикса = Прав(НомерБезПрефикса, СтрДлина(НомерБезПрефикса)-1);
			КонецЕсли;
			Номер = Префикс + НомерБезПрефикса;
			
			НомерИсправления = Формат(Число(Выборка.НомерИсправления)+1, "ЧЦ=10; ЧДЦ=0; ЧГ=0");
			
		КонецЕсли;
		
	Иначе
		
		Префикс = "0";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// 4D:ERP для Беларуси
// ЭСЧФ
// {
#Область Шапка

Процедура ЗаполнитьОсновныеРеквизиты(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ОпределитьДокументОснованиеДляЗаполнения();	
	КонецЕсли;
	
	Дата 					  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Дата");
	Валюта 					  = Константы.ВалютаРегламентированногоУчета.Получить();
	МетаданныеДокумента = Основание.Метаданные();
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
		
		ТипСчетаФактуры = Справочники.ТипыЭСЧФ.Исходный;
		СтатусПоставщика = Справочники.СтатусыПоставщикаЭСЧФ.ИностраннаяОрганизация;
		СтатусПолучателя = Справочники.СтатусыПолучателяЭСЧФ.Покупатель;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
			
			Комиссионер = Основание.Контрагент;
			Договор    = Основание.Договор;
			ДатаПраваНаВычет = Основание.Дата;
			НомерЗаявленияОВвозеТоваров = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Основание.Номер, Истина, Истина);
			ДатаЗаявленияОВвозеТоваров  = Основание.Дата;
			Для Каждого ТекСтрока Из Основание.Товары Цикл
				ДокументПоступления = ТекСтрока.ДокументПоступления;
				Если ЗначениеЗаполнено(ДокументПоступления) Тогда
					ДатаВвозаТоваров   	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "Дата");
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			Грузоотправитель 		  = Комиссионер;
			СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Грузоотправитель, Основание.Дата);
			АдресГрузоотправителя     = СведенияОГрузоотправителе.ЮридическийАдрес;
			
			Грузополучатель			  = Основание.Организация;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Грузополучатель,  Основание.Дата);
			АдресГрузополучателя      = СведенияОГрузополучателе.ЮридическийАдрес;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
			
			ЗначенияРеквизитов       = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Дата, НомерДекларации, КонтрагентПоставщика, Организация, Контрагент");
			
			ДатаПраваНаВычет 					= ЗначенияРеквизитов.Дата + 90*24*60*60;
			РегистрационныйНомерВыпускаТоваров  = ЗначенияРеквизитов.НомерДекларации;
			Комиссионер 						= ЗначенияРеквизитов.КонтрагентПоставщика;
			Для Каждого ТекСтрока Из Основание.Товары Цикл
				ДокументПоступления = ТекСтрока.ДокументПоступления;
				Если ЗначениеЗаполнено(ДокументПоступления) Тогда
					Договор   					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "Договор");
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Грузоотправитель 		  = ЗначенияРеквизитов.КонтрагентПоставщика;
			СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Грузоотправитель, Основание.Дата);
			АдресГрузоотправителя     = СведенияОГрузоотправителе.ЮридическийАдрес;
			
			Грузополучатель			  = ЗначенияРеквизитов.Организация;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Грузополучатель,  Основание.Дата);
			АдресГрузополучателя      = СведенияОГрузополучателе.ЮридическийАдрес;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда 
		
		ТипСчетаФактуры          = Справочники.ТипыЭСЧФ.ДополнительныйБезСсылки;
		СтатусПоставщика         = Справочники.СтатусыПоставщикаЭСЧФ.Продавец;
		СтатусПолучателя         = Справочники.СтатусыПолучателяЭСЧФ.Покупатель;
		
		ЗначенияРеквизитов       = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Договор, Организация, Контрагент, ДокументРеализации");
		Договор		             = ЗначенияРеквизитов.Договор;
		Грузоотправитель         = ЗначенияРеквизитов.Организация;
		Грузополучатель          = ЗначенияРеквизитов.Контрагент;
		
		ВидДокумента             = Справочники.ВидыДокументовЭСЧФ.ТТН_1;
		КодБланкаИсходящегоДокумента
			  	 				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "КодБланка");
	
		ТаблицаОснований = Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(ЗначенияРеквизитов.ДокументРеализации,,, Истина);
		Для Каждого ТекущаяСтрока ИЗ ТаблицаОснований Цикл
			
			СчетФактураОснование	= ТекущаяСтрока.Ссылка;
			ЭД = ЭлектронныеСчетаФактуры.ПолучитьЭДПоВладельцу(ТекущаяСтрока.Ссылка);
			Если ЭД <> Неопределено Тогда 
				Исправление				= Истина;
				ТипСчетаФактуры         = Справочники.ТипыЭСЧФ.Дополнительный;
				НомерИсходногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭД, "НомерЭД");
			КонецЕсли;	
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		СтатусПоставщика         = Справочники.СтатусыПоставщикаЭСЧФ.Продавец;
		СтатусПолучателя         = Справочники.СтатусыПолучателяЭСЧФ.Покупатель;
		ТипСчетаФактуры          = Справочники.ТипыЭСЧФ.Исправленный;
		ЗначенияРеквизитов       = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Дата, Договор, Организация, Контрагент, ДокументОснование");
		
		Договор		             = ЗначенияРеквизитов.Договор;
		ДатаАннулирования        = ЗначенияРеквизитов.Дата;
								 
		ТаблицаОснований = Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(ЗначенияРеквизитов.ДокументОснование,,, Истина);
		Для Каждого ТекущаяСтрока ИЗ ТаблицаОснований Цикл
			
			СчетФактураОснование	= ТекущаяСтрока.Ссылка;
			ЭД = ЭлектронныеСчетаФактуры.ПолучитьЭДПоВладельцу(ТекущаяСтрока.Ссылка);
			Если ЭД <> Неопределено Тогда 
				Исправление 			= Истина; 
				НомерИсходногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭД, "НомерЭД");
			КонецЕсли;	
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Договор");
		Договор = ЗначенияРеквизитов.Договор;
		
		
		ТипСчетаФактуры = Справочники.ТипыЭСЧФ.Исходный;
		СтатусПоставщика = Справочники.СтатусыПоставщикаЭСЧФ.Продавец;
		СтатусПолучателя = Справочники.СтатусыПолучателяЭСЧФ.Покупатель;
		
	Иначе
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеДокумента) Тогда
		  	Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Договор");
		КонецЕсли;
		
		ТипСчетаФактуры = Справочники.ТипыЭСЧФ.Исходный;
		СтатусПоставщика = Справочники.СтатусыПоставщикаЭСЧФ.Продавец;
		СтатусПолучателя = Справочники.СтатусыПолучателяЭСЧФ.Покупатель;
		
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипБСО", МетаданныеДокумента) Тогда
		ТипБСО     					  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ТипБСО");
		КодБланкаИсходящегоДокумента  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипБСО, "КодБланка");
		ВидДокумента                  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипБСО, "ВидДокумента");
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьВидДокумента(Основание = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Основание = Неопределено Тогда
		Основание = ОпределитьДокументОснованиеДляЗаполнения();	
	КонецЕсли;
	
	МетаданныеДокумента = Основание.Метаданные();
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
		ВидДокумента = Справочники.ВидыДокументовЭСЧФ.Счет_фактура;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		ВидДокумента = Справочники.ВидыДокументовЭСЧФ.АктВыполненныхРабот;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
		ВидДокумента = Справочники.ВидыДокументовЭСЧФ.Акт;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипБСО", МетаданныеДокумента) Тогда	
		ТипБСО       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ТипБСО");
		ВидДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипБСО, "ВидДокумента");
	КонецЕсли;		
	
КонецПроцедуры

Процедура ЗаполнитьУсловияПоставки(Основание = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ВидДокумента) Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Основание = Неопределено Тогда
		Основание = ОпределитьДокументОснованиеДляЗаполнения();	
	КонецЕсли;
	
	МетаданныеДокумента = Основание.Метаданные();
	
	Если ВидДокумента = Справочники.ВидыДокументовЭСЧФ.ТН_2 
	          ИЛИ ВидДокумента = Справочники.ВидыДокументовЭСЧФ.ЭлектроннаяТН_2
			  ИЛИ ВидДокумента = Справочники.ВидыДокументовЭСЧФ.ТТН_1
			  ИЛИ ВидДокумента = Справочники.ВидыДокументовЭСЧФ.ЭлектроннаяТТН_1 Тогда
			  
	  	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерИсходящегоДокумента", МетаданныеДокумента) Тогда
			 НомерИсходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "НомерИсходящегоДокумента");
			 
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", МетаданныеДокумента) Тогда
			 НомерИсходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "НомерВходящегоДокумента");
			 
		Иначе
			 НомерИсходящегоДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(
			  									ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Номер"), Истина, Истина);
		КонецЕсли;
			  
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СерияИсходящегоДокумента", МетаданныеДокумента) Тогда
			 СерияИсходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "СерияИсходящегоДокумента");
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СерияВходящегоДокумента", МетаданныеДокумента) Тогда
			 СерияИсходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "СерияВходящегоДокумента");
		КонецЕсли;
			  
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ТипБСО", МетаданныеДокумента) Тогда
		  	ТипБСО     					  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ТипБСО");
		  	КодБланкаИсходящегоДокумента  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипБСО, "КодБланка");
		КонецЕсли;
		  
		ЗаполнитьРеквизитыТТН_1(Основание);
	
	Иначе 	
		
		 НомерИсходящегоДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(
		  									ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Номер"), Истина, Истина);
		
	КонецЕсли;
	
	ДатаИсходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Дата");
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеДокумента) И НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Договор");	
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыТТН_1(Основание = Неопределено) Экспорт
	
	Если ВидДокумента <> Справочники.ВидыДокументовЭСЧФ.ТТН_1 И ВидДокумента <> Справочники.ВидыДокументовЭСЧФ.ЭлектроннаяТТН_1 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Основание = Неопределено Тогда
		Основание = ОпределитьДокументОснованиеДляЗаполнения();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка.Грузоотправитель КАК Грузоотправитель,
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка.Грузополучатель КАК Грузополучатель,
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка.АдресПогрузки КАК АдресГрузоотправителя,
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка.АдресДоставки КАК АдресГрузополучателя
	|ИЗ
	|	Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|ГДЕ
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование = &ДокументОснование
	|";
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Грузоотправитель 		= Выборка.Грузоотправитель;
		Грузополучатель 		= Выборка.Грузополучатель;
		АдресГрузоотправителя 	= Выборка.АдресГрузоотправителя;
		АдресГрузополучателя 	= Выборка.АдресГрузополучателя;
		
		//должен быть только один документ
		Прервать;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Грузоотправитель) И НЕ ЗначениеЗаполнено(АдресГрузоотправителя) Тогда
		СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Грузоотправитель, Основание.Дата);
	    АдресГрузоотправителя     = СведенияОГрузоотправителе.ЮридическийАдрес;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Грузополучатель) И НЕ ЗначениеЗаполнено(АдресГрузополучателя) Тогда
		СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Грузополучатель,  Основание.Дата);
	    АдресГрузополучателя      = СведенияОГрузополучателе.ЮридическийАдрес;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("Организация") Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("Валюта") Тогда
		Валюта = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта);
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("КодВидаОперации") Тогда
		КодВидаОперации = КодВидаОперации();
	КонецЕсли;
	
КонецПроцедуры

Функция КодВидаОперации() Экспорт
	
	ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Дата);
	КодВидаОперации = ?(ВерсияКодовВидовОпераций = 3, "01", "04");
	
	Если Покупатели.Количество() > 1 Тогда
		КодВидаОперации = "27";
	ИначеЕсли Покупатели.Количество() = 1 
		И Покупатели[0].Покупатель = Справочники.Контрагенты.РозничныйПокупатель Тогда
		КодВидаОперации = "26";
	КонецЕсли;
	
	Возврат КодВидаОперации;
	
КонецФункции

Процедура ЗаполнитьПоСчетуФактуреОснованию(СчетФактураОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Истина КАК Исправление,
	|	ВЫБОР 
	|		КОГДА СчетФактураКомиссионеру.Исправление 
	|			ТОГДА СчетФактураКомиссионеру.СчетФактураОснование
	|		ИНАЧЕ СчетФактураКомиссионеру.Ссылка
	|	КОНЕЦ КАК СчетФактураОснование,
	|	СчетФактураКомиссионеру.ДокументОснование КАК ДокументОснование,
	|	СчетФактураКомиссионеру.Организация КАК Организация,
	|	СчетФактураКомиссионеру.Комиссионер КАК Комиссионер,
	|	СчетФактураКомиссионеру.КодВидаОперации КАК КодВидаОперации,
	|	СчетФактураКомиссионеру.Валюта КАК Валюта
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК СчетФактураКомиссионеру
	|ГДЕ
	|	СчетФактураКомиссионеру.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Покупатели.Покупатель КАК Покупатель,
	|	Покупатели.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	Покупатели.КПППокупателя КАК КПППокупателя
	|ИЗ
	|	Документ.СчетФактураКомиссионеру.Покупатели КАК Покупатели
	|ГДЕ
	|	Покупатели.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", СчетФактураОснование);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	ЭтотОбъект.Покупатели.Загрузить(РезультатЗапроса[1].Выгрузить());
	
	// 4D:ERP для Беларуси
	// ЭСЧФ
	// {
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаполнитьОсновныеРеквизиты();
		ЗаполнитьВидДокумента();
		ЗаполнитьУсловияПоставки();
		ЗаполнитьТабличнуюЧасть();
	КонецЕсли;
	// }
	// 4D
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// 4D:ERP для Беларуси, ВалентинМ, 12.07.2017 17:56:32 
// ЭСЧФ
// {

#Область ТабличнаяЧасть

Процедура ЗаполнитьТабличнуюЧасть(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ОпределитьДокументОснованиеДляЗаполнения();	
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
		Товары.Загрузить(Документы.СчетФактураВыданный.ВыбратьДанныеТЧНаИмпортГТД(Основание));
	ИначеЕсли	ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
		Товары.Загрузить(Документы.СчетФактураВыданный.ВыбратьДанныеТЧНаИмпортЗаявление(Основание));
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
		ЗаполнитьПоРеализацияУслугПрочихАктивов(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетДавальцу") Тогда
		ЗаполнитьТабличнуюЧастьТоварыПоОтчетДавальцу(Основание);
	Иначе
		
		МетаданныеДокумента = Основание.Метаданные();
		Если МетаданныеДокумента.ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
			ЗаполнитьТабличнуюЧастьПоТоварам(Основание);			
		ИначеЕсли МетаданныеДокумента.ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда	
			ЗаполнитьТабличнуюЧастьПоУслугам(Основание);
		КонецЕсли;		
			
	КонецЕсли;	
	
КонецПроцедуры	

Функция ЗаполнитьПоРеализацияУслугПрочихАктивов(ДокументОснование) Экспорт
	
	Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияУслугПрочихАктивовДоходы.Содержание 		КАК Номенклатура,
		|	РеализацияУслугПрочихАктивовДоходы.ЕдиницаИзмерения КАК Упаковка,
		|	РеализацияУслугПрочихАктивовДоходы.Количество		КАК	Количество,
		|	РеализацияУслугПрочихАктивовДоходы.СтавкаНДС        КАК СтавкаНДС,
		|	РеализацияУслугПрочихАктивовДоходы.Цена       * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Цена,
		|	РеализацияУслугПрочихАктивовДоходы.Сумма      * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Сумма,
		|	РеализацияУслугПрочихАктивовДоходы.СуммаНДС   * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаНДС,
		|	РеализацияУслугПрочихАктивовДоходы.СуммаСНДС  * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаСНДС
		|ИЗ
		|	Документ.РеализацияУслугПрочихАктивов.Доходы КАК РеализацияУслугПрочихАктивовДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|		ПО РеализацияУслугПрочихАктивовДоходы.Ссылка.Валюта = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	РеализацияУслугПрочихАктивовДоходы.Ссылка = &ДокументОснование";
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	Товары.Загрузить(ТаблицаТоваров);
	
КонецФункции

Функция ЗаполнитьТабличнуюЧастьПоТоварам(ДокументОснование) Экспорт
	
	Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Коэффициент = -1;
	Иначе 
		Коэффициент = 1;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура 		 КАК Номенклатура,
		|	&ТекстЗапросаЕдиницаИзмерения 		 КАК Упаковка,
		|	ТаблицаТоваров.Номенклатура.КодТНВЭД КАК КодТНВЭД,
		|	ТаблицаТоваров.Номенклатура.КодОКВЭД КАК КодОКЭД,
		|	ТаблицаТоваров.Количество 			 КАК Количество,
		|	ТаблицаТоваров.СтавкаНДС             КАК СтавкаНДС,
		|	ТаблицаТоваров.Цена      * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность * &Коэффициент КАК Цена,
		|	ТаблицаТоваров.Сумма     * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность * &Коэффициент КАК Сумма,
		|	ТаблицаТоваров.СуммаНДС  * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность * &Коэффициент КАК СуммаНДС,
		|	ТаблицаТоваров.СуммаСНДС * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность * &Коэффициент КАК СуммаСНДС
		|ИЗ
		|	Документ." + ДокументОснование.Метаданные().Имя + ".Товары КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|		ПО ТаблицаТоваров.Ссылка.Валюта = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаТоваров.Ссылка = &ДокументОснование
		|	И ТаблицаТоваров.Цена > 0";
		
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаЕдиницаИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));
			
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Коэффициент", Коэффициент);
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	Товары.Загрузить(ТаблицаТоваров);
	
КонецФункции

Функция ЗаполнитьТабличнуюЧастьПоУслугам(ДокументОснование) Экспорт
	
	Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");

	Запрос = Новый Запрос;
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура 				 КАК Номенклатура,
		|	ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	ТаблицаТоваров.Номенклатура.КодТНВЭД 		 КАК КодТНВЭД,
		|	ТаблицаТоваров.Номенклатура.КодОКВЭД 		 КАК КодОКЭД,
		|	ТаблицаТоваров.Количество					 КАК Количество,
		|	ТаблицаТоваров.СтавкаНДС					 КАК СтавкаНДС,
		|	ТаблицаТоваров.Цена 	 * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Цена,
		|	ТаблицаТоваров.Сумма	 * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Сумма,
		|	ТаблицаТоваров.СуммаНДС	 * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаНДС,
		|	ТаблицаТоваров.СуммаСНДС * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаСНДС
		|ИЗ
		|	Документ." + ДокументОснование.Метаданные().Имя + ".Услуги КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|		ПО ТаблицаТоваров.Ссылка.Валюта = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	ТаблицаТоваров.Ссылка = &ДокументОснование";
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Период", Период);
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	Товары.Загрузить(ТаблицаТоваров);
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьТоварыПоОтчетДавальцу(ДокументОснование) Экспорт
	
	Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.КодОКВЭД КАК КодОКЭД,
	|	1 КАК Количество,
	|	СУММА(ОтчетДавальцуПродукция.СуммаСНДС - ОтчетДавальцуПродукция.СуммаНДС) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Цена,
	|	СУММА(ОтчетДавальцуПродукция.СуммаСНДС - ОтчетДавальцуПродукция.СуммаНДС) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Сумма,
	|	ОтчетДавальцуПродукция.Ссылка.СтавкаНДС,
	|	СУММА(ОтчетДавальцуПродукция.СуммаНДС) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаНДС,
	|	СУММА(ОтчетДавальцуПродукция.СуммаСНДС) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК СуммаСНДС
	|ИЗ
	|	Документ.ОтчетДавальцу.Продукция КАК ОтчетДавальцуПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|		ПО ОтчетДавальцуПродукция.Ссылка.Валюта = КурсыВалютСрезПоследних.Валюта
	|ГДЕ
	|	ОтчетДавальцуПродукция.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.ЕдиницаИзмерения,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.КодТНВЭД,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.КодОКВЭД,
	|	ОтчетДавальцуПродукция.Ссылка.СтавкаНДС";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Функция ОпределитьДокументОснованиеДляЗаполнения(ДанныеЗаполнения = Неопределено)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Основание = ДокументОснование;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			Основание = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
	Иначе
		Основание = ДанныеЗаполнения;
	КонецЕсли;
	
	ТермТаблицы = "";
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
		ТермТаблицы = "Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность";
	ИначеЕсли	ТипЗнч(Основание) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ТермТаблицы = "Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа";
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		ТермТаблицы = "Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа";
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТермТаблицы) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	тчДок.Заказ
		|ИЗ
		|	" + ТермТаблицы + " КАК тчДок
		|ГДЕ
		|	тчДок.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	тчДок.НомерСтроки";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Основание = Выборка.Заказ;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Основание;
	
КонецФункции	

#КонецОбласти
// }
// 4D 

#КонецЕсли
