// 4D:ERP для Беларуси
// {
// Форма изменена
// }
// 4D

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СправкаРасчетАмортизации(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетАмортизации.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетАмортизационнойПремии(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетАмортизационнойПремии.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетДолиНалоговойБазы(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетДолиНалоговойБазы.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетЗемельногоНалога(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетЗемельногоНалога.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаНаИмущество(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаНаИмущество.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаНаПрибыль(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаНаПрибыль.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНормированияРасходов(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНормированияРасходов.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПостоянныхИВременныхРазниц(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетПостоянныхИВременныхРазниц.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетРезервыПоСомнительнымДолгам(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетРезервыПоСомнительнымДолгам.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетТранспортногоНалога(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетТранспортногоНалога.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетТранспортныхРасходов(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетТранспортныхРасходов.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетРезервыОтпусков(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетРезервыОтпусков.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаУСН(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаУСН.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетТорговогоСбора(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетТорговогоСбора.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПризнаниеРасходовПоОСПоступившимВЛизинг(Команда)
	
	ОткрытьФорму("Отчет.СправкаРасчетПризнаниеРасходовПоОСПоступившимВЛизинг.ФормаОбъекта");
	
КонецПроцедуры

#КонецОбласти