#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТоварыНакладной = ПолучитьИзВременногоХранилища(Параметры.АдресТовары);
	ЗаполнитьРеквизитыПриСоздании(ТоварыНакладной);
	ЗаполнитьТаблицуТоваров(ТоварыНакладной);
	
	УстановитьОтборСтрокПоЗаказам();
	НастроитьЭлементыФормыПриСоздании();
	
	ДополнительныеПараметры = Новый Структура;
	ИнтеграцияССППР.ДобавитьРазмещениеКомандСППРВДополнительныеПараметры(Элементы.ГруппаКоманднаяПанельПродолжение, ДополнительныеПараметры);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не ВыполняетсяЗакрытие И Модифицированность Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			ТекстПредупреждения = НСтр("ru = 'Данные в форме были изменены.
											|Можно продолжить работу и сохранить изменения, 
											|либо завершить работу без сохранения изменений.'");
			Возврат;
		КонецЕсли; 
		
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
		НСтр("ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоОрдеруПриИзменении(Элемент)
	
	РассчитатьПоказательКоличество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоЗаказамПриИзменении(Элемент)
	
	ПоЗаказамПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЗаголовокЗаказыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаголовокСпискаЗаказов = НСтр("ru='Заказы (%КоличествоДокументов%)'");
	ПараметрыФормы = Новый Структура("СписокДокументов, Заголовок", СписокЗаказов, ЗаголовокСпискаЗаказов);
	
	ОткрытьФорму("ОбщаяФорма.ПросмотрСпискаДокументов", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,
		,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТовары

&НаКлиенте
Процедура ТаблицаТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаТовары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Поле.Имя = "ТаблицаТоварыРаспоряжение" И ЗначениеЗаполнено(ТекущиеДанные.Распоряжение) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Распоряжение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТовары.ТекущиеДанные;
	
	ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок / ТекущаяСтрока.УпаковкаКоэффициент;
	ТекущаяСтрока.РасхождениеНакладная = ТекущаяСтрока.КоличествоУпаковок - ТекущаяСтрока.КоличествоУпаковокВНакладной;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	ПеренестиСтрокиВДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтроки(Команда)

	ОтметитьСтроки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ИсключитьСтроки(Команда)

	ОтметитьСтроки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьТаблицуРассчитатьУпаковки(Таблица)
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		НоваяСтрока = ТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока.Упаковка =
			?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаНакладной), СтрокаТаблицы.УпаковкаНакладной, СтрокаТаблицы.УпаковкаЗаказа);
			
		НоваяСтрока.УпаковкаКоэффициент =
			?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаНакладнойКоэффициент), СтрокаТаблицы.УпаковкаНакладнойКоэффициент,
			?(ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаЗаказаКоэффициент),    СтрокаТаблицы.УпаковкаЗаказаКоэффициент, 1));
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТовары.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТовары.ПрисутствуетВДокументе");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Gray);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоварыРаспоряжение.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТовары.Распоряжение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГиперссылки);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоварыКоличествоУпаковокВЗаказе.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоОрдеру");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоварыКоличествоУпаковокВОрдере.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоОрдеру");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоварыКоличествоУпаковок.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТовары.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТовары.СтрокаВыбрана");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<удалить>'"));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПриСоздании(ТоварыНакладной)
	
	// Реквизиты.
	ИспользоватьОрдернуюСхемуПриОтгрузке     = Параметры.ОрдернаяСхемаПриОтгрузке;
	ИспользоватьНакладныеПоНесколькимЗаказам = Истина;
	ЭтоРаспоряжениеНакладная = НакладныеСервер.ЕстьРасходныйОрдерДляЗаказовНаОтгрузку(Параметры.РеквизитыШапки.Ссылка);
	ИспользоватьЗаказы                       = Не ЭтоРаспоряжениеНакладная;
	
	ПоОрдеру = ИспользоватьОрдернуюСхемуПриОтгрузке
		 И (Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить()
			= Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаОрдера);
	
	ПоЗаказам = Параметры.НакладнаяПоЗаказам;
	
	Распоряжение = Параметры.Распоряжение;
	
	ПараметрыОбновления = ЗаказыСервер.ПараметрыОбновленияИнформацииПоЗаказамВФорме();
	
	ПараметрыОбновления.ИмяРеквизитаСписокЗаказов         = "СписокЗаказов";
	ПараметрыОбновления.ПутьЗаказаВШапке                  = "Распоряжение";
	ПараметрыОбновления.ИмяНадписиЗаголовка               = "НадписьЗаголовокЗаказы";
	ПараметрыОбновления.ИмяЗаказаВТабличнойЧасти          = "Распоряжение";
	ПараметрыОбновления.ИспользоватьЗаказыВТабличнойЧасти = ИспользоватьНакладныеПоНесколькимЗаказам;

	ЗаказыСервер.ОбновитьИнформациюПоЗаказамВФорме(ЭтаФорма, ТоварыНакладной, ПараметрыОбновления);
	
	Если ИспользоватьЗаказы И ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		Заголовок = НСтр("ru = 'Подбор товаров по заказам/ордерам'");
	ИначеЕсли ИспользоватьЗаказы Тогда
		Заголовок = НСтр("ru = 'Подбор товаров по заказам'");
	Иначе
		Заголовок = НСтр("ru = 'Подбор товаров по ордерам'");
	КонецЕсли;
	
	ПодборТоваровКлиентСервер.СформироватьЗаголовокФормыПодбора(Заголовок, Параметры.РеквизитыШапки.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваров(ТоварыНакладной)
	
	ДанныеОтбора = Новый Структура("РеквизитыШапки", Новый Структура(Новый ФиксированнаяСтруктура(Параметры.РеквизитыШапки)));
	МассивЗаказов = Новый Массив();
	
	// Если отгрузка уже началась, нельзя подбирать из заказов,
	// В подборе в данном случае отображаются только данные из накладной и ордеров по ней.
	МассивЗаказов.Добавить(Параметры.РеквизитыШапки.Ссылка);
	Если Не НакладныеСервер.ЕстьРасходныйОрдерДляЗаказовНаОтгрузку(МассивЗаказов) Тогда
		МассивЗаказов.Очистить();
	КонецЕсли;
	
	ДанныеОтбора.Вставить("МассивЗаказов",   МассивЗаказов);
	ДанныеОтбора.Вставить("ТоварыНакладной", ТоварыНакладной);
	ДанныеОтбора.Вставить("НакладнаяПоЗаказам", Параметры.НакладнаяПоЗаказам);
	
	РезультатЗапроса = Документы.ПередачаМатериаловВПроизводство.РезультатЗапросаПоОстаткамЗаказов(ДанныеОтбора, "Подбор");
	ПоляКлюча = "Распоряжение, Номенклатура, Характеристика, НазначениеОтправителя, Серия";
	НакладныеСервер.ЗаполнитьПоказательКоличествоПоОрдерам(РезультатЗапроса.ТаблицаОформить, РезультатЗапроса.ТаблицаОтгружено, ПоляКлюча);
	ЗагрузитьТаблицуРассчитатьУпаковки(РезультатЗапроса.ТаблицаОформить);
	ОбойтиТаблицуУдалитьСтрокиБезОтклонений(ТаблицаТовары);
	РассчитатьПоказательКоличество();
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиТаблицуУдалитьСтрокиБезОтклонений(Таблица)
	
	КоличествоСтрок = Таблица.Количество();
	Для Счетчик = 1 По КоличествоСтрок Цикл
		
		СтрокаТаблицы = Таблица[КоличествоСтрок - Счетчик];
		РаспоряжениеНакладная = ТипЗнч(СтрокаТаблицы.Распоряжение) = Тип("ДокументСсылка.ПередачаМатериаловВПроизводство");
		НетОтклоненийЗаказ = РаспоряжениеНакладная Или СтрокаТаблицы.КоличествоВНакладной = СтрокаТаблицы.КоличествоВЗаказе;
		НетОтклоненийОрдер = Не ИспользоватьОрдернуюСхемуПриОтгрузке Или СтрокаТаблицы.КоличествоВНакладной = СтрокаТаблицы.КоличествоВОрдере;
		НетОтклонений = НетОтклоненийЗаказ И НетОтклоненийОрдер;
		
		Если НетОтклонений Тогда
			Таблица.Удалить(КоличествоСтрок - Счетчик);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.КоличествоУпаковокВОрдере = СтрокаТаблицы.КоличествоВОрдере / СтрокаТаблицы.УпаковкаКоэффициент;
		СтрокаТаблицы.КоличествоУпаковокВЗаказе = СтрокаТаблицы.КоличествоВЗаказе / СтрокаТаблицы.УпаковкаКоэффициент;
		СтрокаТаблицы.КоличествоУпаковокВНакладной = СтрокаТаблицы.КоличествоВНакладной / СтрокаТаблицы.УпаковкаКоэффициент;
		
		Если РаспоряжениеНакладная Тогда
			СтрокаТаблицы.Распоряжение = Неопределено;
		КонецЕсли;
		
		Если СписокЗаказов.НайтиПоЗначению(СтрокаТаблицы.Распоряжение) <> Неопределено
			Или СтрокаТаблицы.Распоряжение = Распоряжение Тогда
			
			СтрокаТаблицы.ЗаказИзНакладной = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоказательКоличество()
	
	Для каждого СтрокаТоваров Из ТаблицаТовары Цикл
		
		СтрокаТоваров.КоличествоУпаковок = ?(ПоОрдеру, СтрокаТоваров.КоличествоУпаковокВОрдере, СтрокаТоваров.КоличествоУпаковокВЗаказе);
		СтрокаТоваров.Количество = ?(ПоОрдеру, СтрокаТоваров.КоличествоВОрдере, СтрокаТоваров.КоличествоВЗаказе);
		СтрокаТоваров.РасхождениеНакладная = СтрокаТоваров.КоличествоУпаковок - СтрокаТоваров.КоличествоУпаковокВНакладной;
		
		СтрокаТоваров.СтрокаВыбрана = СтрокаТоваров.РасхождениеНакладная <> 0
			И (СтрокаТоваров.ЗаказИзНакладной И ПоЗаказам Или Не ПоЗаказам);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыПриСоздании()
	
	МенеджерНакладной = Документы.ПередачаМатериаловВПроизводство;
	// Элементы формы.
	Элементы.ПоОрдеру.Видимость = ИспользоватьЗаказы И ИспользоватьОрдернуюСхемуПриОтгрузке;
	Элементы.СтраницыЗаказ.Видимость = ИспользоватьЗаказы И Параметры.НакладнаяПоЗаказам И ИспользоватьНакладныеПоНесколькимЗаказам;
	
	// Элементы таблицы товаров.
	ПараметрыОбъекта = Новый Структура(МенеджерНакладной.ИменаРеквизитовДляЗаполненияПараметровУказанияСерий());
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Параметры);
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ПараметрыОбъекта, МенеджерНакладной);
	Элементы.ТаблицаТоварыСерия.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	
	Элементы.ТаблицаТоварыКоличествоУпаковокВОрдере.Видимость = ИспользоватьОрдернуюСхемуПриОтгрузке;
	
	Элементы.ТаблицаТоварыКоличествоУпаковокВЗаказе.Видимость = ИспользоватьЗаказы;
	Элементы.ТаблицаТоварыРаспоряжение.Видимость              = ИспользоватьЗаказы;
	Элементы.ТаблицаТоварыКодСтроки.Видимость                 = ИспользоватьЗаказы;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСтрокПоЗаказам()
	
	Если ПоЗаказам Тогда
		Элементы.ТаблицаТовары.ОтборСтрок = Новый ФиксированнаяСтруктура("ЗаказИзНакладной", Истина);
	Иначе
		Элементы.ТаблицаТовары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВХранилище()

	АдресВХранилище = НакладныеСервер.ПодборПоЗаказамПоместитьТоварыВХранилище(ТаблицаТовары);
	Возврат АдресВХранилище;

КонецФункции

&НаКлиенте
Процедура ПеренестиСтрокиВДокумент()

	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;
	ТекстПредупреждения = ПроверитьВыборНесколькихЗаказов();
	
	Если ТекстПредупреждения <> "" Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	АдресВХранилище = ПоместитьТоварыВХранилище();

	Закрыть();

	ОповеститьОВыборе(Новый Структура("ВыполняемаяОперация, АдресВХранилище",
						"ПодборТоваровИзЗаказа", АдресВХранилище));

КонецПроцедуры

&НаСервере
Функция ПроверитьВыборНесколькихЗаказов()
	
	ПервыйЗаказ = Неопределено;
	ВыбранаСтрокаБезЗаказа = Ложь;
	ШаблонБолееОдногоЗаказа = НСтр("ru = 'Нельзя выбрать товары больше, чем по одному заказу.'");
	ШаблонБезЗаказаИПоЗаказу = НСтр("ru = 'Нельзя выбрать товары по заказу и без указания заказа одновременно.'");
	
	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
		
		Если СтрокаТовары.СтрокаВыбрана И СтрокаТовары.Количество <> 0 Тогда
			
			Если ЗначениеЗаполнено(СтрокаТовары.Распоряжение) Тогда
				ПервыйЗаказ = СтрокаТовары.Распоряжение;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТовары.Распоряжение) Тогда
				ВыбранаСтрокаБезЗаказа = Истина;
			КонецЕсли;
			
			Если ВыбранаСтрокаБезЗаказа И ПервыйЗаказ <> Неопределено Тогда
				Возврат ШаблонБезЗаказаИПоЗаказу;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ОтметитьСтроки(Значение)

	Для Каждого СтрокаТоваров Из ТаблицаТовары Цикл
		
		Если СтрокаТоваров.ЗаказИзНакладной И ПоЗаказам Или Не ПоЗаказам И СтрокаТоваров.СтрокаВыбрана <> Значение Тогда
		
			СтрокаТоваров.СтрокаВыбрана = Значение;
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПоЗаказамПриИзмененииСервер()
	
	УстановитьОтборСтрокПоЗаказам();
	
	Для каждого СтрокаТоваров Из ТаблицаТовары Цикл
		СтрокаТоваров.СтрокаВыбрана = СтрокаТоваров.РасхождениеНакладная <> 0
			И (СтрокаТоваров.ЗаказИзНакладной И ПоЗаказам Или Не ПоЗаказам);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ВыполняетсяЗакрытие = Истина;
		ПеренестиСтрокиВДокумент();
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ВыполняетсяЗакрытие = Ложь;

#КонецОбласти
