#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма - УправляемаяФорма - Форма отчета.
//   НовыеПользовательскиеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//
// См. также:
//   "Расширение управляемой формы для отчета.ПередЗагрузкойВариантаНаСервере" в синтакс-помощнике.
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПараметрВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеПользовательскиеНастройкиКД, "ВидЦены");
	ВидЦены = ПараметрВидЦены.Значение;
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		ВидЦены = Константы.ВидЦеныПлановойСтоимостиМатериаловРабот.Получить();
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеПользовательскиеНастройкиКД, "ВидЦены", ВидЦены);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
