
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ДатаСобытия", ДатаСобытия);
	Параметры.Свойство("Организация", Организация);
	
	ОписаниеТипаФизическоеЛицо = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	СтруктураПараметраФизическоеЛицо = Новый Структура("ТипПараметра, ИмяПараметра", ОписаниеТипаФизическоеЛицо, "МассивДокументов");
	СтруктураПараметровОтбора = Новый Структура("Сотрудник", СтруктураПараметраФизическоеЛицо);
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список", "СписокНастройкиОтбора",
		СтруктураПараметровОтбора, "СписокКритерииОтбора");
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.КоманднаяПанельФормы);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ЗарплатаКадрыКлиент.ОбновитьДинамическийСписок(ЭтотОбъект, ИмяСобытия, Параметр, Источник) Тогда
		ОбновитьНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура Подключаемый_ПараметрКритерияОтбораПриИзменении(Элемент)
	ПараметрКритерияОтбораНаФормеСДинамическимСпискомПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ПараметрКритерияОтбораНаФормеСДинамическимСпискомПриИзмененииНаСервере(ИмяЭлемента)
	ЗарплатаКадры.ПараметрКритерияОтбораНаФормеСДинамическимСпискомПриИзменении(ЭтотОбъект, ИмяЭлемента);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УправлениеПечатьюКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	
	ЗарплатаКадрыКлиент.ДинамическийСписокПередНачаломДобавления(ЭтотОбъект, ПараметрыОткрытия, Параметр, "Сотрудник", "");
	
	Если ЗначениеЗаполнено(ДатаСобытия) Тогда
		
		Если Параметр = Тип("ДокументСсылка.ИсполнительныйЛист") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаДействия", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.ПостоянноеУдержаниеВПользуТретьихЛиц") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.УдержаниеПрофсоюзныхВзносов") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.ИзменениеУсловийИсполнительногоЛиста") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаИзменения", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.УдержаниеДобровольныхСтраховыхВзносов") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.УдержаниеДобровольныхВзносовВНПФ") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		ИначеЕсли Параметр = Тип("ДокументСсылка.УдержаниеВСчетРасчетовПоПрочимОперациям") Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ДатаНачала", ДатаСобытия);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) Тогда
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Организация", Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыОткрытия.ЗначенияЗаполнения);
	
	Отказ = Истина;
	ОткрытьФорму(ПараметрыОткрытия.ОписаниеФормы, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	УправлениеПечатьюКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНаСервере()
	ЗарплатаКадры.ОбновитьФормыСДинамическимСписком(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
