#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьРазмерыВычетовНДФЛ();
	
КонецПроцедуры

// Выполняет заполнение регистра сведений РазмерыВычетовНДФЛ.
//
Процедура ЗаполнитьРазмерыВычетовНДФЛ() Экспорт
	
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;
	
	НаборЗаписей = РегистрыСведений.РазмерВычетовНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	// 4D:ERP для Беларуси, Анна, 09.06.2017 16:59:58 
	// РС "Размер вычетов подоходного налога", №15136
	// Локализовать регистр "Размеры вычетов подоходного налога", № 17437
	// {
	ДатаСведений = '20170101';
		
	НаборЗаписей = РегистрыСведений.РазмерВычетовНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	НаборЗаписей.Отбор.Период.Установить(ДатаСведений);
	
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код600,  93, 563);
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код610,  27, 0);
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код611, 52, 0);
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код620, 131, 0);
	
	// Запишем набор записей в режиме добавления.
	НаборЗаписей.Записать();
	НаборЗаписей.Очистить();
	
	ДатаСведений = '20180101';
		
	НаборЗаписей = РегистрыСведений.РазмерВычетовНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	НаборЗаписей.Отбор.Период.Установить(ДатаСведений);
	
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код600,  103, 624);
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код610,  30, 0);
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код611, 58, 0);
	ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, ВычетыНДФЛ.Код620, 145, 0);
	
	// Запишем набор записей в режиме добавления.
	НаборЗаписей.Записать();
	НаборЗаписей.Очистить();
	// }
	// 4D

КонецПроцедуры

// Добавляет запись в набор записей регистра "НДФЛРазмерВычетов".
//
Процедура ДобавитьРазмерВычетаНДФЛ(НаборЗаписей, ДатаСведений, КодВычета, Размер, ОграничениеПоДоходам) 

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.КодВычета            = КодВычета;
	НоваяЗапись.Период               = ДатаСведений;
	НоваяЗапись.Размер               = Размер;
	НоваяЗапись.ОграничениеПоДоходам = ОграничениеПоДоходам;

КонецПроцедуры

#КонецОбласти

#КонецЕсли