// Подсистема "Адресный классификатор РБ"

#Область СлужебныеПроцедурыИФункции

Функция СписокСлужебныхФайловАдресногоКлассификатора() Экспорт
	СписокДополнительныхФайлов = Новый Соответствие;
	СписокДополнительныхФайлов.Вставить("ATE_TE", "Классификатор категорий АТЕ и ТЕ.xml");
	СписокДополнительныхФайлов.Вставить("SOATO", "СОАТО.xml");
	СписокДополнительныхФайлов.Вставить("OBL", "Справочник областей.xml");
	СписокДополнительныхФайлов.Вставить("UL", "Справочник улиц.xml");
	
	Возврат СписокДополнительныхФайлов;
КонецФункции

Функция GUIDСтранаБеларусь() Экспорт
	// Уникальный идентификатор элемента Справочник.СтраныМира.Беларусь
	Возврат Новый УникальныйИдентификатор("22863426-688d-11e7-ab69-001e67a32a62");
КонецФункции

#КонецОбласти