////////////////////////////////////////////////////////////////////////////////
// ДополнительныеВнешниеКомпоненты: Механизм для работы с внешними компонентами.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Регистрирует обработчики поставляемых данных
//
Процедура ЗарегистрироватьОбработчикиПоставляемыхДанных(Знач Обработчики) Экспорт
	
	МодульВнешниеКомпоненты = ОбщегоНазначения.ОбщийМодуль("ДополнительныеВнешниеКомпоненты");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ВидДанных = "ExtComp";
	Обработчик.КодОбработчика = "ExtComp";
	Обработчик.Обработчик = МодульВнешниеКомпоненты;
	
КонецПроцедуры

// Вызывается при получении уведомления о новых данных.
// В теле следует проверить, необходимы ли эти данные приложению, 
// и если да - установить флажок Загружать
// 
// Параметры:
//   Дескриптор   - ОбъектXDTO Descriptor.
//   Загружать    - булево, возвращаемое
//
Процедура ДоступныНовыеДанные(Знач Дескриптор, Загружать) Экспорт
	
	// Загрузка внешних компонент.
	Если Дескриптор.DataType = "ExtComp" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	1 КАК Поле1
		               |ИЗ
		               |	Справочник.ВнешниеКомпоненты КАК ВнешниеКомпоненты
		               |ГДЕ
		               |	ВнешниеКомпоненты.Идентификатор = &Идентификатор
		               |	И ВнешниеКомпоненты.Версия = &Версия";
		Запрос.УстановитьПараметр("Идентификатор", Дескриптор.Properties.Property.Получить(0).Value);
		Запрос.УстановитьПараметр("Версия", Дескриптор.Properties.Property.Получить(1).Value);
		
		Загружать = Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после вызова ДоступныНовыеДанные, позволяет разобрать данные.
//
// Параметры:
//   Дескриптор   - ОбъектXDTO Дескриптор.
//   ПутьКФайлу   - строка. Полное имя извлеченного файла. Файл будет автоматически удален 
//                  после завершения процедуры.
//
Процедура ОбработатьНовыеДанные(Знач Дескриптор, Знач ПутьКФайлу) Экспорт
	
	Если Дескриптор.DataType = "ExtComp" Тогда
		
		Данные = Новый ДвоичныеДанные(ПутьКФайлу);
		
		Адрес = ПоместитьВоВременноеХранилище(Данные);
		
		Справочники.ВнешниеКомпоненты.СохранитьВнешнююКомпонентуВИнформационнойБазе(Адрес);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при отмене обработки данных в случае сбоя
//
Процедура ОбработкаДанныхОтменена(Знач Дескриптор) Экспорт
	
КонецПроцедуры


#КонецОбласти
