#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ГруппаФинансовогоУчета") Тогда
		ГруппаФинансовогоУчета = Параметры.ГруппаФинансовогоУчета;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокСобственнаяНоменклатура, "ГруппаФинансовогоУчета", ГруппаФинансовогоУчета, ЗначениеЗаполнено(ГруппаФинансовогоУчета));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокНоменклатураПереданная, "ГруппаФинансовогоУчета", ГруппаФинансовогоУчета, ЗначениеЗаполнено(ГруппаФинансовогоУчета));
		
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппаФинансовогоУчетаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокСобственнаяНоменклатура, "ГруппаФинансовогоУчета", ГруппаФинансовогоУчета, ЗначениеЗаполнено(ГруппаФинансовогоУчета));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		СписокНоменклатураПереданная, "ГруппаФинансовогоУчета", ГруппаФинансовогоУчета, ЗначениеЗаполнено(ГруппаФинансовогоУчета));
	
КонецПроцедуры

#КонецОбласти
