// 4D:ERP для Беларуси
// {
// Форма изменена
// }
// 4D

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ОбработкаОбновленияФормы()
	
	// 4D:ERP для Беларуси, Яна, 06.09.2017 10:49:15 
	// Заполнение Ставок налога на прибыль в варианте РФ, №15799
	// {
	Элементы.ГруппаСтавкиВБюджетСубъектовРФ.Видимость = ПрименяютсяРазныеСтавкиНалогаНаПрибыль;	
	// }
	// 4D
		
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПрименяютсяРазныеСтавкиНалогаНаПрибыльПриИзменении(Элемент)
	
	УстановитьПризнакПримененияРазныхСтавокНалогаНаПрибыль();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ПрименяютсяРазныеСтавкиНалогаНаПрибыль = ПолучитьФункциональнуюОпцию("ПрименяютсяРазныеСтавкиНалогаНаПрибыль");
	ОбработкаОбновленияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьФорму" Тогда
		ОбработкаОбновленияФормы();
	КонецЕсли; 
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьПризнакПримененияРазныхСтавокНалогаНаПрибыль()
	
	Константы.ПрименяютсяРазныеСтавкиНалогаНаПрибыль.Установить(ПрименяютсяРазныеСтавкиНалогаНаПрибыль);
	ОбработкаОбновленияФормы();
	
КонецПроцедуры
