////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзмененияЛицевыхСчетов(ЛицевыеСчетаФизическихЛиц, Организация, ДатаНачала) Экспорт
	
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ЗарегистрироватьИзмененияЛицевыхСчетов(ЛицевыеСчетаФизическихЛиц, Организация, ДатаНачала);
	
КонецПроцедуры

Функция ДеньВыплатыЗарплатыВОрганизации(Организация) Экспорт
	Возврат ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДеньВыплатыЗарплатыВОрганизации(Организация);
КонецФункции

Процедура ДополнитьКадровыеДанные(КадровыеДанные, ТекстЗапроса) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьКадровыеДанные(КадровыеДанные, ТекстЗапроса);
КонецПроцедуры

Процедура ДополнитьОписаниеФиксацииРеквизитовЗаявкиНаОткрытиеЛицевыхСчетов(ОписаниеФиксацииРеквизитов) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьОписаниеФиксацииРеквизитовЗаявкиНаОткрытиеЛицевыхСчетов(ОписаниеФиксацииРеквизитов)
КонецПроцедуры

Процедура ДополнитьПараметрыПолученияСотрудников(ПараметрыПолученияСотрудников) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьПараметрыПолученияСотрудников(ПараметрыПолученияСотрудников);
КонецПроцедуры

Процедура ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров, АдресХранилища) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров, АдресХранилища);
КонецПроцедуры

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура СформироватьДвиженияПоДокументамОплаты(ДокументОплаты) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.СформироватьДвиженияПоДокументамОплаты(ДокументОплаты);
КонецПроцедуры

#КонецОбласти

#КонецОбласти