
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Реквизиты = ПодключаемоеОборудованиеУТВызовСервера.ДанныеЖурналаФискальныхОпераций(Запись.ДокументОснование);
	
	ТекстСообщенияXML = Реквизиты.Данные.Получить();
	Если ЗначениеЗаполнено(ТекстСообщенияXML) Тогда
		
		ПараметрыФорматирования = ИнтеграцияГИСМ.ПараметрыФорматированияXML();
		
		ТекстXML.УстановитьТекст(
			ИнтеграцияГИСМВызовСервера.ФорматироватьXMLСПараметрами(
				ТекстСообщенияXML, ПараметрыФорматирования));
		
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
	Иначе
		
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
	КонецЕсли;
	
КонецПроцедуры
