////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров, АдресХранилища) Экспорт
	
	СтруктураПараметров.Вставить("МассивОписанийФайлов", Новый Массив);
	
	МетаданныеПлатежногоДокумента = ОбменСБанкамиПоЗарплатнымПроектам.МетаданныеПлатежногоДокументаПеречисленияЗарплаты();
	МассивПлатежныхДокументов = Новый Массив;
	МассивОбычныхДокументов = Новый Массив;
	Если СтруктураПараметров.МассивДокументов.Количество() > 0 Тогда
		Для каждого ДокументМассива Из СтруктураПараметров.МассивДокументов Цикл
			МетаданныеДокумента = ДокументМассива.Метаданные();
			Если (МетаданныеПлатежногоДокумента = Неопределено 
				Или МетаданныеДокумента.ПолноеИмя() <> МетаданныеПлатежногоДокумента.ПолноеИмя()) Тогда
				МассивОбычныхДокументов.Добавить(ДокументМассива);
			Иначе
				МассивПлатежныхДокументов.Добавить(ДокументМассива);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если МассивОбычныхДокументов.Количество() > 0 Тогда
		СтруктураПараметров.Вставить("МассивДокументов", МассивОбычныхДокументов);
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(МассивОбычныхДокументов[0]);
		МенеджерОбъекта.ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров);
	КонецЕсли;
	Если МассивПлатежныхДокументов.Количество() > 0 Тогда
		Для каждого ПлатежныйДокумент Из МассивПлатежныхДокументов Цикл
			СтруктураПараметров.Вставить("МассивДокументов", ОбменСБанкамиПоЗарплатнымПроектам.ВедомостиПлатежногоДокументаПеречисленияЗарплаты(ПлатежныйДокумент));
			СтруктураПараметров.Вставить("ПлатежныйДокумент", ПлатежныйДокумент);
			Документы.ВедомостьНаВыплатуЗарплатыВБанк.ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров);
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураПараметров.МассивОписанийФайлов, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти
