////////////////////////////////////////////////////////////////////////////////
// Подсистема "БланкиСтрогойОтчетности".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ОтформатироватьНомерБланка(НомерБланка = 0, ДлинаСтр = 0) Экспорт
	Возврат Формат(НомерБланка, "ЧЦ=" + ДлинаСтр + "; ЧВН=; ЧГ=");
КонецФункции

Функция ОставитьВСтрокеЦифровыеСимволы(Знач Стр) Экспорт
	К = 1;
	Пока К <= СтрДлина(Стр) Цикл
		Код = КодСимвола(Стр, К);
		Если Код >= 48 И Код <= 57 Тогда
			К = К + 1;
		Иначе
			Символ = Сред(Стр, К, 1);
			Стр = СтрЗаменить(Стр, Символ, "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Стр;
КонецФункции

Функция ЭтоДокументПодсистемыБСО(Источник) Экспорт
	Результат = Ложь;
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ВводОстатков") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ПеремещениеВЭксплуатации") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.СписаниеИзЭксплуатации") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура НепроверяемыеРеквизитыБСО(МассивРеквизитовОперации, ИмяТЧ = "Товары", ОбъектСсылка = Неопределено) Экспорт
	МассивРеквизитовОперации.Добавить(ИмяТЧ + ".ТипБСО");
	МассивРеквизитовОперации.Добавить(ИмяТЧ + ".СерияБСО");
	МассивРеквизитовОперации.Добавить(ИмяТЧ + ".НачальныйНомерБСО");
	МассивРеквизитовОперации.Добавить(ИмяТЧ + ".КонечныйНомерБСО");
	
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.СписаниеИзЭксплуатации") Тогда
		МассивРеквизитовОперации.Добавить("ТипСписанныхБСО");
	КонецЕсли;
КонецПроцедуры

Процедура НепроверяемыеРеквизиты(МассивРеквизитовОперации, ОбъектСсылка, ИмяТЧ = "", ЭтоЭлементыФормы = Ложь) Экспорт
	МассивСлужебныхРеквизитов = Новый Массив;
	
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ВводОстатков") И ИмяТЧ = "ТМЦВЭксплуатации" Тогда
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииКатегорияЭксплуатации");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииИнвентарныйНомер");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииДатаПередачиВЭксплуатацию");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииСтатьяРасходов");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииАналитикаРасходов");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииСумма");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииСуммаВР");
		МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииСуммаПР");
		//МассивСлужебныхРеквизитов.Добавить("ТМЦВЭксплуатацииПервоначальнаяСумма");
		МассивСлужебныхРеквизитов.Добавить("Подразделение");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.СписаниеИзЭксплуатации") Тогда
		МассивСлужебныхРеквизитов.Добавить("ТоварыПартияТМЦВЭксплуатации");
		МассивСлужебныхРеквизитов.Добавить("ТоварыСтатьяРасходов");
		МассивСлужебныхРеквизитов.Добавить("ТоварыАналитикаРасходов");
		МассивСлужебныхРеквизитов.Добавить("Подразделение");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПеремещениеВЭксплуатации") Тогда
		МассивСлужебныхРеквизитов.Добавить("ТоварыПартияТМЦВЭксплуатации");
		МассивСлужебныхРеквизитов.Добавить("Подразделение");
		МассивСлужебныхРеквизитов.Добавить("ПодразделениеПолучатель");
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров") Тогда
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ВводОстатков") И ИмяТЧ = "Товары" Тогда
	КонецЕсли;
	
	Если Не ЭтоЭлементыФормы И Не ПустаяСтрока(ИмяТЧ) Тогда
		Для каждого ЭлементМассива Из МассивСлужебныхРеквизитов Цикл
			Стр = СтрЗаменить(ЭлементМассива, ИмяТЧ, ИмяТЧ + ".");
			Индекс = МассивСлужебныхРеквизитов.Найти(ЭлементМассива);
			МассивСлужебныхРеквизитов.Установить(Индекс, Стр);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Стр Из МассивСлужебныхРеквизитов Цикл
		МассивРеквизитовОперации.Добавить(Стр);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти