#Область ПрограммныйИнтерфейс

// Функция возвращает признак необходимости настройки отражения расходов по имущественным налогам
//
// Параметры:
//  ГруппаОС  - ПеречислениеСсылка.ГруппыОС - Группа основного средства
//
// Возвращаемое значение:
//  Результат - Булево - Истина - требуется настройка
//  				   - Ложь  - настройка не требуется
//
Функция ТребуетсяНастройкаОтраженияРасходовПоНалогам(ГруппаОС) Экспорт
	
	ГруппыОС = Новый Массив;
	ГруппыОС.Добавить(Перечисления.ГруппыОС.Здания);
	ГруппыОС.Добавить(Перечисления.ГруппыОС.Сооружения);
	
	// 4D:ERP для Беларуси, ВладимирР, 01.11.2017 11:29:19 
	// Требование об обязательном заполнении указанной статьи расходов, №16458
	// {
	// действие не требуется
	// }
	// 4D
	
	Результат = (ГруппыОС.Найти(ГруппаОС) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти