#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт


	ВводНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСоздатьНаОсновании);


КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
// Возвращаемое значение:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.НачислениеДивидендов) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.НачислениеДивидендов.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.НачислениеДивидендов);
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьРеглУчет";
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

КонецПроцедуры

// Возвращает текст запроса для отражения в регл. учете.
// 
// Возвращаемое значение:
//   Строка - текст отражения в регл. учете
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстДивидендыСотрудникамСДетализацией = "
	// Начисление дивидендов сотрудникам с детализацией по сотрудникам (Дт <84.01> :: Кт <70>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.Начислено КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибыльПодлежащаяРаспределению) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетКт,
	|	Строки.ФизическоеЛицо КАК СубконтоКт1,
	|
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление дивидендов сотрудникам"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ФизическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|ГДЕ 
	|	Не Строки.ПрочийАкционер
	|	И Операция.ПроводкиПоРаботникам
	|";
	
	ТекстНДФЛДивидендыСотрудникамСДетализацией = "
	// Начисление НДФЛ дивидендов сотрудникам с детализацией по сотрудникам (Дт <70> :: Кт <68.01>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.ДатаВыплаты КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.НДФЛ КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	Строки.ФизическоеЛицо КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	// 4D:ERP для Беларуси, Дмитрий, 08.10.2017 19:04:17 
	// Подоходный налог
	// {
	|	""Начисление ПН с дивидендов сотрудникам"" КАК Содержание
	// }
	// 4D
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ФизическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|ГДЕ 
	|	Не Строки.ПрочийАкционер
	|	И Операция.ПроводкиПоРаботникам
	|";
	
	ТекстДивидендыСотрудникамБезДетализации = "
	// Начисление дивидендов сотрудникам сводно (Дт <84.01> :: Кт <70>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.Начислено) КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибыльПодлежащаяРаспределению) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление дивидендов сотрудникам"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ФизическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|ГДЕ 
	|	Не Строки.ПрочийАкционер
	|	И Не Операция.ПроводкиПоРаботникам
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация";
	
	ТекстНДФЛДивидендыСотрудникамБезДетализации = "
	// Начисление НДФЛ с дивидендов сотрудникам сводно (Дт <84.01> :: Кт <70>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.ДатаВыплаты КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.НДФЛ) КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	// 4D:ERP для Беларуси, Дмитрий, 11.12.2017 15:45:37 
	// Подоходный налог
	// {
	|	""Начисление ПН с дивидендов сотрудникам"" КАК Содержание
	// }
	// 4D
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ФизическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|ГДЕ 
	|	Не Строки.ПрочийАкционер
	|	И Не Операция.ПроводкиПоРаботникам
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.РегистрацияВНалоговомОргане";
	
	ТекстДивидендыПрочимФизическимЛицам = "
	// Начисление дивидендов прочим физическим лицам (Дт <84.01> :: Кт <75.2>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.Начислено) КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибыльПодлежащаяРаспределению) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов) КАК СчетКт,
	|	Строки.Контрагент КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление дивидендов прочим физическим лицам"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ФизическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|ГДЕ 
	|	Строки.ПрочийАкционер
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент";
	
	ТекстНДФЛДивидендыПрочимФизическимЛицам = "
	// Начисление НДФЛ с дивидендов прочим физическим лицам (Дт <84.01> :: Кт <75.2>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.ДатаВыплаты КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.НДФЛ) КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов) КАК СчетДт,
	|	Строки.Контрагент КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Строки.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	// 4D:ERP для Беларуси, Дмитрий, 11.12.2017 15:46:08 
	// Подоходный налог
	// {
	|	""Начисление ПН с дивидендов прочим физическим лицам"" КАК Содержание
	// }
	// 4D
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ФизическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|ГДЕ 
	|	Строки.ПрочийАкционер
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент,
	|	Строки.РегистрацияВНалоговомОргане";
	
	ТекстДивидендыЮридическимЛицам = "
	// Начисление дивидендов юридическим лицам (Дт <84.01> :: Кт <75.2>)
	|ВЫБРАТЬ 
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	СУММА(Строки.Начислено) КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибыльПодлежащаяРаспределению) КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов) КАК СчетКт,
	|	Строки.Контрагент КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление дивидендов прочим физическим лицам"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.НачислениеДивидендов.ЮридическиеЛица КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент";
	
	ТекстНалогНаПрибыльДивидендыЮридическимЛицам = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	СУММА(Строки.НалогНаПрибыль * СтавкиНалогаНаПрибыль.СтавкаФБ) КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов) КАК СчетДт,
	|	Строки.Контрагент КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	// 4D:ERP для Беларуси, Дмитрий, 11.12.2017 15:42:35 
	// Подоходный налог
	// {
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаПрибыль) КАК СчетКт,
	// }
	// 4D
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(Перечисление.УровниБюджетов.ФедеральныйБюджет) КАК СубконтоКт2,
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО КАК СубконтоКт3,
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Налог на прибыль с дивидендов юридическим лицам"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК Операция
	|			ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНалогаНаПрибыль КАК СтавкиНалогаНаПрибыль
	|			ПО Операция.Организация.ГоловнаяОрганизация = СтавкиНалогаНаПрибыль.Организация
	|				И (НАЧАЛОПЕРИОДА(Операция.Дата, МЕСЯЦ) = СтавкиНалогаНаПрибыль.ДатаОтражения)
	|		ПО ДокументыКОтражению.Ссылка = Операция.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов.ЮридическиеЛица КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|	
	|ГДЕ
	|	Операция.Организация.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент,
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(Строки.НалогНаПрибыль * СтавкиНалогаНаПрибыль.СтавкаФБ),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов),
	|	Строки.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	// 4D:ERP для Беларуси, Дмитрий, 11.12.2017 15:44:25 
	// Подоходный налог
	// {
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаПрибыль),
	// }
	// 4D
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог),
	|	ЗНАЧЕНИЕ(Перечисление.УровниБюджетов.ФедеральныйБюджет),
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""Налог на прибыль с дивидендов юридическим лицам""
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК Операция
	|			ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНалогаНаПрибыль КАК СтавкиНалогаНаПрибыль
	|			ПО Операция.Организация = СтавкиНалогаНаПрибыль.Организация
	|				И (НАЧАЛОПЕРИОДА(Операция.Дата, МЕСЯЦ) = СтавкиНалогаНаПрибыль.ДатаОтражения)
	|		ПО ДокументыКОтражению.Ссылка = Операция.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов.ЮридическиеЛица КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|	
	|ГДЕ
	|	НЕ Операция.Организация.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент,
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(Строки.НалогНаПрибыль * СтавкиНалогаНаПрибыль.СтавкаРБ),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов),
	|	Строки.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	// 4D:ERP для Беларуси, Дмитрий, 11.12.2017 15:44:49 
	// Подоходный налог
	// {
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаПрибыль),
	// }
	// 4D
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог),
	|	ЗНАЧЕНИЕ(Перечисление.УровниБюджетов.РегиональныйБюджет),
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""Налог на прибыль с дивидендов юридическим лицам""
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК Операция
	|			ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНалогаНаПрибыль КАК СтавкиНалогаНаПрибыль
	|			ПО Операция.Организация.ГоловнаяОрганизация = СтавкиНалогаНаПрибыль.Организация
	|				И (НАЧАЛОПЕРИОДА(Операция.Дата, МЕСЯЦ) = СтавкиНалогаНаПрибыль.ДатаОтражения)
	|		ПО ДокументыКОтражению.Ссылка = Операция.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов.ЮридическиеЛица КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|	
	|ГДЕ
	|	Операция.Организация.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент,
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(Строки.НалогНаПрибыль * СтавкиНалогаНаПрибыль.СтавкаРБ),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов),
	|	Строки.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	// 4D:ERP для Беларуси, Дмитрий, 11.12.2017 15:43:34 
	// Подоходный налог
	// {
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаПрибыль),
	// }
	// 4D
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог),
	|	ЗНАЧЕНИЕ(Перечисление.УровниБюджетов.РегиональныйБюджет),
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""Налог на прибыль с дивидендов юридическим лицам""
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК Операция
	|			ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНалогаНаПрибыль КАК СтавкиНалогаНаПрибыль
	|			ПО Операция.Организация = СтавкиНалогаНаПрибыль.Организация
	|				И (НАЧАЛОПЕРИОДА(Операция.Дата, МЕСЯЦ) = СтавкиНалогаНаПрибыль.ДатаОтражения)
	|		ПО ДокументыКОтражению.Ссылка = Операция.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов.ЮридическиеЛица КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|	
	|ГДЕ
	|	НЕ Операция.Организация.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Строки.Контрагент,
	|	СтавкиНалогаНаПрибыль.РегистрацияВНО";
	
	Возврат
		ТекстДивидендыСотрудникамСДетализацией
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстДивидендыСотрудникамБезДетализации
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстДивидендыПрочимФизическимЛицам
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстДивидендыЮридическимЛицам
		
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстНДФЛДивидендыСотрудникамСДетализацией
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстНДФЛДивидендыСотрудникамБезДетализации
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстНДФЛДивидендыПрочимФизическимЛицам
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстНалогНаПрибыльДивидендыЮридическимЛицам;
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламентированном учете
//
// Возвращаемое значение:
//   Строка - текст построения временной таблицы для отражения в регл. учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	Возврат "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаОтражения, МЕСЯЦ) КАК ДатаОтражения
	|ПОМЕСТИТЬ ПериодыИОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазрезыКОтражению.Организация КАК Организация,
	|		РазрезыКОтражению.ДатаОтражения КАК ДатаОтражения
	|	ИЗ
	|		РазрезыКОтражению КАК РазрезыКОтражению
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫРАЗИТЬ(РазрезыКОтражению.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
	|		РазрезыКОтражению.ДатаОтражения
	|	ИЗ
	|		РазрезыКОтражению КАК РазрезыКОтражению) КАК ВложенныйЗапрос
	|ГДЕ
	|	НЕ ВложенныйЗапрос.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаОтражения, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыИОрганизации.Организация КАК Организация,
	|	МАКСИМУМ(ЕСТЬNULL(ИсторияРегистрацийВНалоговомОргане.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПериодыИОрганизации.ДатаОтражения, МЕСЯЦ) КАК ДатаОтражения
	|ПОМЕСТИТЬ ПоследниеРегистрацииВНО
	|ИЗ
	|	ПериодыИОрганизации КАК ПериодыИОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО ПериодыИОрганизации.Организация = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|			И ПериодыИОрганизации.ДатаОтражения >= ИсторияРегистрацийВНалоговомОргане.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыИОрганизации.Организация,
	|	НАЧАЛОПЕРИОДА(ПериодыИОрганизации.ДатаОтражения, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане, ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) КАК РегистрацияВНО,
	|	ПоследниеРегистрацииВНО.Организация КАК Организация,
	|	ПоследниеРегистрацииВНО.ДатаОтражения КАК ДатаОтражения
	|ПОМЕСТИТЬ СрезРегистрацийВНО
	|ИЗ
	|	ПоследниеРегистрацииВНО КАК ПоследниеРегистрацииВНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОргане
	|		ПО ПоследниеРегистрацииВНО.Период = ИсторияРегистрацийВНалоговомОргане.Период
	|			И ПоследниеРегистрацииВНО.Организация = ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РазрезыКОтражению.ДатаОтражения, МЕСЯЦ) КАК ДатаОтражения,
	|	РазрезыКОтражению.Организация КАК Организация,
	|	МАКСИМУМ(ЕСТЬNULL(СтавкиНалогаНаПрибыльДляВсехОрганизаций.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Период
	|ПОМЕСТИТЬ ПоследниеПериодыНалогаНаПрибыль
	|ИЗ
	|	РазрезыКОтражению КАК РазрезыКОтражению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаПрибыльДляВсехОрганизаций КАК СтавкиНалогаНаПрибыльДляВсехОрганизаций
	|		ПО РазрезыКОтражению.ДатаОтражения >= СтавкиНалогаНаПрибыльДляВсехОрганизаций.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(РазрезыКОтражению.ДатаОтражения, МЕСЯЦ),
	|	РазрезыКОтражению.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеПериодыНалогаНаПрибыль.ДатаОтражения КАК ДатаОтражения,
	|	ПоследниеПериодыНалогаНаПрибыль.Организация КАК Организация,
	|	ЕСТЬNULL(СтавкиНалогаНаПрибыльДляВсехОрганизаций.СтавкаФБ, 0) КАК СтавкаФБ,
	|	ЕСТЬNULL(СтавкиНалогаНаПрибыльДляВсехОрганизаций.СтавкаСубъектРФ, 0) КАК СтавкаСубъектРФ,
	|	ЕСТЬNULL(СтавкиНалогаНаПрибыльДляВсехОрганизаций.СтавкаФБ, 0) + ЕСТЬNULL(СтавкиНалогаНаПрибыльДляВсехОрганизаций.СтавкаСубъектРФ, 0) КАК НалогВсего
	|ПОМЕСТИТЬ СрезСтавокНалогаНаПрибыль
	|ИЗ
	|	ПоследниеПериодыНалогаНаПрибыль КАК ПоследниеПериодыНалогаНаПрибыль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаПрибыльДляВсехОрганизаций КАК СтавкиНалогаНаПрибыльДляВсехОрганизаций
	|		ПО ПоследниеПериодыНалогаНаПрибыль.Период = СтавкиНалогаНаПрибыльДляВсехОрганизаций.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезРегистрацийВНО.РегистрацияВНО КАК РегистрацияВНО,
	|	СрезРегистрацийВНО.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(СрезРегистрацийВНО.ДатаОтражения, МЕСЯЦ) КАК ДатаОтражения,
	|	МАКСИМУМ(ЕСТЬNULL(СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Период
	|ПОМЕСТИТЬ ПоследниеПериодыСтавокВБюджетСубъектов
	|ИЗ
	|	СрезРегистрацийВНО КАК СрезРегистрацийВНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ КАК СтавкиНалогаНаПрибыльВБюджетСубъектовРФ
	|		ПО СрезРегистрацийВНО.Организация = СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Организация
	|			И СрезРегистрацийВНО.РегистрацияВНО = СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.РегистрацияВНалоговомОргане
	|			И СрезРегистрацийВНО.ДатаОтражения >= СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СрезРегистрацийВНО.РегистрацияВНО,
	|	СрезРегистрацийВНО.Организация,
	|	НАЧАЛОПЕРИОДА(СрезРегистрацийВНО.ДатаОтражения, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.СтавкаСубъектРФ КАК СтавкаВСубъект,
	|	ПоследниеПериодыСтавокВБюджетСубъектов.РегистрацияВНО КАК РегистрацияВНО,
	|	ПоследниеПериодыСтавокВБюджетСубъектов.Организация КАК Организация,
	|	ПоследниеПериодыСтавокВБюджетСубъектов.ДатаОтражения КАК ДатаОтражения
	|ПОМЕСТИТЬ СрезСтавокВСубъекты
	|ИЗ
	|	ПоследниеПериодыСтавокВБюджетСубъектов КАК ПоследниеПериодыСтавокВБюджетСубъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ КАК СтавкиНалогаНаПрибыльВБюджетСубъектовРФ
	|		ПО ПоследниеПериодыСтавокВБюджетСубъектов.Период = СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Период
	|			И ПоследниеПериодыСтавокВБюджетСубъектов.Организация = СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Организация
	|			И ПоследниеПериодыСтавокВБюджетСубъектов.РегистрацияВНО = СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезРегистрацийВНО.РегистрацияВНО КАК РегистрацияВНО,
	|	СрезРегистрацийВНО.Организация КАК Организация,
	|	СрезРегистрацийВНО.ДатаОтражения КАК ДатаОтражения,
	|	ВЫБОР
	|		КОГДА СрезСтавокНалогаНаПрибыль.НалогВсего + ЕСТЬNULL(СрезСтавокВСубъекты.СтавкаВСубъект, СрезСтавокНалогаНаПрибыль.СтавкаСубъектРФ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ СрезСтавокНалогаНаПрибыль.СтавкаФБ / (СрезСтавокНалогаНаПрибыль.СтавкаФБ + ЕСТЬNULL(СрезСтавокВСубъекты.СтавкаВСубъект, СрезСтавокНалогаНаПрибыль.СтавкаСубъектРФ))
	|	КОНЕЦ КАК СтавкаФБ,
	|	ВЫБОР
	|		КОГДА СрезСтавокНалогаНаПрибыль.НалогВсего + ЕСТЬNULL(СрезСтавокВСубъекты.СтавкаВСубъект, СрезСтавокНалогаНаПрибыль.СтавкаСубъектРФ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(СрезСтавокВСубъекты.СтавкаВСубъект, СрезСтавокНалогаНаПрибыль.СтавкаСубъектРФ) / (СрезСтавокНалогаНаПрибыль.СтавкаФБ + ЕСТЬNULL(СрезСтавокВСубъекты.СтавкаВСубъект, СрезСтавокНалогаНаПрибыль.СтавкаСубъектРФ))
	|	КОНЕЦ КАК СтавкаРБ
	|ПОМЕСТИТЬ СтавкиНалогаНаПрибыль
	|ИЗ
	|	СрезРегистрацийВНО КАК СрезРегистрацийВНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ СрезСтавокНалогаНаПрибыль КАК СрезСтавокНалогаНаПрибыль
	|		ПО СрезРегистрацийВНО.Организация = СрезСтавокНалогаНаПрибыль.Организация
	|			И СрезРегистрацийВНО.ДатаОтражения = СрезСтавокНалогаНаПрибыль.ДатаОтражения
	|		ЛЕВОЕ СОЕДИНЕНИЕ СрезСтавокВСубъекты КАК СрезСтавокВСубъекты
	|		ПО СрезРегистрацийВНО.РегистрацияВНО = СрезСтавокВСубъекты.РегистрацияВНО
	|			И СрезРегистрацийВНО.Организация = СрезСтавокВСубъекты.Организация
	|			И СрезРегистрацийВНО.ДатаОтражения = СрезСтавокВСубъекты.ДатаОтражения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДатаОтражения
	|;
	|";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДивиденды(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаНачисления(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаНДФЛ(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(Запрос, ТекстыЗапроса, Регистры);
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	ПроведениеСерверУТ.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Дата КАК Дата,
	|	Документ.ДатаВыплаты КАК ДатаВыплаты,
	|	Документ.Валюта КАК Валюта,
	|	Документ.Организация КАК Организация
	|ИЗ
	|	Документ.НачислениеДивидендов КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка";

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
		Реквизиты.Валюта,
		Неопределено,
		Реквизиты.Дата);
	
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУпр",	Коэффициенты.КоэффициентПересчетаВВалютуУпр);
	Запрос.УстановитьПараметр("Ссылка",					ДокументСсылка);
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
	Запрос.УстановитьПараметр("ДатаДокумента",			Реквизиты.Дата);
	Запрос.УстановитьПараметр("ДатаВыплаты",			Реквизиты.ДатаВыплаты);
	
КонецПроцедуры

Функция ТекстЗапросаВТТаблицаФизическихЛиц(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВТТаблицаФизическихЛиц"; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Ссылка КАК Ссылка,
	|	ДивидендыФизическимЛицам.ФизическоеЛицо,
	|	ДивидендыФизическимЛицам.Начислено,
	|	ДивидендыФизическимЛицам.СтавкаНДФЛ,
	|	ДивидендыФизическимЛицам.НДФЛ,
	|	ДивидендыФизическимЛицам.ВычетПоНДФЛ,
	|	ДивидендыФизическимЛицам.КВыплате,
	|	Не ДивидендыФизическимЛицам.ПрочийАкционер КАК ЭтоСотрудник
	|ПОМЕСТИТЬ ВТТаблицаФизическихЛиц
	|ИЗ
	|	Документ.НачислениеДивидендов.ФизическиеЛица КАК ДивидендыФизическимЛицам
	|ГДЕ
	|	ДивидендыФизическимЛицам.Ссылка = &Ссылка
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ПрочиеАктивыПассивы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВТТаблицаФизическихЛиц", ТекстыЗапроса) Тогда
		ТекстЗапросаВТТаблицаФизическихЛиц(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ДатаДокумента КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаФизическихЛиц.ЭтоСотрудник
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивидендыСотрудникам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивиденды)
	|	КОНЕЦ КАК Аналитика,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаФизическихЛиц.НДФЛ * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2))) КАК Сумма
	|ИЗ
	|	ВТТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаФизическихЛиц.ЭтоСотрудник
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивидендыСотрудникам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивиденды)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаДокумента КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки) КАК Статья,
	|	Неопределено КАК Аналитика,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаФизическихЛиц.НДФЛ * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2))) КАК Сумма
	|ИЗ
	|	ВТТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ДвиженияДоходыРасходыПрочиеАктивыПассивы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВТТаблицаФизическихЛиц", ТекстыЗапроса) Тогда
		ТекстЗапросаВТТаблицаФизическихЛиц(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ДатаДокумента                                                КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтражениеНалоговВзносовСЗаработнойПлаты) КАК ХозяйственнаяОперация,
	|	&Организация                                                  КАК Организация,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.Налоги) КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаФизическихЛиц.ЭтоСотрудник
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивидендыСотрудникам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивиденды)
	|	КОНЕЦ                                                         КАК АналитикаАктивовПассивов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки) КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО                                                  КАК КорАналитикаАктивовПассивов,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаФизическихЛиц.НДФЛ * &КоэффициентПересчетаВВалютуУпр  КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаФизическихЛиц.НДФЛ) КАК СуммаРегл
	|ИЗ
	|	ВТТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаФизическихЛиц.ЭтоСотрудник
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивидендыСотрудникам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НДФЛДивиденды)
	|	КОНЕЦ
	|	
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДивиденды(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Дивиденды";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВТТаблицаФизическихЛиц", ТекстыЗапроса) Тогда
		ТекстЗапросаВТТаблицаФизическихЛиц(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаФизическихЛиц.ФизическоеЛицо КАК Акционер,
	|	ТаблицаФизическихЛиц.Начислено КАК Начислено,
	|	ТаблицаФизическихЛиц.ВычетПоНДФЛ КАК ВычетПоНДФЛ,
	|	ТаблицаФизическихЛиц.НДФЛ КАК НДФЛ,
	|	ТаблицаФизическихЛиц.КВыплате КАК КВыплате
	|ИЗ
	|	ВТТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНачисления(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Начисления";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВТТаблицаФизическихЛиц", ТекстыЗапроса) Тогда
		ТекстЗапросаВТТаблицаФизическихЛиц(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаФизическихЛиц.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ТаблицаФизическихЛиц.ЭтоСотрудник
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДивидендыСотрудников)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|	КОНЕЦ КАК Начисление,
	|	ТаблицаФизическихЛиц.Ссылка КАК ДокументОснование,
	|	ТаблицаФизическихЛиц.Начислено КАК Сумма
	|ИЗ
	|	ВТТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДФЛ(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "НДФЛ";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВТТаблицаФизическихЛиц", ТекстыЗапроса) Тогда
		ТекстЗапросаВТТаблицаФизическихЛиц(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаФизическихЛиц.ФизическоеЛицо,
	|	ТаблицаФизическихЛиц.НДФЛ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаФизическихЛиц.ЭтоСотрудник 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НФДЛДивидендыСотрудникам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НФДЛДивиденды)
	|	КОНЕЦ КАК НачислениеУдержание,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций) КАК Подразделение,
	|	ТаблицаФизическихЛиц.Ссылка КАК ДокументОснование
	|ИЗ
	|	ВТТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ОтражениеДокументовВРеглУчете";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ДатаДокумента 				 		КАК Период,
	|	&Организация 				 		КАК Организация,
	|	НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ) КАК ДатаОтражения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДатаДокумента 				 		КАК Период,
	|	&Организация 				 		КАК Организация,
	|	НАЧАЛОПЕРИОДА(&ДатаВыплаты, ДЕНЬ) 	КАК ДатаОтражения
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ) <> НАЧАЛОПЕРИОДА(&ДатаВыплаты, ДЕНЬ)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Справка о списании депонированной зарплаты.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеДивидендов";
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаОДивидендах";
	КомандаПечати.Представление = НСтр("ru = 'Справка о дивидендах'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Истина;

КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьСправку = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОДивидендах");
	
	Если НужноПечататьСправку Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОДивидендах",
			НСтр("ru = 'Справка о дивидендах'"), ПечатьСправки(МассивОбъектов, ОбъектыПечати), ,
			"Документ.ДивидендыФизическимЛицам.ПФ_MXL_СправкаОРегистрацииПрочихДоходов");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСправки(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОДивидендах";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеДивидендов.ПФ_MXL_СправкаОДивидендах");
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакетаШапкаФЛ = Макет.ПолучитьОбласть("ШапкаФЛ");
	ОбластьМакетаСтрокаФЛ = Макет.ПолучитьОбласть("СтрокаФЛ");
	ОбластьМакетаИтогФЛ = Макет.ПолучитьОбласть("ИтогФЛ");
	
	ОбластьМакетаШапкаЮЛ = Макет.ПолучитьОбласть("ШапкаЮЛ");
	ОбластьМакетаСтрокаЮЛ = Макет.ПолучитьОбласть("СтрокаЮЛ");
	ОбластьМакетаИтогЮЛ = Макет.ПолучитьОбласть("ИтогЮЛ");
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		ТекущаяТаблицаФЛ = Истина;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
		
		ОбластьМакетаШапка.Параметры.Заполнить(ДанныеДокумента);
		ДокументРезультат.Вывести(ОбластьМакетаШапка);
		
		Если ДанныеДокумента.ТабличнаяЧастьФЛ.Количество() > 0 Тогда
			
			ДокументРезультат.Вывести(ОбластьМакетаШапкаФЛ);
			
			СтруктураИтогаФЛ = Новый Структура();
			СтруктураИтогаФЛ.Вставить("НДФЛ",          0);
			СтруктураИтогаФЛ.Вставить("Начислено",     0);
			СтруктураИтогаФЛ.Вставить("СуммаВычета",   0);
			СтруктураИтогаФЛ.Вставить("СуммаКВыплате", 0);
			
			Для каждого ДанныеСотрудника Из ДанныеДокумента.ТабличнаяЧастьФЛ Цикл
				
				МассивВыводимыхОбластей = Новый Массив;
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаСтрокаФЛ);
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаИтогФЛ);
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаПодвал);
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, МассивВыводимыхОбластей) Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ОбластьМакетаШапкаФЛ);
				КонецЕсли;
				
				ОбластьМакетаСтрокаФЛ.Параметры.Заполнить(ДанныеСотрудника);
				
				ДокументРезультат.Вывести(ОбластьМакетаСтрокаФЛ);
				
				СтруктураИтогаФЛ.Начислено     = СтруктураИтогаФЛ.Начислено + ДанныеСотрудника.Начислено;
				СтруктураИтогаФЛ.СуммаВычета   = СтруктураИтогаФЛ.СуммаВычета + ДанныеСотрудника.СуммаВычета;
				СтруктураИтогаФЛ.НДФЛ          = СтруктураИтогаФЛ.НДФЛ + ДанныеСотрудника.НДФЛ;
				СтруктураИтогаФЛ.СуммаКВыплате = СтруктураИтогаФЛ.СуммаКВыплате + ДанныеСотрудника.СуммаКВыплате;
				
			КонецЦикла;
			
			ОбластьМакетаИтогФЛ.Параметры.Заполнить(СтруктураИтогаФЛ);
			ДокументРезультат.Вывести(ОбластьМакетаИтогФЛ);
			
		КонецЕсли;
		
		Если ДанныеДокумента.ТабличнаяЧастьЮЛ.Количество() > 0 Тогда
			
			ДокументРезультат.Вывести(ОбластьМакетаШапкаЮЛ);
			
			СтруктураИтогаЮЛ = Новый Структура("Начислено, НалогНаПрибыль, СуммаКВыплате", 0, 0, 0);
			
			Для каждого ДанныеСотрудника Из ДанныеДокумента.ТабличнаяЧастьЮЛ Цикл
				
				МассивВыводимыхОбластей = Новый Массив;
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаСтрокаЮЛ);
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаИтогЮЛ);
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаПодвал);
				
				Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, МассивВыводимыхОбластей) Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ОбластьМакетаШапкаЮЛ);
				КонецЕсли;
				
				ОбластьМакетаСтрокаЮЛ.Параметры.Заполнить(ДанныеСотрудника);
				
				ДокументРезультат.Вывести(ОбластьМакетаСтрокаЮЛ);
				
				СтруктураИтогаЮЛ.Начислено     = СтруктураИтогаЮЛ.Начислено + ДанныеСотрудника.Начислено;
				СтруктураИтогаЮЛ.НалогНаПрибыль= СтруктураИтогаЮЛ.НалогНаПрибыль + ДанныеСотрудника.НалогНаПрибыль;
				СтруктураИтогаЮЛ.СуммаКВыплате = СтруктураИтогаЮЛ.СуммаКВыплате + ДанныеСотрудника.СуммаКВыплате;
				
			КонецЦикла;
			
			ОбластьМакетаИтогЮЛ.Параметры.Заполнить(СтруктураИтогаЮЛ);
			ДокументРезультат.Вывести(ОбластьМакетаИтогЮЛ);
			
		КонецЕсли;
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДокумента);
		ДокументРезультат.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Ссылка);
				
	КонецЦикла;
	
	Возврат ДокументРезультат;
		
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Истина КАК ЭтоФизическоеЛицо,
		|	ДивидендыФизическимЛицам.Ссылка.Организация.НаименованиеПолное КАК Организация,
		|	ДивидендыФизическимЛицам.Ссылка КАК Ссылка,
		|	ДивидендыФизическимЛицам.Ссылка.Номер,
		|	НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.Ссылка.Дата, ДЕНЬ) КАК Период,
		|	ДивидендыФизическимЛицам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДивидендыФизическимЛицам.НДФЛ КАК НДФЛ,
		|	0 КАК НалогНаПрибыль,
		|	ДивидендыФизическимЛицам.Начислено КАК Начислено,
		|	ДивидендыФизическимЛицам.ВычетПоНДФЛ КАК СуммаВычета,
		|	ДивидендыФизическимЛицам.КВыплате КАК СуммаКВыплате,
		|	ДивидендыФизическимЛицам.Ссылка.Ответственный КАК Исполнитель,
		|	"""" КАК ДолжностьИсполнителя
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.НачислениеДивидендов.ФизическиеЛица КАК ДивидендыФизическимЛицам
		|ГДЕ
		|	ДивидендыФизическимЛицам.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Ложь КАК ЭтоФизическоеЛицо,
		|	ДивидендыЮридическимЛицам.Ссылка.Организация.НаименованиеПолное КАК Организация,
		|	ДивидендыЮридическимЛицам.Ссылка КАК Ссылка,
		|	ДивидендыЮридическимЛицам.Ссылка.Номер,
		|	НАЧАЛОПЕРИОДА(ДивидендыЮридическимЛицам.Ссылка.Дата, ДЕНЬ) КАК Период,
		|	ДивидендыЮридическимЛицам.Контрагент КАК ФизическоеЛицо,
		|	0 КАК НДФЛ,
		|	ДивидендыЮридическимЛицам.НалогНаПрибыль КАК НалогНаПрибыль,
		|	ДивидендыЮридическимЛицам.Начислено КАК Начислено,
		|	0 КАК СуммаВычета,
		|	ДивидендыЮридическимЛицам.КВыплате КАК СуммаКВыплате,
		|	ДивидендыЮридическимЛицам.Ссылка.Ответственный КАК Исполнитель,
		|	"""" КАК ДолжностьИсполнителя
		|ИЗ
		|	Документ.НачислениеДивидендов.ЮридическиеЛица КАК ДивидендыЮридическимЛицам
		|ГДЕ
		|	ДивидендыЮридическимЛицам.Ссылка В(&МассивОбъектов)";
	
	Запрос.Выполнить();
	
	ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВТ, Истина, "ФИОПолные");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДокументов.ЭтоФизическоеЛицо КАК ЭтоФизическоеЛицо,
		|	ДанныеДокументов.Организация КАК Организация,
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Номер КАК Номер,
		|	ДанныеДокументов.Период КАК Дата,
		|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФИОПолные, ДанныеДокументов.ФизическоеЛицо) КАК Акционер,
		|	ДанныеДокументов.НДФЛ КАК НДФЛ,
		|	ДанныеДокументов.НалогНаПрибыль КАК НалогНаПрибыль,
		|	ДанныеДокументов.Начислено КАК Начислено,
		|	ДанныеДокументов.СуммаВычета КАК СуммаВычета,
		|	ДанныеДокументов.СуммаКВыплате КАК СуммаКВыплате,
		|	ЕСТЬNULL(ДанныеДокументов.Исполнитель, """") КАК Исполнитель,
		|	ДанныеДокументов.ДолжностьИсполнителя КАК ДолжностьИсполнителя
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
		|		ПО ДанныеДокументов.Период = КадровыеДанныеФизическихЛиц.Период
		|			И ДанныеДокументов.ФизическоеЛицо = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
		|ИТОГИ
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Номер),
		|	МАКСИМУМ(Дата),
		|	СУММА(НДФЛ),
		|	СУММА(НалогНаПрибыль),
		|	СУММА(Начислено),
		|	СУММА(СуммаВычета),
		|	СУММА(СуммаКВыплате),
		|	МАКСИМУМ(Исполнитель),
		|	МАКСИМУМ(ДолжностьИсполнителя)
		|ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	ГруппировкаПоДокументу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ГруппировкаПоДокументу.Следующий() Цикл
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("Ссылка", ГруппировкаПоДокументу.Ссылка);
		ДанныеПечати.Вставить("НазваниеОрганизации", ГруппировкаПоДокументу.Организация);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", ВалютаУчета.НаименованиеПолное);
		ДанныеПечати.Вставить("ДатаДокумента", Формат(ГруппировкаПоДокументу.Дата, "ДЛФ=D"));
		ДанныеПечати.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ГруппировкаПоДокументу.Номер, Истина, Истина));
		ДанныеПечати.Вставить("Начислено", ГруппировкаПоДокументу.Начислено);
		ДанныеПечати.Вставить("СуммаВычета", ГруппировкаПоДокументу.СуммаВычета);
		ДанныеПечати.Вставить("НДФЛ", ГруппировкаПоДокументу.НДФЛ);
		ДанныеПечати.Вставить("НалогНаПрибыль", ГруппировкаПоДокументу.НалогНаПрибыль);
		ДанныеПечати.Вставить("СуммаКВыплате", ГруппировкаПоДокументу.СуммаКВыплате);
		ДанныеПечати.Вставить("ДолжностьИсполнителя", ГруппировкаПоДокументу.ДолжностьИсполнителя);
		ДанныеПечати.Вставить("ИсполнительРасшифровкаПодписи", ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ГруппировкаПоДокументу.Исполнитель));
		ДанныеПечати.Вставить("ТабличнаяЧастьФЛ", Новый Массив);
		ДанныеПечати.Вставить("ТабличнаяЧастьЮЛ", Новый Массив);
		
		ГруппировкаПоСотрудникам = ГруппировкаПоДокументу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ГруппировкаПоСотрудникам.Следующий() Цикл
			
			Если ГруппировкаПоСотрудникам.ЭтоФизическоеЛицо Тогда
				
				СтрокаДанныхПечати = Новый Структура;
				СтрокаДанныхПечати.Вставить("Акционер", ГруппировкаПоСотрудникам.Акционер);
				СтрокаДанныхПечати.Вставить("Начислено", ГруппировкаПоСотрудникам.Начислено);
				СтрокаДанныхПечати.Вставить("СуммаВычета", ГруппировкаПоСотрудникам.СуммаВычета);
				СтрокаДанныхПечати.Вставить("НДФЛ", ГруппировкаПоСотрудникам.НДФЛ);
				СтрокаДанныхПечати.Вставить("СуммаКВыплате", ГруппировкаПоСотрудникам.СуммаКВыплате);
				ДанныеПечати.ТабличнаяЧастьФЛ.Добавить(СтрокаДанныхПечати);
				
			Иначе
				
				СтрокаДанныхПечати = Новый Структура;
				СтрокаДанныхПечати.Вставить("Акционер", ГруппировкаПоСотрудникам.Акционер);
				СтрокаДанныхПечати.Вставить("Начислено", ГруппировкаПоСотрудникам.Начислено);
				СтрокаДанныхПечати.Вставить("НалогНаПрибыль", ГруппировкаПоСотрудникам.НалогНаПрибыль);
				СтрокаДанныхПечати.Вставить("СуммаКВыплате", ГруппировкаПоСотрудникам.СуммаКВыплате);
				ДанныеПечати.ТабличнаяЧастьЮЛ.Добавить(СтрокаДанныхПечати);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеПечатиОбъектов.Вставить(ГруппировкаПоДокументу.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
		
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачислениеДивидендовЮридическиеЛица.Ссылка
		|ИЗ
		|	Документ.НачислениеДивидендов.ЮридическиеЛица КАК НачислениеДивидендовЮридическиеЛица
		|ГДЕ
		|	НЕ НачислениеДивидендовЮридическиеЛица.УдалитьСтавкаНалогаНаПрибыль = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.ПустаяСсылка)
		|	И НачислениеДивидендовЮридическиеЛица.СтавкаНалогаНаПрибыль = 0";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Ставки = Новый Соответствие();
	Ставки.Вставить(Перечисления.НДФЛСтавки.ПустаяСсылка(), 0);
	Ставки.Вставить(Перечисления.НДФЛСтавки.Ставка13, 13);
	Ставки.Вставить(Перечисления.НДФЛСтавки.Ставка15, 15);
	
	ПолноеИмя = "Документ.НачислениеДивидендов";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь,ПолноеИмя);
	Пока Выборка.Следующий() Цикл
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмя);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		НачатьТранзакцию();
		
		Попытка
			Блокировка.Заблокировать();
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойБлокировке(Выборка.Ссылка);
			Продолжить;
			
		КонецПопытки;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		ЕстьИзменения = Ложь;
		Для Каждого СтрокаДивидендов Из Объект.ЮридическиеЛица Цикл
			Если Не СтрокаДивидендов.УдалитьСтавкаНалогаНаПрибыль = Перечисления.НДФЛСтавки.ПустаяСсылка()
				И СтрокаДивидендов.СтавкаНалогаНаПрибыль = 0 Тогда
				
				СтрокаДивидендов.СтавкаНалогаНаПрибыль = Ставки[СтрокаДивидендов.УдалитьСтавкаНалогаНаПрибыль];
				ЕстьИзменения = Истина;
				
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			
			Если ЕстьИзменения Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(Выборка.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
