///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм расчета себестоимости
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОсновнойИнтерфейсМеханизма

// Запуск расчета себестоимости.
//
// Параметры:
//	ПараметрыЗапуска - Структура с ключами
//		Дата - Дата - период расчета себестоимости
//		МассивОрганизаций - СправочникСсылка.Организации - рассчитывать только по указанной организации;
//			также будут пересчитана себестоимость по организациям, связанным по схеме Интеркампани с указанной
//					- Массив - массив организаций, по которым надо рассчитать себестоимость, другие организации не рассчитываются
//		ПредварительныйРасчет - Булево - выполнять фактический или предварительный расчет;
//			предварительный расчет может выполняться
//				= регламентным заданием
//				= как подготовительный этап к распределению расходов на продукцию
//		РегламентноеЗадание - Булево - если Истина, значит вызвана из регламентного задания расчета предварительной себестоимости
//		МестоВызоваРасчета - Строка - необязательный, полное имя процедуры, вызвавшей расчет
//	ПараметрыРасчета - Структура - параметры расчета, сформированные в вызывающем механизме.
//	ПараметрыОтладки - Структура - предназначена для переопределения одноименных свойств структуры ПараметрыРасчета.
//		Подробнее см. пояснения в коде ИнициализироватьПараметрыРасчетаСебестоимости() к параметру ПараметрыОтладки.
//
Процедура РассчитатьВсе(ПараметрыЗапуска, ПараметрыРасчета = Неопределено, ПараметрыОтладки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыОтладки = Неопределено Тогда
		ПараметрыОтладки = Новый Структура; // для упрощения дальнейших обращений к этому свойству
	КонецЕсли;
	
	Если НЕ ПараметрыЗапуска.Свойство("ТолькоРасчетСебестоимости") Тогда
		// Запущено не из механизма расчета партий
		ПараметрыЗапуска.Вставить("ТолькоРасчетСебестоимости", (ПараметрыРасчета = Неопределено));
	КонецЕсли;
	
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости И ПараметрыЗапуска.Свойство("МестоВызоваРасчета") Тогда
		// Перенесем это справочное свойство в ПараметрыОтладки, для последующего вывода в протокол расчета
		ПараметрыОтладки.Вставить("МестоВызоваРасчета", ПараметрыЗапуска.МестоВызоваРасчета);
	КонецЕсли;
	
	// Проверим, закончено ли обновление ИБ
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости Тогда // при запуске из партионного учета версии 2.2 проверка уже выполнена там
		УниверсальныеМеханизмыПартийИСебестоимости.ПроверитьБлокировкуДанныхПриОбновленииИБ(Истина, , ПараметрыОтладки);
	КонецЕсли;
	
	// Инициализируем параметры расчета
	ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости Тогда
		// Запомним состояние активности текущих итогов у обслуживаемых регистров
		СостояниеИтоговРегистров = УниверсальныеМеханизмыПартийИСебестоимости.СостояниеТекущихИтоговРегистров();
	КонецЕсли;
	
	НомерГруппы = 0;
	
	// Выполним расчет себестоимости по каждой из групп связанных организаций
	Пока НомерГруппы < ПараметрыРасчета.ГруппыОрганизацийПоИнтеркампани.Количество() Цикл
		
		ПараметрыЗапускаРасчетаПоГруппеОрганизаций = Новый Структура(
			"ГруппаОрганизаций, МетодОценки",
			ПараметрыРасчета.ГруппыОрганизацийПоИнтеркампани[НомерГруппы],
			ПараметрыРасчета.МетодыОценкиПоГруппамОрганизаций[НомерГруппы]);
		
		РассчитатьСебестоимостьПоГруппеОрганизаций(ПараметрыЗапускаРасчетаПоГруппеОрганизаций, ПараметрыРасчета, ПараметрыОтладки);
		
		НомерГруппы = НомерГруппы + 1;
		
	КонецЦикла;
	
	// Записываем движения (в случае, если расчет себестоимости запущен самостоятельно, а не как этап расчета партий)
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаписатьСформированныеДвижения(
		ПараметрыРасчета,
		ПараметрыОтладки.ПротоколыРасчета);
	
	Если ПараметрыЗапуска.ТолькоРасчетСебестоимости Тогда
		// Вернем признак активности текущих итогов в состояние, которое было до начала расчета
		УниверсальныеМеханизмыПартийИСебестоимости.ВернутьСостояниеТекущихИтоговРегистров(СостояниеИтоговРегистров);
	КонецЕсли;
	
КонецПроцедуры

// Обертка для запуска расчета - выполняет расчет в Попытке - Исключении
// Параметры аналогичны процедуре РассчитатьВсе()
//
// Возвращаемое значение - Булево - признак успешного выполнения расчета.
//
Функция РассчитатьВсеВПопыткеИсключении(ПараметрыЗапуска, ПараметрыРасчета = Неопределено, ПараметрыОтладки = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Попытка
		РассчитатьВсе(ПараметрыЗапуска,	ПараметрыРасчета, ПараметрыОтладки);
	Исключение
		
		Если ПараметрыРасчета = Неопределено Тогда
			// Все параметры расчета не нужны, заполним только необходимые свойства
			ПараметрыРасчета = Новый Структура("ЗапущенРасчетПартий, ИдетРасчетПартий", Ложь, Ложь);
		КонецЕсли;
		
		УниверсальныеМеханизмыПартийИСебестоимости.ОбработатьИсключениеВызоваРассчитатьВсе(
			ПараметрыРасчета,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			Отказ);
		
	КонецПопытки;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыВызываемыеИзРегламентныхЗаданий

// Обновления стоимости товаров регламентным заданием.
//
Процедура ПредварительныйРасчетСебестоимости() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РасчетСебестоимости); // проверка возможности запуска задания
	
	ПараметрыЗапускаРасчетаСебестоимости = Новый Структура;
	ПараметрыЗапускаРасчетаСебестоимости.Вставить("Дата", 					ТекущаяДатаСеанса());
	ПараметрыЗапускаРасчетаСебестоимости.Вставить("ПредварительныйРасчет", 	Истина);
	ПараметрыЗапускаРасчетаСебестоимости.Вставить("МассивОрганизаций", 		Неопределено);
	ПараметрыЗапускаРасчетаСебестоимости.Вставить("РегламентноеЗадание", 	Истина);
	ПараметрыЗапускаРасчетаСебестоимости.Вставить("МестоВызоваРасчета", 	"РасчетСебестоимости.ПредварительныйРасчетСебестоимости");
	
	СебестоимостьРассчитана = РассчитатьВсеВПопыткеИсключении(ПараметрыЗапускаРасчетаСебестоимости);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

// Перед началом расчета заполняет все необходимые параметры и инициализирует все структуры данных, используемые алгоритма расчета.
// Если расчет себестоимости вызывается не самостоятельно, а как этап расчета партий,
// то параметр ПараметрыРасчета уже будет инициализирован общими свойствами механизмов расчета.
//
// Внимание: если какая-то сущность используется более чем в одном этапе расчета, то ее стоит занести в ПараметрыРасчета.
//
Процедура ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьОбщиеПараметрыРасчетаСебестоимости");
	
	// Создадим контейнер всех параметров, используемых механизмом расчета партий
	ПараметрыИнициализации = Новый Структура;
	ПараметрыИнициализации.Вставить("Дата",
		?(ПараметрыЗапуска.ТолькоРасчетСебестоимости И ПараметрыЗапуска.ПредварительныйРасчет,
			КонецДня(ПараметрыЗапуска.Дата), КонецМесяца(ПараметрыЗапуска.Дата)));
	ПараметрыИнициализации.Вставить("МассивОрганизаций",
		?(ТипЗнч(ПараметрыЗапуска.МассивОрганизаций) <> Тип("Массив") И ЗначениеЗаполнено(ПараметрыЗапуска.МассивОрганизаций),
			УниверсальныеМеханизмыПартийИСебестоимости.СвязиОрганизацийПоСхемеИнтеркампани(НачалоМесяца(ПараметрыЗапуска.Дата), ПараметрыЗапуска.МассивОрганизаций),
			ПараметрыЗапуска.МассивОрганизаций));
	ПараметрыИнициализации.Вставить("ЗапущенРасчетПартий", Ложь);
	ПараметрыИнициализации.Вставить("ТолькоПредварительныйРасчетСебестоимости",
		?(ПараметрыЗапуска.ТолькоРасчетСебестоимости, ПараметрыЗапуска.ПредварительныйРасчет, Ложь));
	ПараметрыИнициализации.Вставить("ЗапущеноРегламентнымЗаданием", ПараметрыЗапуска.РегламентноеЗадание);
	
	Если ПараметрыЗапуска.Свойство("ИзмененоДокументов") Тогда
		// Штатный вызов из механизма партионного учета версии 2.1.
		ПараметрыИнициализации.Вставить("ИзмененоДокументов", ПараметрыЗапуска.ИзмененоДокументов);
	КонецЕсли;
	
	УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьОбщиеПараметрыРасчета(
		ПараметрыИнициализации, ПараметрыРасчета, ПараметрыОтладки);
	
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
		
		УниверсальныеМеханизмыПартийИСебестоимости.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Истина);
		
		Если УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТСтоимостьПартийТоваров") > 0 Тогда
			
			// Предварительная стоимость была нужна для распределения доп. расходов в механизме расчета партий.
			// Теперь ее надо очистить - вместо нее будет сформирована фактическая стоимость.
			УниверсальныеМеханизмыПартийИСебестоимости.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТСтоимостьПартийТоваров");
			УниверсальныеМеханизмыПартийИСебестоимости.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТКэшСтоимостьТоваров");
			
			ПротоколРасчетаПартийИСебестоимости.ОчисткаСформированныхДвижений(
				ПараметрыРасчета,
				Метаданные.РегистрыСведений.СтоимостьТоваров.Имя);
			
		КонецЕсли;
		
	Иначе
		
		// Запомним протокол расчета и вернем его в место вызова расчета
		ПараметрыОтладки.Вставить("ПротоколыРасчета", Новый Массив);
		
		// Инициализируем кэши регистров, обслуживаемых механизмом партионного учета
		// Непосредственное обновление кэшей будет выполнено в ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций
		Для Каждого КлючИЗначение Из ИспользуемыеКэшиРегистровПартионногоУчета() Цикл
			
			УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьДанныеРегистра(ПараметрыРасчета, КлючИЗначение.Ключ);
			
			ОписаниеРегистра = ПараметрыРасчета.Движения[КлючИЗначение.Ключ.Имя];
			ОписаниеРегистра.ИспользоватьВТКэш = Ложь; // расчетные движения брать из данных ИБ
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Общие параметры расчета себестоимости
	ПараметрыРасчета.Вставить("ПредварительныйРасчет", ПараметрыЗапуска.ПредварительныйРасчет);
	
КонецПроцедуры

Процедура ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций");
	
	// Заменим основной отбор по организациям на текущую рассчитываемую группу.
	// При окончании расчета себестоимости основной отбор будет восстановлен из ПараметрыРасчета.КопияМассивОрганизаций
	ПараметрыРасчета.Вставить("МассивОрганизаций", ПараметрыЗапуска.ГруппаОрганизаций);
	ПараметрыРасчета.Вставить("МетодОценки", 	   ПараметрыЗапуска.МетодОценки); // общий метод оценки для этой группы организаций
	
	// Обновим временные таблицы с отборами по организациям.
	УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьВременныеТаблицыДляОтборов(ПараметрыРасчета);
	
	// Обновим все расчетные кэши остатков и оборотов - в них должны быть только записи по рассчитываемой группе организаций
	// Если расчет вызван регламентной операцией, то считам стоимость по средней(без учета партий)
	// Для этого в расчетном кэше оборотов и остатков будут "очищены" поля, относящиеся к партиям
	// Если расчет себестоимости вызван из механизма партионного учета, то по окончании расчета себестоимости
	// расчетные кэши будут восстановлены автоматически.
	УниверсальныеМеханизмыПартийИСебестоимости.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
	
	// Свойство, пределяющее выполняемую ветвь алгоритма расчета
	ПараметрыРасчета.Вставить("ФИФОСкользящаяОценкаВерсии21",
		НЕ ПараметрыРасчета.ПредварительныйРасчет И НЕ ПараметрыРасчета.ПартионныйУчетВерсии22
	 	И ПараметрыЗапуска.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка);
	
	ПараметрыРасчета.Вставить("КоличествоУзлов",     0);
	ПараметрыРасчета.Вставить("КоличествоУзловРегл", 0);
	
	// Добавим информацию о текущей итерации расчета себестоимости в протокол расчета
	СтрокаПротокола = НСтр("ru='Вид расчета себестоимости'") + ": "
		+ ?(ПараметрыРасчета.ПредварительныйРасчет, НСтр("ru='Предварительный'"), НСтр("ru='Фактический'"));
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		// Метод оценки не влияет на алгоритм расчета
		ПредставлениеМетодаОценки = НСтр("ru='Неважен'");
	ИначеЕсли ПараметрыРасчета.ПартионныйУчетВерсии22 И НЕ ЗначениеЗаполнено(ПараметрыРасчета.МетодОценки) Тогда
		// См. УниверсальныеМеханизмыПартийИСебестоимости.ОпределитьМетодОценкиСтоимостиДляГруппыОрганизаций()
		ПредставлениеМетодаОценки = НСтр("ru='Не ""ФИФО (взвешенная оценка)""'");
	Иначе
		ПредставлениеМетодаОценки = ПараметрыРасчета.МетодОценки;
	КонецЕсли;
	
	СтрокаПротокола = НСтр("ru='Метод оценки стоимости'") + ": "
		+ ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ПредставлениеМетодаОценки);
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	СтрокаПротокола = НСтр("ru='Организации'") + ": "
		+ УниверсальныеМеханизмыПартийИСебестоимости.ПредставлениеОрганизаций(ПараметрыРасчета.МассивОрганизаций, ", ");
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапыРасчета

// Этап 0 - начало расчета
Процедура РассчитатьСебестоимостьПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки)
	
	ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	// Этап 1.1
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		УниверсальныеМеханизмыПартийИСебестоимости.ПроверитьКорректностьИсходныхДанныхДоРасчета(ПараметрыРасчета);
	КонецЕсли;
	
	Если ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		
		// Этап 2.1
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		// - ПрочиеДоходы
		// - ДвиженияНоменклатураДоходыРасходы
		// - ДвиженияНоменклатураНоменклатура
		СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая(ПараметрыРасчета);
		
		// Этап 2.2
		// Формирует движения по регистрам:
		// - ВыручкаИСебестоимостьПродаж
		// - Закупки
		СкорректироватьСтоимостьПродажПоФИФОСкользящая(ПараметрыРасчета);
		
		//++ НЕ УТ
		// Этап 2.3
		// Формирует движения по регистрам:
		// - ПрочиеРасходыНезавершенногоПроизводства
		// - ПрочиеРасходы
		// - СебестоимостьТоваров
		СкорректироватьСтоимостьСписанияНезавершенногоПроизводстваПоФИФОСкользящая(ПараметрыРасчета);
		
		// Этап 2.4
		// Формирует движения по регистрам:
		// - ПрочиеРасходы
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
			СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводстваПоФИФОСкользящая(ПараметрыРасчета);
		КонецЕсли;
		//-- НЕ УТ
		
		// Этап 2.5
		// Формирует движения по регистрам:
		// - СтоимостьТоваров
		ЗарегистрироватьСтоимостьФИФО(ПараметрыРасчета);
		
	Иначе
		
		// Этап 3.1
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		// - ДвиженияНоменклатураДоходыРасходы
		Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
			ВключитьИсключитьНДСВСтоимость(ПараметрыРасчета);
		КонецЕсли;
		
		// Этап 3.2
		// Формирует временные таблицы:
		// - ВТДопРасходов (для фактического расчета она пустая)
		РаспределитьРасходыНаСебестоимость(ПараметрыРасчета);

		// Этап 3.3
		// Формирует временные таблицы:
		// - ВТВозвраты (для фактического расчета она пустая)
		// - СторноОтчетыКомиссионера
		// Формирует движения по регистрам (если выполняется фактический расчет):
		// - СебестоимостьТоваров
		// - ВыручкаИСебестоимостьПродаж
		// - ПрочиеРасходы
		// - ПрочиеДоходы
		// - ДвиженияНоменклатураДоходыРасходы
		// - ДвиженияНоменклатураНоменклатура
		СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета);

		//++ НЕ УТ
		// Этап 3.4
		// Формирует временные таблицы:
		// - ВтАналитикаУчетаРасходов
		// - ВтНезавершенноеПроизводство
		РаспределитьПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета);
		//-- НЕ УТ
		
		// Этап 3.5
		// Формирует временные таблицы:
		// - ВтПередачиТоваров (для фактического расчета она пустая)
		СформироватьТаблицуПередачМеждуОрганизациями(ПараметрыРасчета);
		
		// Этап 3.6
		// Формирует временные таблицы:
		// - ВтУзлыКорректировки
		СформироватьУзлыКорректировкиСписанияСтоимости(ПараметрыРасчета);
		
		Если ПараметрыРасчета.КоличествоУзлов <> 0 Тогда
			
			// Этап 3.7
			// Формирует временные таблицы:
			// - ВтТаблицаРешений
			// - ВтПеремещенияСписания
			РассчитатьСтоимость(ПараметрыРасчета, Ложь);
			
			// Этап 3.8
			// Дополняет временные таблицы:
			// - ВТСтоимостьПартийТоваров
			// Формирует движения по регистрам:
			// - СтоимостьТоваров
			ЗарегистрироватьСтоимость(ПараметрыРасчета, Ложь);
			
		КонецЕсли;

		//++ НЕ УТ
		Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
			// Этап 3.9
			// Формирует временные таблицы:
			// - ВтСтоимостиНезавершенногоПроизводства
			СтоимостьНезавершенногоПроизводства(ПараметрыРасчета);
		КонецЕсли;
		//-- НЕ УТ
		
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			"ВтУзлыКорректировки, ВтПередачиТоваров
			|" + ?(ПараметрыРасчета.КоличествоУзлов <> 0, ", ВтТаблицаРешений, ВтПеремещенияСписания", ""));
		
		// Этап 3.10
		// Формирует временные таблицы:
		// - ВтУзлыКорректировки
		СформироватьУзлыКорректировкиСписанияСтоимостиРегл(ПараметрыРасчета);
		
		Если ПараметрыРасчета.КоличествоУзловРегл <> 0 Тогда
			
			// Этап 3.11
			// Формирует временные таблицы:
			// - ВтТаблицаРешений
			// - ВтПеремещенияСписания
			РассчитатьСтоимость(ПараметрыРасчета, Истина);
			
			// Этап 3.12
			// Дополняет временные таблицы:
			// - ВТСтоимостьПартийТоваров
			// Формирует движения по регистрам:
			// - СтоимостьТоваров
			ЗарегистрироватьСтоимость(ПараметрыРасчета, Истина);

		КонецЕсли;
		
		//++ НЕ УТ
		Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
			// Этап 3.13
			// Формирует временные таблицы:
			// - ВтСтоимостиНезавершенногоПроизводстваРегл
			СтоимостьНезавершенногоПроизводстваРегл(ПараметрыРасчета);
		КонецЕсли;
		//-- НЕ УТ
		
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			"ВтУзлыКорректировки, ВТВозвраты, ВТДопРасходов, ЕстьВозвратныеОтходы
			//++ НЕ УТ
			|, ВтАналитикаУчетаРасходов, ВтНезавершенноеПроизводство, ВтОстаткиНезавершенногоПроизводства
			//-- НЕ УТ
			|" + ?(ПараметрыРасчета.КоличествоУзлов <> 0, ", РаботыДляДавальца", "") + "
			|" + ?(ПараметрыРасчета.КоличествоУзловРегл <> 0, ", ВтТаблицаРешений, ВтПеремещенияСписания", ""));
			
		Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
			
			// Этап 3.14
			// Формирует движения по регистрам:
			// - СебестоимостьТоваров
			// - ПрочиеРасходы
			// - ПрочиеДоходы
			// - ДвиженияНоменклатураДоходыРасходы
			// - ДвиженияНоменклатураНоменклатура
			СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета);
			
			//++ НЕ УТ
			// Этап 3.15
			// Формирует движения по регистрам:
			// - СебестоимостьТоваров
			// - ПрочиеРасходы
			// - ПрочиеРасходыНезавершенногоПроизводства
			Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
				СкорректироватьСтоимостьСписанияНезавершенногоПроизводства22(ПараметрыРасчета);
			Иначе
				СкорректироватьСтоимостьСписанияНезавершенногоПроизводства21(ПараметрыРасчета);
			КонецЕсли;
			
			// Этап 3.16
			// Формирует движения по регистрам:
			// - ПрочиеРасходы
			Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
				СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводства(ПараметрыРасчета);
			КонецЕсли;
			
			УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
				"ВтСтоимостиНезавершенногоПроизводства, ВтСтоимостиНезавершенногоПроизводстваРегл");
			//-- НЕ УТ
			
			// Этап 3.17
			// Формирует движения по регистрам:
			// - ВыручкаИСебестоимостьПродаж
			// - Закупки
			СкорректироватьСтоимостьПродаж(ПараметрыРасчета);
			
			// Этап 3.18
			// Формирует движения по регистрам:
			// - ВыручкаИСебестоимостьПродаж
			ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета);

			Если ПараметрыРасчета.РешениеСЛУ.ЗначениеПогрешностиСтоимость > 0 Тогда
				// Этап 3.19
				// Формирует движения по регистрам:
				// - СебестоимостьТоваров
				// - ПрочиеРасходы
				СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета);
			КонецЕсли;
			
		КонецЕсли;
		
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "СторноОтчетыКомиссионера, ИдентификаторыПартий");
		
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		
		Если ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат Тогда
			// Этап 4.1
			// Формирует движения по регистрам:
			// - ФинансовыеРезультаты
			РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета);
		Иначе
			// Этап 4.2
			// Формирует движения по регистрам:
			// - ПрочиеДоходы
			// - ПрочиеРасходы
			СписатьПрочиеДоходыРасходы(ПараметрыРасчета);
		КонецЕсли;
		
		// Этап 4.3
		// Формирует движения по регистрам:
		// - ПрочиеАктивыПассивы
		ОтразитьПрибылиИУбытки(ПараметрыРасчета);
		
		Если ПараметрыРасчета.ФО.ФормироватьУправленческийБаланс Тогда
			// Этап 4.4
			// Формирует движения управленческого баланса
			ОтразитьВУправленческомБалансе(ПараметрыРасчета);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Этап 2.1
Процедура СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияЗапасовПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.Количество < 0 ТОГДА 2
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация =
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов) ТОГДА 2
	|			ИНАЧЕ 3 КОНЕЦ)
	|		ИНАЧЕ 2 КОНЕЦ КАК Порядок,
	|	УчетСебестоимости.Период						КАК Период,
	|	УчетСебестоимости.Регистратор					КАК Регистратор,
	|	УчетСебестоимости.Организация					КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов					КАК ВидЗапасов,
	|	ВЫБОР КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//++ НЕ УТКА
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) Тогда
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//-- НЕ УТКА
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ КАК ТипЗапасов,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу))
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой))
	|	 И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	//++ НЕ УТ
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) ТОГДА
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры
	//-- НЕ УТ
	//++ НЕ УТКА
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры
	//-- НЕ УТКА
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаПродукции,
	|	УчетСебестоимости.ПериодПродажи					КАК ПериодПродажи,
	|
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   						КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета					КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам		КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента					КАК ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация			КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры	КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета				КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов					КАК КорВидЗапасов,
	|	КорАналитикаНоменклатуры.Склад					КАК КорСклад,
	|	УчетСебестоимости.КорОрганизация				КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение					КАК Подразделение,
	|	УчетСебестоимости.АналитикаРасходов				КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания		КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов КАК ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.АналитикаАктивовПассивов		КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.СтатьяАктивовПассивов			КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.СтатьяДоходов					КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов				КАК АналитикаДоходов,
	|	УчетСебестоимости.Регистратор					КАК ДокументДвижения,
	|	УчетСебестоимости.ИдентификаторСтроки			КАК ИдентификаторСтроки,
	|	УчетСебестоимости.ГруппаПродукции				КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(КорНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	//++ НЕ УТ
	|	ВЫБОР ЕСТЬNULL(ПартииТМЦВЭксплуатации.СпособПогашенияСтоимостиНУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.КорВидЗапасов
	|	ИНАЧЕ
	|		КорАналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ КАК КорИсточникГФУНоменклатуры,
	|	Аналитика.Склад КАК Склад,
	|
	|	ВЫБОР КОГДА КорАналитикаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//++ НЕ УТКА
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) Тогда
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//-- НЕ УТКА
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ КАК КорТипЗапасов,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийРеализации) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК Продажа,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|	ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаМеждуОрганизациями,
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах И УчетСебестоимости.Количество < 0
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратОтКлиента,
	|
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Количество < 0 ТОГДА
	|		0 - УчетСебестоимости.Количество
	|	ИНАЧЕ
	|		УчетСебестоимости.Количество
	|	КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация
	|			= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов)
	|		ТОГДА
	|			- УчетСебестоимости.Количество
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			И УчетСебестоимости.Количество < 0
	|		ТОГДА
	|			- УчетСебестоимости.Количество
	|		ИНАЧЕ
	|			УчетСебестоимости.Количество
	|		КОНЕЦ) КАК ИсходноеКоличество,
	|	СУММА(УчетСебестоимости.КорСтоимость) КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.Стоимость) КАК ИсходнаяСтоимость,
	|	СУММА(УчетСебестоимости.СтоимостьРегл) КАК ИсходнаяСтоимостьРегл,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая) КАК ИсходнаяСтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл) КАК ИсходнаяСтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС) КАК ИсходнаяСтоимостьБезНДС
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|	ПО
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|	ПО
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК КорНазначения
	|		ПО КорНазначения.Ссылка = Аналитика.Назначение
	|	
	//++ НЕ УТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ПередачиВЭксплуатацию
	|	ПО УчетСебестоимости.Регистратор = ПередачиВЭксплуатацию.Ссылка
	|		И УчетСебестоимости.ИдентификаторСтроки = ПередачиВЭксплуатацию.ИдентификаторСтроки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦВЭксплуатации
	|	ПО ПередачиВЭксплуатацию.ПартияТМЦВЭксплуатации = ПартииТМЦВЭксплуатации.Ссылка
	//-- НЕ УТ
	|	
	|ГДЕ
	|	(НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ (УчетСебестоимости.ХозяйственнаяОперация 
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) И УчетСебестоимости.Количество <> 0)
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация
	|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров)
	|	)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.Количество < 0 ТОГДА 2
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация =
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов) ТОГДА 2
	|			ИНАЧЕ 3 КОНЕЦ)
	|		ИНАЧЕ 2 КОНЕЦ,
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу))
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОГДА УчетСебестоимости.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой))
	|	 И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	//++ НЕ УТ
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) ТОГДА
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры
	//-- НЕ УТ
	//++ НЕ УТКА
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры
	//-- НЕ УТКА
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ЕСТЬNULL(КорНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	//++ НЕ УТ
	|	ВЫБОР ЕСТЬNULL(ПартииТМЦВЭксплуатации.СпособПогашенияСтоимостиНУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	//-- НЕ УТ
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.ВидЗапасов,
	|	ВЫБОР КОГДА Аналитика.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//++ НЕ УТКА
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) Тогда
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//-- НЕ УТКА
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.Регистратор,
	|	ВЫБОР КОГДА КорАналитикаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//++ НЕ УТКА
	|	КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) Тогда
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	//-- НЕ УТКА
	|	КОГДА УчетСебестоимости.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|		УчетСебестоимости.ВидЗапасов.ТипЗапасов
	|	ИНАЧЕ
	|		 (ВЫБОР УчетСебестоимости.РазделУчета
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			КОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) КОНЕЦ)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийРеализации) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		УчетСебестоимости.КорВидЗапасов
	|	ИНАЧЕ
	|		КорАналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ,
	|	Аналитика.Склад,
	|	КорАналитикаНоменклатуры.Склад,
	|	ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах И УчетСебестоимости.Количество < 0
	|	 ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.ТипЗапасов КАК ТипЗапасов,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ПериодПродажи,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорСклад,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписания,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяДоходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	//++ НЕ УТ
	|	ЛОЖЬ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|
	|	НЕОПРЕДЕЛЕНО КАК КорТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Продажа,
	|	НЕОПРЕДЕЛЕНО КАК ЭтоПередачаМеждуОрганизациями,
	|	ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратОтКлиента,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.Стоимость КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА Партии.Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	СУММА(Партии.СуммаДопРасходов) КАК СуммаДопРасходов,
	|	СУММА(Партии.СуммаДопРасходовБезНДС) КАК СуммаДопРасходовБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА 0
	|		ИНАЧЕ Партии.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца))
	|			ТОГДА Партии.СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента ТОГДА
	|		0
	|	ИНАЧЕ
	|		Партии.НДСРегл
	|	КОНЕЦ) КАК НДСРегл,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость,
	|	0 КАК ИсходнаяСтоимость,
	|	0 КАК ИсходнаяСтоимостьРегл,
	|	0 КАК ИсходнаяСтоимостьЗабалансовая,
	|	0 КАК ИсходнаяСтоимостьЗабалансоваяРегл,
	|	0 КАК ИсходнаяСтоимостьБезНДС
	|ИЗ
	|	ВтПартии КАК Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.ТипЗапасов,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ПериодПродажи,
	|	ВЫБОР КОГДА Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|	 ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ТипЗапасов,
	|	АналитикаУчетаПродукции,
	|	ПериодПродажи УБЫВ,
	|	Подразделение,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	КорВидЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, ВидДвижения, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов,КорОрганизация, АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ДокументДвижения, ИдентификаторСтроки, КодСтроки, ВариантРаспределенияРасходов, ПринятиеКНалоговомуУчету, ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры,
	|ПериодПродажи, ГруппаПродукции, СписаниеПриПередачеНУ, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл
	|");
	
	СуммыРаспределения = Новый Структура("Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов, АналитикаУчетаПродукции, ПериодПродажи,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СуммыВозврата = Новый Структура("Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов, АналитикаУчетаПродукции,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	// Сформируем ВТПартии
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТПартии");
	ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета);
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			Если Выборка.ЭтоВозвратОтКлиента Тогда
				Если СуммыВозврата.Регистратор = Выборка.Регистратор
				 И СуммыВозврата.Организация = Выборка.Организация
				 И СуммыВозврата.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
				 И СуммыВозврата.ВидЗапасов = Выборка.ВидЗапасов
				 И СуммыВозврата.ТипЗапасов = Выборка.ТипЗапасов
				 И СуммыВозврата.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции Тогда
					СуммыВозврата.Количество = СуммыВозврата.Количество + Выборка.Количество;
					ДополнитьСуммыРаспределения(СуммыВозврата, Выборка);
				Иначе
					ЗаполнитьЗначенияСвойств(СуммыВозврата, Выборка);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.ТипЗапасов = Выборка.ТипЗапасов
			И СтрокаОстатка.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции
			И (СтрокаОстатка.ПериодПродажи = Выборка.ПериодПродажи
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя) Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			Если Выборка.Порядок = 2 И СтрокаОстатка.Количество > 0 Тогда
				РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);	
			ИначеЕсли Выборка.Порядок = 3 Тогда
				РаспределитьСтоимость(СуммыРаспределения, СуммыВозврата, Выборка, Выборка.Количество);
			КонецЕсли;
			
			Если НЕ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			 И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход) Тогда
				ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			КонецЕсли;
			
			//++ НЕ УТ
			Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ВыпускПродукции")
			 //++ НЕ УТКА	
			 ИЛИ ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПоступлениеОтПереработчика")
			 //-- НЕ УТКА
			 Тогда
				СуммыРаспределения.Стоимость = 0;
				СуммыРаспределения.СтоимостьБезНДС = 0;
				СуммыРаспределения.СтоимостьЗабалансовая = 0;
				СуммыРаспределения.СтоимостьРегл = 0;
				СуммыРаспределения.СтоимостьЗабалансоваяРегл = 0;
				СуммыРаспределения.НДСРегл = 0;
				СуммыРаспределения.СуммаДопРасходов = 0;
				СуммыРаспределения.СуммаДопРасходовБезНДС = 0;
				СуммыРаспределения.ПостояннаяРазница = 0;
				СуммыРаспределения.ВременнаяРазница = 0;
			КонецЕсли;
			//-- НЕ УТ
					
			// Корректировка списания товаров
			Если Выборка.ИсходнаяСтоимость <> 0 Тогда
				ЗаписьРаспределения.Стоимость = ЗаписьРаспределения.Стоимость - Выборка.ИсходнаяСтоимость;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьРегл <> 0 Тогда
				ЗаписьРаспределения.СтоимостьРегл = ЗаписьРаспределения.СтоимостьРегл - Выборка.ИсходнаяСтоимостьРегл;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьЗабалансовая <> 0 Тогда
				ЗаписьРаспределения.СтоимостьЗабалансовая = ЗаписьРаспределения.СтоимостьЗабалансовая - Выборка.ИсходнаяСтоимостьЗабалансовая;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьЗабалансоваяРегл <> 0 Тогда
				ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = ЗаписьРаспределения.СтоимостьЗабалансоваяРегл - Выборка.ИсходнаяСтоимостьЗабалансоваяРегл;
			КонецЕсли;
			Если Выборка.ИсходнаяСтоимостьБезНДС <> 0 Тогда
				ЗаписьРаспределения.СтоимостьБезНДС = ЗаписьРаспределения.СтоимостьБезНДС - Выборка.ИсходнаяСтоимостьБезНДС;
			КонецЕсли;
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов Тогда
				
				ЗаписьРаспределения.Стоимость = - ЗаписьРаспределения.Стоимость;
				ЗаписьРаспределения.СтоимостьБезНДС = - ЗаписьРаспределения.СтоимостьБезНДС;
				ЗаписьРаспределения.СтоимостьЗабалансовая = - ЗаписьРаспределения.СтоимостьЗабалансовая;
				ЗаписьРаспределения.СуммаДопРасходов = - ЗаписьРаспределения.СуммаДопРасходов;
				ЗаписьРаспределения.СуммаДопРасходовБезНДС = - ЗаписьРаспределения.СуммаДопРасходовБезНДС;
				ЗаписьРаспределения.СтоимостьРегл = - ЗаписьРаспределения.СтоимостьРегл;
				ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = - ЗаписьРаспределения.СтоимостьЗабалансоваяРегл;
				ЗаписьРаспределения.ПостояннаяРазница = - ЗаписьРаспределения.ПостояннаяРазница;
				ЗаписьРаспределения.ВременнаяРазница = - ЗаписьРаспределения.ВременнаяРазница;
				
				СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения,	ВидДвиженияНакопления.Приход);
				
			Иначе
				
				СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, Выборка.ВидДвижения);
				
			КонецЕсли;

			// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
			Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета)
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СборкаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РазборкаТоваров
			 И НЕ (ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") 
			 	И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
			 И ТипЗнч(Выборка.Регистратор) <> Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПересортицаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПорчаТоваров
			 И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПеремещениеТоваров Тогда
				
				СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения);
						
			КонецЕсли;
				
			// Корректировка списания товаров на затраты в регистре учет прочих расходов.
			Если (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
					//++ НЕ УТ
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставОС
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставНМА
					//-- НЕ УТ
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
					Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании)
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				 
					ЭтоВыпускПродукции = Ложь;
					//++ НЕ УТ
					ЭтоВыпускПродукции = (ТипЗнч(Выборка.ДокументДвижения) = Тип("ДокументСсылка.ВыпускПродукции"));
					//-- НЕ УТ
					
					Если ЗначениеЗаполнено(ЗаписьРаспределения.СтатьяАктивовПассивов) Тогда
						СформироватьДвиженияПрочиеАктивыПассивы(
							ПараметрыРасчета,
							ЗаписьРаспределения,
							ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.СуммаДопРасходов + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0));
					Иначе
						СформироватьДвиженияПрочиеРасходы(
							ПараметрыРасчета,
							ЗаписьРаспределения,
							ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.СуммаДопРасходов + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0),
							ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.СуммаДопРасходовБезНДС + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьБезНДС, 0),
							ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл + ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьРегл, 0),
							ЗаписьРаспределения.ПостояннаяРазница,
							ЗаписьРаспределения.ВременнаяРазница);
					КонецЕсли;

			КонецЕсли;
					
			// Формирование прочих доходов\расходов при пересортице
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
			 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
			 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				 
			 СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.СуммаДопРасходов - Выборка.КорСтоимость;
				Если СуммаПереоценки > 0 Тогда 

					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммаПереоценки,
						ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.СуммаДопРасходовБезНДС,
						ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл,
						ЗаписьРаспределения.ПостояннаяРазница,
						ЗаписьРаспределения.ВременнаяРазница);

				ИначеЕсли СуммаПереоценки < 0 Тогда

					СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						- СуммаПереоценки);

				КонецЕсли;

			КонецЕсли;
		
			// Формирование прочих расходов при порче
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
			
				СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.СуммаДопРасходов - Выборка.КорСтоимость;
				Если СуммаПереоценки <> 0 Тогда
					
					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммаПереоценки,
						ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.СуммаДопРасходовБезНДС,
						ЗаписьРаспределения.СтоимостьРегл + ЗаписьРаспределения.НДСРегл,
						ЗаписьРаспределения.ПостояннаяРазница,
						ЗаписьРаспределения.ВременнаяРазница);
					
				КонецЕсли;

			КонецЕсли;

			// Формирование прочих доходов/расходов при возврате товаров поставщику.
			Если ((Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				И ЗаписьРаспределения.КорСтоимость <> 0)
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
				ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары)
				И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
				И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
				И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
				СуммаПереоценки = ЗаписьРаспределения.Стоимость + ЗаписьРаспределения.СуммаДопРасходов;
				Если СуммаПереоценки > 0 ИЛИ ЗаписьРаспределения.СтоимостьРегл > 0 Тогда

					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммаПереоценки,
						ЗаписьРаспределения.СтоимостьБезНДС + ЗаписьРаспределения.СуммаДопРасходовБезНДС,
						ЗаписьРаспределения.СтоимостьРегл,
						ЗаписьРаспределения.ПостояннаяРазница,
						ЗаписьРаспределения.ВременнаяРазница);

				ИначеЕсли СуммаПереоценки < 0 Тогда

					СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						ЗаписьРаспределения,
						- СуммаПереоценки);

				КонецЕсли;
				
			КонецЕсли;
		
			// Корректировка движений по оборотным регистрам управленческого учета.
			СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, ЗаписьРаспределения);
			
		КонецЕсли;

	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТПартии");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 2.2
Процедура СкорректироватьСтоимостьПродажПоФИФОСкользящая(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПродажПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер         КАК Партнер,
	|	АналитикаПартнеров.Контрагент      КАК Контрагент,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	СУММА(
	|		ВЫБОР КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(Продажи.Количество)          КАК ИсходноеКоличество,
	|	0                                  КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И (Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	|		ИЛИ Продажи.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов))
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер,
	|	АналитикаПартнеров.Контрагент,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Продажи.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	&НачалоПериода КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Регистратор КАК ДокументДвижения,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.ТипЗапасов КАК ТипЗапасов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|
	|	Партии.Количество КАК Количество,
	|	Партии.Стоимость КАК Стоимость,
	|	Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	Партии.СуммаДопРасходов КАК СуммаДопРасходов,
	|	Партии.СуммаДопРасходовБезНДС КАК СуммаДопРасходовБезНДС,
	|	Партии.СтоимостьРегл КАК СтоимостьРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	Партии.НДСРегл КАК НДСРегл,
	|	Партии.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Партии.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ТипЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам, Партнер, Контрагент,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры, 
	|НалогообложениеНДС, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Количество,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");

	// Сформируем ВТПартии
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТПартии");
	ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета, Истина);
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.ТипЗапасов = Выборка.ТипЗапасов
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда	
				
				СформироватьДвиженияЗакупки(ПараметрыРасчета, ЗаписьРаспределения);
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТПартии");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры

//++ НЕ УТ

// Этап 2.3
Процедура СкорректироватьСтоимостьСписанияНезавершенногоПроизводстваПоФИФОСкользящая(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияНезавершенногоПроизводстваПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = " 
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.Организация КАК Организация,
	|	ДД.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	Распределение.Подразделение КАК ПодразделениеРасходов,
	|	СУММА(ДД.ДоляСтоимости) КАК ДоляСтоимости
	|ПОМЕСТИТЬ ПрочиеРасходыНЗПДолиСтоимости
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|		ПО Распределение.Ссылка = ДД.ДокументИсточник
	|ГДЕ
	|	ДД.ДоляСтоимости <> 0
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	//-- НЕ УТКА
	|		)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Распределение.Подразделение
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаПродукции,
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	ПодразделениеРасходов
	|;
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ДД.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ДД.Регистратор,
	|	(ВЫБОР
	|		КОГДА Распределение.Ссылка <> ДД.Регистратор ТОГДА ДД.АналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	ВЫБОР
	|		КОГДА Константы.УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА ДД.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ КАК АналитикаУчетаПродукцииСебестоимость,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	Распределение.Подразделение КАК ИсходноеПодразделение,
	|	Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.Подразделение КАК КорПодразделение,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ДД.Этап КАК Этап,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДД.ГруппаПродукции КАК ГруппаПродукции,
	|	ДД.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	|	
	|	ДД.Продукция КАК Продукция,
	|	ДД.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.ДокументВыпуска КАК ДокументВыпуска,
	//++ НЕ УТКА
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ОтчетДавальцу) ТОГДА ЛОЖЬ
	|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(СпрНазначения.Заказ, НЕОПРЕДЕЛЕНО)) = ТИП(Документ.ЗаказДавальца) ТОГДА ИСТИНА
	|		ИНАЧЕ
	//-- НЕ УТКА
	|		ЛОЖЬ
	//++ НЕ УТКА
	|	КОНЕЦ
	//-- НЕ УТКА
	|		 КАК ЭтоЗаказДавальца,
	|	ДД.Регистратор КАК ДокументДвижения,
	|	ДД.ДокументИсточник,
	|	ДД.ДокументИсточник.Дата КАК ПериодИсточника,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	СУММА(ДД.ДоляСтоимости) КАК ДоляСтоимости,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|		ПО Распределение.Ссылка = ДД.Регистратор
	|		 	ИЛИ Распределение.Ссылка = ДД.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаПродукции = Аналитика.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО АналитикаБезНазначения.Номенклатура		= Аналитика.Номенклатура
	|		И АналитикаБезНазначения.Характеристика		= Аналитика.Характеристика
	|		И АналитикаБезНазначения.Серия				= Аналитика.Серия
	|		И АналитикаБезНазначения.Склад				= Аналитика.Склад
	|		И АналитикаБезНазначения.Назначение			= ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И АналитикаБезНазначения.СтатьяКалькуляции	= Аналитика.СтатьяКалькуляции
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО Аналитика.Назначение = СпрНазначения.Ссылка
	|ГДЕ
	|	ДД.ДоляСтоимости <> 0
	|	И НЕ ДД.СлужебноеВидДвиженияПриход
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Распределение.Подразделение,
	|	Распределение.НаправлениеДеятельности,
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.ДокументИсточник,
	|	ДД.ДокументИсточник.Дата,
	|	ДД.Подразделение,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.Этап,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.АналитикаУчетаПартийПроизводства,
	|	ДД.ВидЗапасов,
	|	ДД.ДокументВыпуска,
	|	ДД.РазделУчета,
	|	(ВЫБОР
	|		КОГДА Распределение.Ссылка <> ДД.Регистратор ТОГДА ДД.АналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	ВЫБОР
	|		КОГДА Константы.УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА ДД.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ,
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	//++ НЕ УТКА
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ОтчетДавальцу) ТОГДА ЛОЖЬ
	|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(СпрНазначения.Заказ, НЕОПРЕДЕЛЕНО)) = ТИП(Документ.ЗаказДавальца) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	//-- НЕ УТКА
	|	ДД.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Распределение.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Распределение.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукцииСебестоимость,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ДД.Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	Распределение.Подразделение КАК ИсходноеПодразделение,
	|	Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.Подразделение КАК КорПодразделение,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ДД.Этап КАК Этап,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДД.ГруппаПродукции КАК ГруппаПродукции,
	|	ДД.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	|	
	|	НЕОПРЕДЕЛЕНО КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
	|	ДД.ДокументВыпуска КАК ДокументВыпуска,
	|	ЛОЖЬ КАК ЭтоЗаказДавальца,
	|	Распределение.Ссылка КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
	|	НЕОПРЕДЕЛЕНО КАК ПериодИсточника,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА ДД.ДоляСтоимости
	|			ИНАЧЕ -ДД.ДоляСтоимости КОНЕЦ) КАК ДоляСтоимости,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|		ПО Распределение.Ссылка = ДД.Регистратор
	|		 	ИЛИ Распределение.Ссылка = ДД.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО ДД.АналитикаУчетаПродукции.Назначение = СпрНазначения.Ссылка
	|ГДЕ
	|	ДД.ДоляСтоимости <> 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Распределение.Подразделение,
	|	Распределение.НаправлениеДеятельности,
	|	Распределение.Дата,
	|	Распределение.Ссылка,
	|	ДД.Подразделение,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.Этап,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.АналитикаУчетаПартийПроизводства,
	|	ДД.ДокументВыпуска,
	|	ДД.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Таб.Период,
	|	Таб.ВидДвижения,
	|	Таб.Регистратор,
	|	Таб.АналитикаУчетаПродукции,
	|	ВЫБОР
	|		КОГДА Константы.УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Таб.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ КАК АналитикаУчетаПродукцииСебестоимость,
	|	Таб.СтатьяРасходов,
	|	Таб.АналитикаРасходов,
	|
	|	Таб.Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	Таб.ПодразделениеРасходов КАК ИсходноеПодразделение,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
	|	НЕОПРЕДЕЛЕНО КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартийПроизводства,
	|	
	|	НЕОПРЕДЕЛЕНО КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК ДокументВыпуска,
	|	ЛОЖЬ 		 КАК ЭтоЗаказДавальца,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
	|	НЕОПРЕДЕЛЕНО КАК ПериодИсточника,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	ЕСТЬNULL(ДолиСтоимости.ДоляСтоимости, СУММА(Таб.ДоляСтоимости)) КАК ДоляСтоимости,
	|	СУММА(Таб.Стоимость) КАК Стоимость,
	|	СУММА(Таб.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Таб.СуммаДопРасходов) КАК СуммаДопРасходов,
	|	СУММА(Таб.СуммаДопРасходовБезНДС) КАК СуммаДопРасходовБезНДС,
	|	СУММА(Таб.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Таб.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Таб.ВременнаяРазница) КАК ВременнаяРазница
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ДД.ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		ДД.СтатьяРасходовСписания КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов КАК АналитикаРасходов,
	|		ДД.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		МАКСИМУМ(ДД.Знаменатель) КАК ДоляСтоимости,
	|		СУММА(ДД.Стоимость) КАК Стоимость,
	|		СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		0. КАК СуммаДопРасходов,
	|		0. КАК СуммаДопРасходовБезНДС,
	|		СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|		СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|		СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В(&МассивОрганизаций)
	|		И ДД.Количество = 0
	|		И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ НЕ УТКА
	|			ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//-- НЕ УТКА
	|			ИЛИ ДД.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат)
	|		И СтатьиРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Период,
	|		ДД.ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаПродукции,
	|		ДД.СтатьяРасходовСписания,
	|		ДД.АналитикаРасходов,
	|		ДД.ПодразделениеРасходов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		Распределение.Подразделение КАК ПодразделениеРасходов,
	|		-СУММА(ДД.Знаменатель) КАК ДоляСтоимости,
	|		-СУММА(ДД.Стоимость) КАК Стоимость,
	|		-СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		0. КАК СуммаДопРасходов,
	|		0. КАК СуммаДопРасходовБезНДС,
	|		-СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|		-СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|		-СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В(&МассивОрганизаций)
	|		И ДД.Количество = 0
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ДД.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|		И СтатьиРасходов.ВариантРаспределенияРасходов <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаПродукции,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		Распределение.Подразделение
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		Распределение.Подразделение КАК ПодразделениеРасходов,
	|		-СУММА(ДД.Знаменатель) КАК ДоляСтоимости,
	|		-СУММА(ДД.Стоимость) КАК Стоимость,
	|		-СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		0. КАК СуммаДопРасходов,
	|		0. КАК СуммаДопРасходовБезНДС,
	|		-СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|		-СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|		-СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиАктивов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В(&МассивОрганизаций)
	|		И ДД.Количество = 0
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ДД.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаПродукции,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		Распределение.Подразделение
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ДД.ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|		ДД.СтатьяРасходовСписания КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов КАК АналитикаРасходов,
	|		ДД.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|		0. КАК ДоляСтоимости,
	|		0. КАК Стоимость,
	|		0. КАК СтоимостьБезНДС,
	|		СУММА(ДД.Стоимость) КАК СуммаДопРасходов,
	|		СУММА(ДД.СтоимостьБезНДС) КАК СуммаДопРасходовБезНДС,
	|		СУММА(
	|			ВЫБОР
	|				КОГДА ДД.АналитикаУчетаПартий.НалогообложениеНДС В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА
	|				ДД.СтоимостьРегл + ДД.НДСРегл 
	|			ИНАЧЕ
	|				ДД.СтоимостьРегл
	|			КОНЕЦ) КАК СтоимостьРегл,
	|		СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|		СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В(&МассивОрганизаций)
	|		И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ НЕ УТКА
	|			ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//-- НЕ УТКА
	|			ИЛИ ДД.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат)
	|		И СтатьиРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Период,
	|		ДД.ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаНоменклатуры,
	|		ДД.СтатьяРасходовСписания,
	|		ДД.АналитикаРасходов,
	|		ДД.ПодразделениеРасходов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		Распределение.Подразделение КАК ПодразделениеРасходов,
	|		0. КАК ДоляСтоимости,
	|		0. КАК Стоимость,
	|		0. КАК СтоимостьБезНДС,
	|		-СУММА(ДД.Стоимость) КАК СуммаДопРасходов,
	|		-СУММА(ДД.СтоимостьБезНДС) КАК СуммаДопРасходовБезНДС,
	|		-СУММА(
	|			ВЫБОР
	|				КОГДА ДД.АналитикаУчетаПартий.НалогообложениеНДС В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА
	|				ДД.СтоимостьРегл + ДД.НДСРегл 
	|			ИНАЧЕ
	|				ДД.СтоимостьРегл
	|			КОНЕЦ) КАК СтоимостьРегл,
	|		-СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|		-СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В(&МассивОрганизаций)
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ДД.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|		И СтатьиРасходов.ВариантРаспределенияРасходов <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.КорАналитикаУчетаНоменклатуры,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		Распределение.Подразделение
	|	) КАК Таб
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Таб.АналитикаУчетаПродукции = Аналитика.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО АналитикаБезНазначения.Номенклатура		= Аналитика.Номенклатура
	|		И АналитикаБезНазначения.Характеристика		= Аналитика.Характеристика
	|		И АналитикаБезНазначения.Серия				= Аналитика.Серия
	|		И АналитикаБезНазначения.Склад				= Аналитика.Склад
	|		И АналитикаБезНазначения.Назначение			= ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И АналитикаБезНазначения.СтатьяКалькуляции	= Аналитика.СтатьяКалькуляции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПрочиеРасходыНЗПДолиСтоимости КАК ДолиСтоимости
	|		ПО ДолиСтоимости.Период = Таб.Период
	|		И ДолиСтоимости.Регистратор = Таб.Регистратор
	|		И ДолиСтоимости.Организация = Таб.Организация
	|		И ДолиСтоимости.АналитикаУчетаПродукции = Таб.АналитикаУчетаПродукции
	|		И ДолиСтоимости.СтатьяРасходов = Таб.СтатьяРасходов
	|		И ДолиСтоимости.АналитикаРасходов = Таб.АналитикаРасходов
	|		И ДолиСтоимости.ПодразделениеРасходов = Таб.ПодразделениеРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.Период,
	|	Таб.ВидДвижения,
	|	Таб.Регистратор,
	|	Таб.Организация,
	|	Таб.АналитикаУчетаПродукции,
	|	ВЫБОР
	|		КОГДА Константы.УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|			ТОГДА Таб.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ,
	|	Таб.СтатьяРасходов,
	|	Таб.АналитикаРасходов,
	|	Таб.ПодразделениеРасходов,
	|	ДолиСтоимости.ДоляСтоимости
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	ИсходноеПодразделение,
	|	ВидДвижения УБЫВ,
	|	Регистратор,
	|	АналитикаУчетаПродукции,
	|	ДокументВыпуска,
	|	Порядок
	|";
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, ВидДвижения, АналитикаУчетаПродукции, СтатьяРасходов, АналитикаРасходов, ИсходноеПодразделение,
	|ДоляСтоимости, Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница");
	
	СтрокаПрихода = Новый Структура("
	|Организация, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности, ИсходноеПодразделение, КорПодразделение, ДокументДвижения, Период,
	|ДоляСтоимости, Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница");
	
	Суммы = Новый Структура("
	|Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС, СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница");

	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходыНезавершенногоПроизводства
	// - ПрочиеРасходы
	// - СебестоимостьТоваров
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			Если Выборка.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
				Если СтрокаПрихода.Организация <> Выборка.Организация
				 ИЛИ СтрокаПрихода.СтатьяРасходов <> Выборка.СтатьяРасходов
				 ИЛИ СтрокаПрихода.АналитикаРасходов <> Выборка.АналитикаРасходов
				 ИЛИ СтрокаПрихода.ИсходноеПодразделение <> Выборка.ИсходноеПодразделение Тогда
					ЗаполнитьЗначенияСвойств(СтрокаПрихода, Выборка);
					СтрокаПрихода.ДоляСтоимости			 = 0;
					СтрокаПрихода.Стоимость 			 = 0;
					СтрокаПрихода.СтоимостьБезНДС 		 = 0;
					СтрокаПрихода.СуммаДопРасходов 		 = 0;
					СтрокаПрихода.СуммаДопРасходовБезНДС = 0;
					СтрокаПрихода.СтоимостьРегл 		 = 0;
					СтрокаПрихода.ПостояннаяРазница 	 = 0;
					СтрокаПрихода.ВременнаяРазница 		 = 0;
				КонецЕсли;
				
			ИначеЕсли Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				Если СтрокаПрихода.Организация = Выборка.Организация
				 И СтрокаПрихода.СтатьяРасходов = Выборка.СтатьяРасходов
				 И СтрокаПрихода.АналитикаРасходов = Выборка.АналитикаРасходов
				 И СтрокаПрихода.ИсходноеПодразделение = Выборка.ИсходноеПодразделение Тогда
					СтрокаОстатка.ДоляСтоимости 		 = СтрокаОстатка.ДоляСтоимости - СтрокаПрихода.ДоляСтоимости;
					СтрокаОстатка.Стоимость 			 = СтрокаОстатка.Стоимость - СтрокаПрихода.Стоимость;
					СтрокаОстатка.СтоимостьБезНДС 		 = СтрокаОстатка.СтоимостьБезНДС - СтрокаПрихода.СтоимостьБезНДС;
					СтрокаОстатка.СуммаДопРасходов 		 = СтрокаОстатка.СуммаДопРасходов - СтрокаПрихода.СуммаДопРасходов;
					СтрокаОстатка.СуммаДопРасходовБезНДС = СтрокаОстатка.СуммаДопРасходовБезНДС - СтрокаПрихода.СуммаДопРасходовБезНДС;
					СтрокаОстатка.СтоимостьРегл 		 = СтрокаОстатка.СтоимостьРегл - СтрокаПрихода.СтоимостьРегл;
					СтрокаОстатка.ПостояннаяРазница 	 = СтрокаОстатка.ПостояннаяРазница - СтрокаПрихода.ПостояннаяРазница;
					СтрокаОстатка.ВременнаяРазница 		 = СтрокаОстатка.ВременнаяРазница - СтрокаПрихода.ВременнаяРазница;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.ВидДвижения = Выборка.ВидДвижения
		 И СтрокаОстатка.АналитикаУчетаПродукции = Выборка.АналитикаУчетаПродукции
		 И СтрокаОстатка.СтатьяРасходов = Выборка.СтатьяРасходов
		 И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
		 И СтрокаОстатка.ИсходноеПодразделение = Выборка.ИсходноеПодразделение Тогда
				
			Если СтрокаОстатка.ДоляСтоимости <> 0 Тогда
			 	Суммы.Стоимость 			 = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.Стоимость / СтрокаОстатка.ДоляСтоимости, 2, 1);
				Суммы.СтоимостьБезНДС 		 = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.СтоимостьБезНДС / СтрокаОстатка.ДоляСтоимости, 2, 1);
				Суммы.СуммаДопРасходов 		 = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.СуммаДопРасходов / СтрокаОстатка.ДоляСтоимости, 2, 1);
				Суммы.СуммаДопРасходовБезНДС = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.СуммаДопРасходовБезНДС / СтрокаОстатка.ДоляСтоимости, 2, 1);
				Суммы.СтоимостьРегл 		 = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.СтоимостьРегл / СтрокаОстатка.ДоляСтоимости, 2, 1);
				Суммы.ПостояннаяРазница 	 = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.ПостояннаяРазница / СтрокаОстатка.ДоляСтоимости, 2, 1);
				Суммы.ВременнаяРазница 		 = Окр(Выборка.ДоляСтоимости * СтрокаОстатка.ВременнаяРазница / СтрокаОстатка.ДоляСтоимости, 2, 1);
			Иначе
				Продолжить;
			КонецЕсли;
			
			СтрокаОстатка.ДоляСтоимости 		 = СтрокаОстатка.ДоляСтоимости - Выборка.ДоляСтоимости;
			СтрокаОстатка.Стоимость 			 = СтрокаОстатка.Стоимость - Суммы.Стоимость;
			СтрокаОстатка.СтоимостьБезНДС 		 = СтрокаОстатка.СтоимостьБезНДС - Суммы.СтоимостьБезНДС;
			СтрокаОстатка.СуммаДопРасходов 		 = СтрокаОстатка.СуммаДопРасходов - Суммы.СуммаДопРасходов;
			СтрокаОстатка.СуммаДопРасходовБезНДС = СтрокаОстатка.СуммаДопРасходовБезНДС - Суммы.СуммаДопРасходовБезНДС;
			СтрокаОстатка.СтоимостьРегл 		 = СтрокаОстатка.СтоимостьРегл - Суммы.СтоимостьРегл;
			СтрокаОстатка.ПостояннаяРазница 	 = СтрокаОстатка.ПостояннаяРазница - Суммы.ПостояннаяРазница;
			СтрокаОстатка.ВременнаяРазница 		 = СтрокаОстатка.ВременнаяРазница - Суммы.ВременнаяРазница;
			
			Если Выборка.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
				СтрокаПрихода.ДокументДвижения       = Выборка.ДокументИсточник;
				СтрокаПрихода.НаправлениеДеятельности= Выборка.НаправлениеДеятельности;
				СтрокаПрихода.ДоляСтоимости 		 = СтрокаПрихода.ДоляСтоимости + Выборка.ДоляСтоимости;
				СтрокаПрихода.Стоимость 			 = СтрокаПрихода.Стоимость + Суммы.Стоимость;
				СтрокаПрихода.СтоимостьБезНДС 		 = СтрокаПрихода.СтоимостьБезНДС + Суммы.СтоимостьБезНДС;
				СтрокаПрихода.СуммаДопРасходов 		 = СтрокаПрихода.СуммаДопРасходов + Суммы.СуммаДопРасходов;
				СтрокаПрихода.СуммаДопРасходовБезНДС = СтрокаПрихода.СуммаДопРасходовБезНДС + Суммы.СуммаДопРасходовБезНДС;
				СтрокаПрихода.СтоимостьРегл 		 = СтрокаПрихода.СтоимостьРегл + Суммы.СтоимостьРегл;
				СтрокаПрихода.ПостояннаяРазница 	 = СтрокаПрихода.ПостояннаяРазница + Суммы.ПостояннаяРазница;
				СтрокаПрихода.ВременнаяРазница 		 = СтрокаПрихода.ВременнаяРазница + Суммы.ВременнаяРазница;				
			КонецЕсли;
			
			ЕстьНенулеваяСумма =
				Суммы.Стоимость <> 0 ИЛИ Суммы.СтоимостьБезНДС <> 0
				ИЛИ Суммы.СуммаДопРасходов <> 0 ИЛИ Суммы.СуммаДопРасходовБезНДС <> 0 
				ИЛИ Суммы.СтоимостьРегл <> 0 ИЛИ Суммы.ПостояннаяРазница <> 0 ИЛИ Суммы.ВременнаяРазница <> 0;
			
			Если ЕстьНенулеваяСумма Тогда
				
				СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, Выборка, Суммы);
				Если Выборка.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
					СформироватьПриходПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, Выборка, Суммы);
				КонецЕсли;
				
				Если Выборка.ВидДвижения = ВидДвиженияНакопления.Расход
				 И ЗначениеЗаполнено(Выборка.РазделУчета) И НЕ Выборка.ЭтоЗаказДавальца	Тогда
				 
				 	СформироватьДвиженияСебестоимостьТоваровСписаниеНЗП(ПараметрыРасчета, Выборка, Суммы);
					
				КонецЕсли;
					
				Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
					Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						СформироватьДвиженияПрочиеРасходыСписаниеНЗП(ПараметрыРасчета, Выборка, Суммы);
					Иначе
						СформироватьДвиженияПрочиеРасходыСписаниеНЗП(ПараметрыРасчета, СтрокаПрихода, Суммы);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
			
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ПрочиеРасходыНЗПДолиСтоимости");
	
КонецПроцедуры

// Этап 2.4
Процедура СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводстваПоФИФОСкользящая(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводстваПоФИФОСкользящая");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Регистратор КАК ДокументДвижения,
	|	Партии.Организация,
	|	Партии.СтатьяРасходовПолучатель,
	|	Партии.АналитикаРасходовПолучатель,
	|	Партии.СтатьяАктивовПассивов,
	|	Партии.АналитикаАктивовПассивов,
	|	Партии.НаправлениеДеятельности,
	|	Партии.НаправлениеДеятельностиПолучатель,
	|	Партии.Подразделение,
	|	Партии.СтатьяРасходов,
	|	Партии.АналитикаРасходов,
	|	Партии.ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	СУММА(Партии.Стоимость) КАК Стоимость,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.СтатьяРасходовСписания КАК СтатьяРасходовПолучатель,
	|		ДД.АналитикаРасходов КАК АналитикаРасходовПолучатель,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|		Распределение.Подразделение,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		ДД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|		ДД.Стоимость,
	|		ДД.СтоимостьБезНДС,
	|		ДД.СтоимостьРегл,
	|		ДД.ПостояннаяРазница,
	|		ДД.ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|			И Распределение.Дата = ДД.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В (&МассивОрганизаций)
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяРасходовПолучатель,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаРасходовПолучатель,
	|		ДД.СтатьяРасходовСписания КАК СтатьяАктивовПассивов,
	|		ДД.АналитикаРасходов КАК АналитикаАктивовПассивов,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|		Распределение.Подразделение,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		ДД.ИдентификаторСтроки,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|		ДД.Стоимость,
	|		ДД.СтоимостьБезНДС,
	|		ДД.СтоимостьРегл,
	|		ДД.ПостояннаяРазница,
	|		ДД.ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|			И Распределение.Дата = ДД.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиАктивов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В (&МассивОрганизаций)
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		ДД.СтатьяРасходовСписания КАК СтатьяРасходовПолучатель,
	|		ДД.АналитикаРасходов КАК АналитикаРасходовПолучатель,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|		Распределение.Подразделение,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		"""",
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|		ДД.Стоимость,
	|		ДД.СтоимостьБезНДС,
	|		ДД.СтоимостьРегл,
	|		ДД.ПостояннаяРазница,
	|		ДД.ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|			И Распределение.Дата = ДД.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В (&МассивОрганизаций)
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Период,
	|		ДД.Регистратор,
	|		ДД.Организация,
	|		НЕОПРЕДЕЛЕНО КАК СтатьяРасходовПолучатель,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаРасходовПолучатель,
	|		ДД.СтатьяРасходовСписания КАК СтатьяАктивовПассивов,
	|		ДД.АналитикаРасходов КАК АналитикаАктивовПассивов,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Распределение.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|		Распределение.Подразделение,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов,
	|		"""",
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|		ДД.Стоимость,
	|		ДД.СтоимостьБезНДС,
	|		ДД.СтоимостьРегл,
	|		ДД.ПостояннаяРазница,
	|		ДД.ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|			ПО Распределение.Ссылка = ДД.Регистратор
	|			И Распределение.Дата = ДД.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивов
	|			ПО ДД.СтатьяРасходовСписания = СтатьиАктивов.Ссылка
	|	ГДЕ
	|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Активность
	|		И ДД.Организация В (&МассивОрганизаций)
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	) КАК Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.СтатьяРасходовПолучатель,
	|	Партии.АналитикаРасходовПолучатель,
	|	Партии.НаправлениеДеятельности,
	|	Партии.НаправлениеДеятельностиПолучатель,
	|	Партии.Подразделение,
	|	Партии.СтатьяРасходов,
	|	Партии.АналитикаРасходов,
	|	Партии.СтатьяАктивовПассивов,
	|	Партии.АналитикаАктивовПассивов,
	|	Партии.ИдентификаторСтроки
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		СформироватьДвиженияПрочиеРасходыПрочееСписаниеНЗП(ПараметрыРасчета, Выборка);
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

// Этап 2.5
Процедура ЗарегистрироватьСтоимостьФИФО(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимостьФИФО");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов						КАК ВидЗапасов,
	|	Себестоимость.Организация						КАК Организация,
	|	Себестоимость.РазделУчета						КАК РазделУчета,
	|	СУММА(Себестоимость.Количество)					КАК Количество,
	|	СУММА(Себестоимость.Стоимость)					КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)			КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СуммаДопРасходов)			КАК СтоимостьДопРасходы,
	|	СУММА(Себестоимость.СуммаДопРасходовБезНДС) 	КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл)				КАК СтоимостьРегл
	|ПОМЕСТИТЬ ВТСебестоимостьОборот
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	НЕ Себестоимость.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка		КАК ДокументДвижения,
	|	&НачалоПериода								КАК Период,
	|
	|	Себестоимость.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов					КАК ВидЗапасов,
	|	Себестоимость.Организация					КАК Организация,
	|	Себестоимость.РазделУчета					КАК РазделУчета,
	|
	|	ВЫРАЗИТЬ((Себестоимость.Стоимость / Себестоимость.Количество) КАК ЧИСЛО(23,10)) 				КАК Стоимость,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьБезНДС / Себестоимость.Количество) КАК ЧИСЛО(23,10)) 			КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьДопРасходы / Себестоимость.Количество) КАК ЧИСЛО(23,10)) 		КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьДопРасходыБезНДС / Себестоимость.Количество) КАК ЧИСЛО(23,10)) КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ((Себестоимость.СтоимостьРегл / Себестоимость.Количество) КАК ЧИСЛО(23,10)) 			КАК СтоимостьРегл
	|ИЗ
	|	ВТСебестоимостьОборот КАК Себестоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя,
		Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,	"ВТСебестоимостьОборот");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 3.1
Процедура ВключитьИсключитьНДСВСтоимость(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимость");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов
	|ПОМЕСТИТЬ РасходыПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В(&МассивОрганизаций)
	|	И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|ИНДЕКСИРОВАТЬ ПО
	|	Партии.Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаПродукции КАК АналитикаУчетаНоменклатуры,
	|		РасходыПартий.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыПартий КАК РасходыПартий
	|			ПО РасходыПартий.Регистратор = Партии.Регистратор
	|			И РасходыПартий.Организация = Партии.Организация
	|			И РасходыПартий.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаПродукции
	|			И РасходыПартий.ДокументПоступления = Партии.ДокументВыпуска
	|			И РасходыПартий.СтатьяРасходовСписания = Партии.СтатьяРасходовСписания
	|			И РасходыПартий.АналитикаРасходов = Партии.АналитикаРасходов 
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.Партия КАК Партия,
	|		Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовАктивов КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.Количество,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|
	|	) КАК Партии
	|ГДЕ
	|	НЕ Партии.НалогообложениеПартии ЕСТЬ NULL
	|	И Партии.НалогообложениеПартии <> Партии.НалогообложениеНДС
	|	И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов КАК ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.АналитикаУчетаПартийПроизводства,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	//++ НЕ УТ
	|	ВЫБОР ЕСТЬNULL(ПартииТМЦВЭксплуатации.СпособПогашенияСтоимостиНУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	|	УчетСебестоимости.Регистратор КАК ДокументДвижения,
	|	ЛОЖЬ КАК ЭтоПередачаМеждуОрганизациями,
	|
	|	СУММА(УчетСебестоимости.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.Количество) КАК ИсходноеКоличество
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = УчетСебестоимости.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	//++ НЕ УТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ПередачиВЭксплуатацию
	|			ПО УчетСебестоимости.ДокументДвижения = ПередачиВЭксплуатацию.Ссылка
	|				И УчетСебестоимости.ИдентификаторСтроки = ПередачиВЭксплуатацию.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦВЭксплуатации
	|			ПО ПередачиВЭксплуатацию.ПартияТМЦВЭксплуатации = ПартииТМЦВЭксплуатации.Ссылка
	//-- НЕ УТ
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.АналитикаРасходов,
	|
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	//++ НЕ УТ
	|	ВЫБОР ЕСТЬNULL(ПартииТМЦВЭксплуатации.СпособПогашенияСтоимостиНУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	//-- НЕ УТ
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.АналитикаУчетаПартийПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартийПроизводства,
	//++ НЕ УТ
	|	ЛОЖЬ 		 КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	ЛОЖЬ 		 КАК ЭтоПередачаМеждуОрганизациями,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Партии.НДСРегл) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК ИсходноеКоличество
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад, Партия, АналитикаФинансовогоУчета,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов, КорОрганизация, АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ДокументДвижения, ИдентификаторСтроки, ВариантРаспределенияРасходов, ПринятиеКНалоговомуУчету, ГруппаПродукции, СписаниеПриПередачеНУ,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, НаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, СтоимостьРегл, НДСРегл,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, АналитикаУчетаПартийПроизводства,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл
	|");
	
	СуммыРаспределения = Новый Структура("
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, Партия, АналитикаФинансовогоУчета,
	|СтатьяРасходовСписания, АналитикаРасходов,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьЗабалансоваяРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница
	|");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.Партия = Выборка.Партия
			И СтрокаОстатка.АналитикаФинансовогоУчета = Выборка.АналитикаФинансовогоУчета
			И СтрокаОстатка.СтатьяРасходовСписания = Выборка.СтатьяРасходовСписания
			И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			
			Если ЗаписьРаспределения.СтоимостьРегл <> 0 Тогда
					
				// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
				Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета) Тогда
					
					// Накопим все движения по регистру, чтобы перед записью их можно было сохранить во временную таблицу
					СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения);
							
				КонецЕсли;
					
				// Корректировка списания товаров на затраты в регистре учет прочих расходов.
				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 //++ НЕ УТ
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставОС
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставНМА
				 //-- НЕ УТ
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании Тогда
				 
				 	СформироватьДвиженияПрочиеРасходы(
				 		ПараметрыРасчета,
						ЗаписьРаспределения,
						0,
						0,
						ЗаписьРаспределения.СтоимостьРегл,
						0,
						0,
						Ложь);
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "РасходыПартий, ВтПартии, ВтРегистраторы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.2
// Формирует временную таблицу ВТДопРасходов
//
Процедура РаспределитьРасходыНаСебестоимость(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьРасходыНаСебестоимость");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТДопРасходов");
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда 
		
		ТаблицаДопРасходов = ТаблицаРаспределенияРасходовНаСебестоимостьТоваров(ПараметрыРасчета);
		
		ТаблицаДопРасходов.Колонки.Удалить("Подразделение");
		ТаблицаДопРасходов.Колонки.Удалить("СтатьяРасходовСписания");
		ТаблицаДопРасходов.Колонки.Удалить("АналитикаРасходов");
		
		Запрос.УстановитьПараметр("ТаблицаДопРасходов", ТаблицаДопРасходов);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
		|	Таблица.ВидЗапасов                 КАК ВидЗапасов,
		|	Таблица.Организация                КАК Организация,
		|	Таблица.СуммаДопРасходов           КАК СуммаДопРасходов,
		|	Таблица.СуммаДопРасходовБезНДС     КАК СуммаДопРасходовБезНДС,
		|	Таблица.ДопРасходыРегл             КАК ДопРасходыРегл
		|
		|ПОМЕСТИТЬ ВТДопРасходов
		|
		|ИЗ
		|	&ТаблицаДопРасходов КАК Таблица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация
		|";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	0 КАК СуммаДопРасходов,
		|	0 КАК СуммаДопРасходовБезНДС,
		|	0 КАК ДопРасходыРегл
		|
		|ПОМЕСТИТЬ ВТДопРасходов
		|";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.3
// Выполняет корректировку стоимости возвратов от клиента прошлых периодов
//
Процедура СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьВозвратовПрошлыхПериодов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	СУММА(ДД.Количество) КАК Количество,
	|	МАКСИМУМ(Стоимости.Период) КАК Период
	|ПОМЕСТИТЬ СторноОтчетыКомиссионера
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПоКомиссииМеждуОрганизациями КАК Отчет
	|		ПО Отчет.Ссылка = ДД.Регистратор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК Стоимости
	|		ПО Стоимости.Период < &НачалоПериода
	|		И Стоимости.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Стоимости.РазделУчета = ДД.РазделУчета
	|		И Стоимости.ВидЗапасов = ДД.ВидЗапасов
	|		И Стоимости.Организация = ДД.Организация
	|ГДЕ
	|	НЕ ДД.СлужебноеВидДвиженияПриход
	|СГРУППИРОВАТЬ ПО
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация
	|ИМЕЮЩИЕ
	|	СУММА(ДД.Количество) < 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Себестоимость.ДокументИсточник КАК Ссылка
	|ПОМЕСТИТЬ ВтРеализацииПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Регистратор                         КАК Ссылка,
	|	Себестоимость.АналитикаУчетаНоменклатуры          КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                         КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                          КАК ВидЗапасов,
	|	Себестоимость.Организация               		  КАК Организация,
	|	Себестоимость.Партия                          	  КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета           КАК АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ                                             КАК ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.Количество)                   КАК Количество,
	|	СУММА(Себестоимость.Стоимость)                    КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)              КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)        КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.СуммаДопРасходов)             КАК СуммаДопРасходов,
	|	СУММА(Себестоимость.СуммаДопРасходовБезНДС)       КАК СуммаДопРасходовБезНДС,
	|	СУММА(Себестоимость.Трудозатраты)       		  КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеСНДС)       		  КАК ПостатейныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеБезНДС)       	  КАК ПостатейныеБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл)                КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)    КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница)            КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)             КАК ВременнаяРазница,
	|	СУММА(Себестоимость.ДопРасходыРегл)               КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл)             КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеРегл)              КАК ПостатейныеРегл
	|ПОМЕСТИТЬ ВтСуммыРеализацийПрошлыхПериодов
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|		ПО Продажи.Ссылка = Себестоимость.Регистратор
	|ГДЕ
	|	Себестоимость.Период < &НачалоПериода
	|	И Себестоимость.Организация В(&МассивОрганизаций)
	|	И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Себестоимость.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Период                              КАК Период,
	|	ВЫБОР КОГДА Себестоимость.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   						  КАК ВидДвижения,
	|	Себестоимость.АналитикаУчетаНоменклатуры          КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                         КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                          КАК ВидЗапасов,
	|	Себестоимость.ВидЗапасов.ТипЗапасов               КАК ТипЗапасов,
	|	Себестоимость.Партия                          	  КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета           КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС                  КАК ВидДеятельностиНДС,
	|
	// В кор. части могут быть данные об исходной аналитике продажи (если возврат идет на другой склад)
	|	ВЫБОР КОГДА Себестоимость.КорВидЗапасов <> Значение(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорВидЗапасов
	|		ИНАЧЕ
	|			Себестоимость.ВидЗапасов
	|	КОНЕЦ                                             КАК ВидыЗапасовДляЦены,
	// В кор. части могут быть данные об исходном виде запасов продажи (в случае возврата проданного по Интеркампани товара)
	|	ВЫБОР КОГДА Себестоимость.КорАналитикаУчетаНоменклатуры <> Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			Себестоимость.АналитикаУчетаНоменклатуры
	|	КОНЕЦ                                             КАК АналитикаНоменклатурыДляЦены,
	|
	|	СУММА(Себестоимость.Количество)                   КАК Количество,
	|
	|	СУММА(Себестоимость.Стоимость)                    КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)              КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)        КАК СтоимостьЗабалансовая,
	|
	|	СУММА(Себестоимость.СуммаДопРасходов)             КАК СуммаДопРасходов,
	|	СУММА(Себестоимость.СуммаДопРасходовБезНДС)       КАК СуммаДопРасходовБезНДС,
	|	СУММА(Себестоимость.Трудозатраты)       		  КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеСНДС)       		  КАК ПостатейныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеБезНДС)       	  КАК ПостатейныеБезНДС,
	|
	|	СУММА(Себестоимость.СтоимостьРегл)                КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)    КАК СтоимостьЗабалансоваяРегл,
	|
	|	СУММА(Себестоимость.ПостояннаяРазница)            КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)             КАК ВременнаяРазница,
	|
	|	СУММА(Себестоимость.ДопРасходыРегл)               КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл)             КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеРегл)              КАК ПостатейныеРегл,
	|
	|	Себестоимость.ХозяйственнаяОперация               КАК ХозяйственнаяОперация,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры       КАК КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.КорРазделУчета                      КАК КорРазделУчета,
	|	Себестоимость.КорВидЗапасов                       КАК КорВидЗапасов,
	|	Себестоимость.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
	|	Себестоимость.ЗаказКлиента                        КАК ЗаказКлиента,
	|	Себестоимость.Подразделение                       КАК Подразделение,
	|	Себестоимость.Организация                         КАК Организация,
	|	Себестоимость.КорОрганизация                      КАК КорОрганизация,
	|	Себестоимость.ПериодПродажи                       КАК ПериодПродажи,
	|	ЕСТЬNULL(СторноОтчетыКомиссионера.Период,
	|		НАЧАЛОПЕРИОДА(Себестоимость.ПериодПродажи, МЕСЯЦ)) КАК ПериодРеализации,
	|	Себестоимость.АналитикаРасходов                   КАК АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания              КАК СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов                       КАК СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов                    КАК АналитикаДоходов,
	|	Себестоимость.ГруппаПродукции                     КАК ГруппаПродукции,
	|	Себестоимость.Регистратор                         КАК ДокументДвижения,
	|	Себестоимость.ИдентификаторСтроки                 КАК ИдентификаторСтроки,
	|	Себестоимость.КорПартия                 		  КАК КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий             КАК КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаФинансовогоУчета        КАК КорАналитикаФинансовогоУчета,
	|	Себестоимость.КорВидДеятельностиНДС               КАК КорВидДеятельностиНДС,
	|	Себестоимость.НДСРегл                 			  КАК НДСРегл,
	|	Себестоимость.СтатьяКалькуляции                   КАК СтатьяКалькуляции,
	|	Себестоимость.ТипЗаписи                 		  КАК ТипЗаписи,
	|	Себестоимость.ДокументИсточник                 	  КАК ДокументИсточник,
	|	Возврат.Соглашение                                КАК Соглашение,
	|	ЕСТЬNULL(Возврат.Менеджер, ВозвратМеждуОрганизациями.Менеджер) КАК Менеджер,
	|	ЕСТЬNULL(Возврат.Склад, ВозвратМеждуОрганизациями.Склад) КАК Склад,
	|	ЕСТЬNULL(Возврат.Договор, ВозвратМеждуОрганизациями.Договор) КАК Договор,
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ											  КАК ПоЦенеПродажи
	|ПОМЕСТИТЬ ВтВозвратыПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Себестоимость.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратМеждуОрганизациями
	|		ПО ВозвратМеждуОрганизациями.Ссылка = Себестоимость.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ СторноОтчетыКомиссионера КАК СторноОтчетыКомиссионера
	|		ПО СторноОтчетыКомиссионера.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И СторноОтчетыКомиссионера.РазделУчета = Себестоимость.РазделУчета
	|		И СторноОтчетыКомиссионера.ВидЗапасов = Себестоимость.ВидЗапасов
	|		И СторноОтчетыКомиссионера.Организация = Себестоимость.Организация
	|ГДЕ
	|	(Себестоимость.СлужебноеВидДвиженияПриход
	|		И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов))
	|	ИЛИ (Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		И НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL)
	|	И НЕ Себестоимость.РасчетСебестоимости
	|	
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	ВЫБОР КОГДА Себестоимость.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.ВидЗапасов.ТипЗапасов,
	|	Себестоимость.Подразделение,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	ВЫБОР КОГДА Себестоимость.КорАналитикаУчетаНоменклатуры <> Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		ТОГДА Себестоимость.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ Себестоимость.АналитикаУчетаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА Себестоимость.КорВидЗапасов <> Значение(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорВидЗапасов
	|		ИНАЧЕ
	|			Себестоимость.ВидЗапасов
	|	КОНЕЦ,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	Себестоимость.ХозяйственнаяОперация,
	|	Себестоимость.КорРазделУчета,
	|	Себестоимость.КорВидЗапасов,
	|	Себестоимость.ПериодПродажи,
	|	ЕСТЬNULL(СторноОтчетыКомиссионера.Период,
	|		НАЧАЛОПЕРИОДА(Себестоимость.ПериодПродажи, МЕСЯЦ)),
	|	Себестоимость.Организация,
	|	Себестоимость.КорОрганизация,
	|	Себестоимость.АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов,
	|	Себестоимость.ГруппаПродукции,
	|	Себестоимость.Регистратор,
	|	Себестоимость.ИдентификаторСтроки,
	|	Себестоимость.КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаФинансовогоУчета,
	|	Себестоимость.КорВидДеятельностиНДС,
	|	Себестоимость.НДСРегл,
	|	Себестоимость.СтатьяКалькуляции,
	|	Себестоимость.ТипЗаписи,
	|	Себестоимость.ДокументИсточник,
	|	Возврат.Соглашение,
	|	ЕСТЬNULL(Возврат.Менеджер, ВозвратМеждуОрганизациями.Менеджер),
	|	ЕСТЬNULL(Возврат.Склад, ВозвратМеждуОрганизациями.Склад),
	|	ЕСТЬNULL(Возврат.Договор, ВозвратМеждуОрганизациями.Договор),
	|	ВЫБОР КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период                        КАК Период,
	|	ТаблицаВозвратов.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаВозвратов.Организация                   КАК Организация,
	|	ТаблицаВозвратов.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаВозвратов.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаВозвратов.РазделУчета                   КАК РазделУчета,
	|	ТаблицаВозвратов.ВидЗапасов                    КАК ВидЗапасов,
	|	ТаблицаВозвратов.Партия                        КАК Партия,
	|	ТаблицаВозвратов.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаВозвратов.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаВозвратов.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаВозвратов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаВозвратов.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаВозвратов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаВозвратов.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаВозвратов.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ТаблицаВозвратов.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаВозвратов.ЗаказКлиента                  КАК ЗаказКлиента,
	|	ТаблицаВозвратов.Подразделение                 КАК Подразделение,
	|	ТаблицаВозвратов.ПериодРеализации              КАК ПериодРеализации,
	|	ТаблицаВозвратов.АналитикаДоходов              КАК АналитикаДоходов,
	|	ТаблицаВозвратов.СтатьяДоходов                 КАК СтатьяДоходов,
	|	ТаблицаВозвратов.АналитикаРасходов             КАК АналитикаРасходов,
	|	ТаблицаВозвратов.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	ТаблицаВозвратов.ГруппаПродукции               КАК ГруппаПродукции,
	|	Назначения.НаправлениеДеятельности             КАК НаправлениеДеятельности,
	|	Назначения.НаправлениеДеятельности             КАК КорНаправлениеДеятельности,
	//++ НЕ УТ
	|	ЛОЖЬ                                           КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	|	ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходов, НЕОПРЕДЕЛЕНО) КАК ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(СтатьиРасходов.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяАктивовПассивов,
	|	ТаблицаВозвратов.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО                                   КАК КодСтроки,
	|	ТаблицаВозвратов.Менеджер                      КАК Менеджер,
	|	ТаблицаВозвратов.Склад                         КАК Склад,
	|	ТаблицаВозвратов.Соглашение                    КАК Соглашение,
	|	ТаблицаВозвратов.Договор                       КАК Договор,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		ТаблицаВозвратов.ВидЗапасов
	|	ИНАЧЕ
	|		Аналитика.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ТаблицаВозвратов.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаВозвратов.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаВозвратов.КорПартия                     КАК КорПартия,
	|	ТаблицаВозвратов.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаВозвратов.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаВозвратов.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаВозвратов.НДСРегл                       КАК НДСРегл,
	|	ТаблицаВозвратов.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаВозвратов.ТипЗаписи                     КАК ТипЗаписи,
	|	ТаблицаВозвратов.ДокументИсточник              КАК ДокументИсточник,
	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаУчетаПартийПроизводства,
	|	ТаблицаВозвратов.Количество                    КАК Количество,
	|
	
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.Стоимость / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.Стоимость
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.Стоимость КАК ЧИСЛО(15, 2)) 							КАК Стоимость,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.СтоимостьБезНДС / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьБезНДС КАК ЧИСЛО(15, 2)) 					КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.СтоимостьЗабалансовая / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансовая
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьЗабалансовая КАК ЧИСЛО(15, 2)) 				КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.СуммаДопРасходов / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходы
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СуммаДопРасходов КАК ЧИСЛО(15, 2)) 					КАК СуммаДопРасходов,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.СуммаДопРасходовБезНДС / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходыБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СуммаДопРасходовБезНДС КАК ЧИСЛО(15, 2)) 			КАК СуммаДопРасходовБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.Трудозатраты / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.Трудозатраты
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.Трудозатраты КАК ЧИСЛО(15, 2)) 						КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ПостатейныеСНДС / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеСНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеСНДС КАК ЧИСЛО(15, 2)) 					КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ПостатейныеБезНДС / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеБезНДС КАК ЧИСЛО(15, 2)) 					КАК ПостатейныеБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.СтоимостьРегл / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьРегл КАК ЧИСЛО(15, 2)) 						КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.СтоимостьЗабалансоваяРегл / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьЗабалансоваяРегл КАК ЧИСЛО(15, 2)) 			КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ПостояннаяРазница / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостояннаяРазница
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостояннаяРазница КАК ЧИСЛО(15, 2)) 					КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ВременнаяРазница / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ВременнаяРазница
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ВременнаяРазница КАК ЧИСЛО(15, 2)) 					КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ДопРасходыРегл / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ДопРасходыРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыРегл КАК ЧИСЛО(15, 2)) 					КАК ДопРасходыРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ТрудозатратыРегл / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ТрудозатратыРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ТрудозатратыРегл КАК ЧИСЛО(15, 2)) 					КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи
	|			ТОГДА СтоимостиПродаж.ПостатейныеРегл / СтоимостиПродаж.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеРегл КАК ЧИСЛО(15, 2)) 					КАК ПостатейныеРегл
	|ИЗ
	|	ВтВозвратыПрошлыхПериодов КАК ТаблицаВозвратов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыРеализацийПрошлыхПериодов КАК СтоимостиПродаж
	|		ПО ТаблицаВозвратов.ДокументИсточник          		= СтоимостиПродаж.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостиПродаж.АналитикаУчетаНоменклатуры
	|			И ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостиПродаж.ВидЗапасов
	|			И ТаблицаВозвратов.Организация               	= СтоимостиПродаж.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостиПродаж.РазделУчета
	|			И ТаблицаВозвратов.Партия               		= СтоимостиПродаж.Партия
	|			И ТаблицаВозвратов.АналитикаУчетаПартий         = СтоимостиПродаж.АналитикаУчетаПартий
	|			И ТаблицаВозвратов.АналитикаФинансовогоУчета    = СтоимостиПродаж.АналитикаФинансовогоУчета
	|			И ТаблицаВозвратов.ВидДеятельностиНДС           = СтоимостиПродаж.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьТоваров
	|		ПО ТаблицаВозвратов.ПериодРеализации          		= СтоимостьТоваров.Период
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостьТоваров.АналитикаУчетаНоменклатуры
	|			И ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостьТоваров.ВидЗапасов
	|			И ТаблицаВозвратов.Организация               	= СтоимостьТоваров.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостьТоваров.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО ТаблицаВозвратов.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТаблицаВозвратов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|
	|ГДЕ
	|	(ТаблицаВозвратов.ПоЦенеПродажи И СтоимостиПродаж.Ссылка ЕСТЬ НЕ NULL)
	|		ИЛИ (НЕ ТаблицаВозвратов.ПоЦенеПродажи И СтоимостьТоваров.Период ЕСТЬ НЕ NULL)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Подготовим таблицу значений для переноса во временную таблицу ВТВозвраты
	//  - в случае предварительного расчета движения с/с не пишутся в регистр - сохраняются только в этой ВТ
	//  - при окончательном расчете движения будут в регистре, а эта ВТ будет пустой
	ОписаниеРегистраСебестоимость = ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя];
	
	ПоляТаблицыВозвратов =
		"ВидДвижения, СлужебноеВидДвиженияПриход, Организация, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов,
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, "
		+ СтрЗаменить(ОписаниеРегистраСебестоимость.РесурсыРегистра, "%1", "");
	
	ТаблицаВозвратов = ОписаниеРегистраСебестоимость.Таблица.СкопироватьКолонки(ПоляТаблицыВозвратов);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ВыручкаИСебестоимостьПродаж
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда

		// Корректировка стоимости.
		Пока Выборка.Следующий() Цикл
			
			// Накопим новые движения себестоимости в таблице значений
			СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, Выборка, Выборка.ВидДвижения);

			Если Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы Тогда
				
				СформироватьДвиженияВыручкаИСебестоимостьПродажВозврат(ПараметрыРасчета, Выборка);
				
			КонецЕсли;

			// Формирование прочих доходов/расходов при возврате тары от клиента
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов
			 И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
				
				СуммаПереоценки = Выборка.Стоимость + Выборка.СуммаДопРасходов + Выборка.Трудозатраты + Выборка.ПостатейныеСНДС;
				
				Если СуммаПереоценки < 0 Тогда 

					СформироватьДвиженияПрочиеРасходы(
						ПараметрыРасчета,
						Выборка,
						СуммаПереоценки,
						Выборка.СтоимостьБезНДС + Выборка.СуммаДопРасходовБезНДС + Выборка.Трудозатраты + Выборка.ПостатейныеБезНДС,
						Выборка.СтоимостьРегл + Выборка.ДопРасходыРегл + Выборка.ТрудозатратыРегл + Выборка.ПостатейныеРегл,
						Выборка.ПостояннаяРазница,
						Выборка.ВременнаяРазница);

				ИначеЕсли СуммаПереоценки > 0 Тогда

					СформироватьДвиженияПрочиеДоходы(
						ПараметрыРасчета,
						Выборка,
						СуммаПереоценки);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
			 И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
				
				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					Выборка.Стоимость + Выборка.СуммаДопРасходов + Выборка.Трудозатраты + Выборка.ПостатейныеСНДС,
					Выборка.СтоимостьБезНДС + Выборка.СуммаДопРасходовБезНДС + Выборка.Трудозатраты + Выборка.ПостатейныеБезНДС,
					Выборка.СтоимостьРегл + Выборка.ДопРасходыРегл + Выборка.ТрудозатратыРегл + Выборка.ПостатейныеРегл,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);
				
			КонецЕсли;
			
			Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
			 И Выборка.Количество < 0 Тогда
				
				СтрокаВозврата = ТаблицаВозвратов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, Выборка);
				
				СтрокаВозврата.СлужебноеВидДвиженияПриход = Истина;
				СтрокаВозврата.Количество 			  	  = - Выборка.Количество;
				СтрокаВозврата.Стоимость 			  	  = - Выборка.Стоимость;
				СтрокаВозврата.СтоимостьБезНДС 		  	  = - Выборка.СтоимостьБезНДС;
				СтрокаВозврата.СтоимостьЗабалансовая      = - Выборка.СтоимостьЗабалансовая;
				СтрокаВозврата.СуммаДопРасходов 	  	  = - Выборка.СуммаДопРасходов;
				СтрокаВозврата.СуммаДопРасходовБезНДС 	  = - Выборка.СуммаДопРасходовБезНДС;
				СтрокаВозврата.Трудозатраты 			  = - Выборка.Трудозатраты;
				СтрокаВозврата.ПостатейныеСНДС 			  = - Выборка.ПостатейныеСНДС;
				СтрокаВозврата.ПостатейныеБезНДС 		  = - Выборка.ПостатейныеБезНДС;
				СтрокаВозврата.СтоимостьРегл 		  	  = - Выборка.СтоимостьРегл;
				СтрокаВозврата.СтоимостьЗабалансоваяРегл  = - Выборка.СтоимостьЗабалансоваяРегл;
				СтрокаВозврата.ДопРасходыРегл             = - Выборка.ДопРасходыРегл;
				СтрокаВозврата.ТрудозатратыРегл           = - Выборка.ТрудозатратыРегл;
				СтрокаВозврата.ПостатейныеРегл            = - Выборка.ПостатейныеРегл;
				СтрокаВозврата.ПостояннаяРазница 	  	  = - Выборка.ПостояннаяРазница;
				СтрокаВозврата.ВременнаяРазница 	  	  = - Выборка.ВременнаяРазница;
				
			КонецЕсли;
			
			// Корректировка движений по оборотным регистрам управленческого учета.
			СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);
			
		КонецЦикла;
		
	Иначе // предварительный расчет
		
		// Соберем движения себестоимости в таблице значений, подобно СформироватьДвиженияСебестоимостьТоваров()
		Пока Выборка.Следующий() Цикл
			НовСтр = ТаблицаВозвратов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;
		
		ТаблицаВозвратов.ЗаполнитьЗначения(Истина, "СлужебноеВидДвиженияПриход");
		ТаблицаВозвратов.ЗаполнитьЗначения(0,	   "Количество");
		
		Если ПараметрыРасчета.РегламентноеЗадание Тогда
			
			// Считаем по средней, без учета партий
			ТаблицаВозвратов.ЗаполнитьЗначения(Неопределено,
				"Партия,  АналитикаФинансовогоУчета, АналитикаУчетаПартий, ВидДеятельностиНДС");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Сохраним таблицу возвратов в общем менеджере временных таблиц
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТВозвраты");
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		ПараметрыРасчета,
		"ВТВозвраты",
		ТаблицаВозвратов,
		ПоляТаблицыВозвратов);
	
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтРеализацииПрошлыхПериодов, ВтСуммыРеализацийПрошлыхПериодов, ВтВозвратыПрошлыхПериодов");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 3.4
// Формирует временные таблицы ВтАналитикаУчетаРасходов, ВтНезавершенноеПроизводство
//
Процедура РаспределитьПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьПрочиеРасходыНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доли.Организация,
	|	СУММА(Доли.ДоляРасходовНаРекламу) КАК ДоляРасходовНаРекламу,
	|	СУММА(Доли.ДоляПредставительскихРасходов) КАК ДоляПредставительскихРасходов,
	|	СУММА(Доли.ДоляРасходовНаДобровольноеМедицинскоеСтрахование) КАК ДоляРасходовНаДобровольноеМедицинскоеСтрахование,
	|	СУММА(Доли.ДоляРасходовНаДобровольноеСтрахованиеЖизни) КАК ДоляРасходовНаДобровольноеСтрахованиеЖизни,
	|	СУММА(Доли.ДоляРасходовНаДобровольноеСтрахованиеОтНесчастныхСлучаев) КАК ДоляРасходовНаДобровольноеСтрахованиеОтНесчастныхСлучаев,
	|	СУММА(Доли.ДоляРасходовНаВозмещениеПроцентовРаботникам) КАК ДоляРасходовНаВозмещениеПроцентовРаботникам
	|ПОМЕСТИТЬ
	|	ДолиСписанияКосвенныхРасходов
	|ИЗ
	|	РегистрСведений.ДолиСписанияКосвенныхРасходов КАК Доли
	|ГДЕ
	|	Доли.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Доли.Организация В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ГоловнаяОрганизация ИЗ Справочник.Организации КАК Т ГДЕ Т.Ссылка В (&МассивОрганизаций))
	|	И Доли.Активность
	|СГРУППИРОВАТЬ ПО
	|	Доли.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	СУММА(ДД.Сумма) КАК Сумма,
	|	СУММА(ДД.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ДД.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|ПОМЕСТИТЬ
	|	втСуммыРасходов
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СуммаОстаток КАК Сумма,
	|		ДД.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|		ДД.СуммаРеглОстаток КАК СуммаРегл,
	|		ДД.ПостояннаяРазницаОстаток КАК ПостояннаяРазница,
	|		ДД.ВременнаяРазницаОстаток КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходы.Остатки(&ГраницаКонецПредыдущегоПериода,
	|			&ПартионныйУчетВерсии22
	|			И Организация В (&МассивОрганизаций)
	|		) КАК ДД
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.Сумма КАК Сумма,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаБезНДС КАК СуммаБезНДС,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаРегл КАК СуммаРегл,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ВременнаяРазница КАК ВременнаяРазница
	|	ИЗ
	|		ВТКэшПрочиеРасходы КАК ДД
	|	ГДЕ
	|		НЕ ДД.РасчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ВЫБОР КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.Сумма КАК Сумма,
	|		ВЫБОР КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаБезНДС КАК СуммаБезНДС,
	|		ВЫБОР КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаРегл КАК СуммаРегл,
	|		ВЫБОР КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ВременнаяРазница КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДД.Организация В(&МассивОрганизаций)
	|		И НЕ ДД.РасчетСебестоимости
	|		И ДД.Активность
	|	) КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Сумма КАК Сумма,
	|	ДД.СуммаБезНДС КАК СуммаБезНДС,
	|	ДД.СуммаРегл КАК СуммаРегл,
	|	ВЫБОР
	|		КОГДА СР.ВидРасходов В (&МассивНормируемыхРасходов) // Косвенные расходы
	|				ИЛИ СР.КосвенныеЗатратыНУ
	|			ТОГДА ВЫБОР
	|					КОГДА СР.ВидРасходов В (&МассивНормируемыхРасходов) ТОГДА // Нормируемые расходы
	|						ВЫБОР СР.ВидРасходов
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РасходыНаРекламуНормируемые)
	|								ТОГДА (ДД.СуммаРегл - ДД.ПостояннаяРазница
	|									  - ДД.ВременнаяРазница) * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаРекламу, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы)
	|								ТОГДА (ДД.СуммаРегл - ДД.ПостояннаяРазница
	|									  - ДД.ВременнаяРазница) * (1 - ЕСТЬNULL(ДолиСписания.ДоляПредставительскихРасходов, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование)
	|								ТОГДА (ДД.СуммаРегл - ДД.ПостояннаяРазница
	|									  - ДД.ВременнаяРазница) * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаДобровольноеМедицинскоеСтрахование, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников)
	|								ТОГДА (ДД.СуммаРегл - ДД.ПостояннаяРазница
	|									  - ДД.ВременнаяРазница) * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаДобровольноеСтрахованиеЖизни, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности)
	|								ТОГДА(ДД.СуммаРегл - ДД.ПостояннаяРазница
	|									  - ДД.ВременнаяРазница) * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаДобровольноеСтрахованиеОтНесчастныхСлучаев, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов)
	|								ТОГДА (ДД.СуммаРегл - ДД.ПостояннаяРазница
	|									  - ДД.ВременнаяРазница) * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаВозмещениеПроцентовРаботникам, 0))
	|						КОНЕЦ
	|					ИНАЧЕ
	|						ДД.ПостояннаяРазница
	|				 КОНЕЦ
	|		ИНАЧЕ ДД.ПостояннаяРазница
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	ВЫБОР
	|		КОГДА СР.ВидРасходов В (&МассивНормируемыхРасходов) // Косвенные расходы
	|				ИЛИ СР.КосвенныеЗатратыНУ
	|			ТОГДА ВЫБОР
	|					КОГДА СР.ВидРасходов В (&МассивНормируемыхРасходов) ТОГДА // Нормируемые расходы
	|						ВЫБОР СР.ВидРасходов
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РасходыНаРекламуНормируемые)
	|								ТОГДА ДД.СуммаРегл - (ДД.СуммаРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)
	|									  * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаРекламу, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы)
	|								ТОГДА ДД.СуммаРегл - (ДД.СуммаРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)
	|									  * (1 - ЕСТЬNULL(ДолиСписания.ДоляПредставительскихРасходов, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование)
	|								ТОГДА ДД.СуммаРегл - (ДД.СуммаРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)
	|									  * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаДобровольноеМедицинскоеСтрахование, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников)
	|								ТОГДА ДД.СуммаРегл - (ДД.СуммаРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)
	|									  * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаДобровольноеСтрахованиеЖизни, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности)
	|								ТОГДА ДД.СуммаРегл - (ДД.СуммаРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)
	|									  * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаДобровольноеСтрахованиеОтНесчастныхСлучаев, 0))
	|							КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов)
	|								ТОГДА ДД.СуммаРегл - (ДД.СуммаРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)
	|									  * (1 - ЕСТЬNULL(ДолиСписания.ДоляРасходовНаВозмещениеПроцентовРаботникам, 0))
	|						КОНЕЦ
	|					ИНАЧЕ
	|						(ДД.СуммаРегл - ДД.ПостояннаяРазница)
	|				 КОНЕЦ
	|		ИНАЧЕ ДД.ВременнаяРазница
	|	КОНЕЦ КАК ВременнаяРазница
	|ПОМЕСТИТЬ
	|	СуммыРасходов
	|ИЗ
	|	втСуммыРасходов КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДолиСписанияКосвенныхРасходов КАК ДолиСписания
	|		ПО ДолиСписания.Организация = ДД.Организация.ГоловнаяОрганизация
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СР
	|		ПО СР.Ссылка = ДД.СтатьяРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.ПартияПроизводства                    КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                   КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                    КАК КодСтрокиПродукция,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ВыпускПродукции 
	|			ТОГДА ДД.ЗаказНаПроизводство
	//++ НЕ УТКА
	|		ИНАЧЕ МаршрутныйЛист.Ссылка
	//-- НЕ УТКА
	|	КОНЕЦ)                                   КАК ИдентификаторПартии
	|ПОМЕСТИТЬ ИдентификаторыПартий
	|ИЗ
	|	ПартииДляОтнесенияРасходов КАК ДД
	//++ НЕ УТКА
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛист
	|		ПО ДД.ЗаказНаПроизводство = МаршрутныйЛист.Распоряжение
	|		И ДД.КодСтрокиПродукция = МаршрутныйЛист.КодСтроки
	//-- НЕ УТКА
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция
	|
	|;
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация                                 КАК Организация,
	|	МАКСИМУМ(ДД.Регистратор)                       КАК Регистратор,
	|	ДД.Подразделение                               КАК Подразделение,
	|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
	|	ДД.АналитикаУчетаПартийПроизводства            КАК АналитикаУчетаПартийПроизводства,
	|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
	|	ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
	|	ДД.СтатьяРасходов                              КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                           КАК АналитикаРасходов,
	|	ДД.ГруппаПродукции                             КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск
	|ПОМЕСТИТЬ ПартииДляОтнесенияРасходовСводно
	|ИЗ
	|	ПартииДляОтнесенияРасходов КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ПартияПроизводства,
	|	ДД.АналитикаУчетаПартийПроизводства,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.СтатьяКалькуляции,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДД.Организация                                   КАК Организация,
	|	ДД.ПартияПроизводства                            КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                           КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                            КАК КодСтрокиПродукция,
	|	ДД.Подразделение                                 КАК Подразделение,
	|	ДД.СтатьяРасходов                                КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                             КАК АналитикаРасходов,
	|	ДД.СтатьяКалькуляции                             КАК СтатьяКалькуляции,
	|	ДД.ГруппаПродукции                               КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                      КАК ПравилоОтнесенияНаВыпуск,
	|	ДД.СтоимостьОстаток                              КАК СтоимостьОстаток,
	|	ДД.СтоимостьБезНДСОстаток                        КАК СтоимостьБезНДСОстаток,
	|	ДД.СтоимостьРеглОстаток                          КАК СтоимостьРеглОстаток,
	|	ДД.ПостояннаяРазницаОстаток                      КАК ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток                       КАК ВременнаяРазницаОстаток,
	|	ДД.ДоляСтоимостиОстаток                          КАК ДоляСтоимостиОстаток,
	|	ДД.ПоказательОтнесенияНаВыпускОстаток            КАК ПоказательОтнесенияНаВыпускОстаток
	|ПОМЕСТИТЬ ПрочиеРасходыНезавершенногоПроизводстваОстатки
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(&НачалоПериода,
	|		Организация В (&МассивОрганизаций) И &ПартионныйУчетВерсии22) КАК ДД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация                                   КАК Организация,
	|	ДД.Регистратор                                   КАК Регистратор,
	|	ИдентификаторыПартий.ИдентификаторПартии         КАК ИдентификаторПартии,
	|	ДД.Подразделение                                 КАК Подразделение,
	|	ЕСТЬNULL(Остатки.СтоимостьОстаток, 0)            КАК Стоимость,
	|	ЕСТЬNULL(Остатки.СтоимостьБезНДСОстаток, 0)      КАК СтоимостьБезНДС,
	|	ЕСТЬNULL(Остатки.СтоимостьРеглОстаток, 0)        КАК СтоимостьРегл,
	|	ЕСТЬNULL(Остатки.ПостояннаяРазницаОстаток, 0)    КАК ПостояннаяРазница,
	|	ЕСТЬNULL(Остатки.ВременнаяРазницаОстаток, 0)     КАК ВременнаяРазница,
	|	ЕСТЬNULL(Остатки.ДоляСтоимостиОстаток, 0)        КАК ДоляСтоимости,
	|	ЕСТЬNULL(Остатки.ПоказательОтнесенияНаВыпускОстаток, 0) КАК ПоказательОтнесенияНаВыпуск
	|ПОМЕСТИТЬ ВтОстаткиНезавершенногоПроизводства
	|ИЗ
	|	ПартииДляОтнесенияРасходовСводно КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПрочиеРасходыНезавершенногоПроизводстваОстатки КАК Остатки
	|		ПО ДД.Организация = Остатки.Организация
	|		И ДД.Подразделение = Остатки.Подразделение
	|		И ДД.ПартияПроизводства = Остатки.ПартияПроизводства
	|		И ДД.ЗаказНаПроизводство = Остатки.ЗаказНаПроизводство
	|		И ДД.КодСтрокиПродукция = Остатки.КодСтрокиПродукция
	|		И ДД.СтатьяКалькуляции = Остатки.СтатьяКалькуляции
	|		И ДД.СтатьяРасходов = Остатки.СтатьяРасходов
	|		И ДД.АналитикаРасходов = Остатки.АналитикаРасходов
	|		И ДД.ГруппаПродукции = Остатки.ГруппаПродукции
	|		И ДД.ПравилоОтнесенияНаВыпуск = Остатки.ПравилоОтнесенияНаВыпуск
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|		ПО ДД.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|		И ДД.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|		И ДД.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|ГДЕ
	|	ЕСТЬNULL(Остатки.ПоказательОтнесенияНаВыпускОстаток,0) > 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Ссылка                              КАК Ссылка,
	|	ДД.Организация                         КАК Организация,
	|	ДД.Подразделение                       КАК Подразделение,
	|	ДД.НаправлениеДеятельности             КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                   КАК АналитикаРасходов
	|ПОМЕСТИТЬ ВтАналитикаУчетаРасходов
	|ИЗ
	|	(
	// выборка данных при ПУ22
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Партии.Регистратор КАК Ссылка,
	|		Партии.Организация КАК Организация,
	|		Партии.Регистратор.Подразделение КАК Подразделение,
	|		Партии.Регистратор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Партии.СтатьяРасходов КАК СтатьяРасходов,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов
	|	ИЗ
	|		ПартииДляОтнесенияРасходов КАК Партии
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// выборка данных при ПУ21
	|	ВЫБРАТЬ
	|		Распределение.Ссылка,
	|		Распределение.Организация,
	|		Распределение.Подразделение,
	|		Распределение.НаправлениеДеятельности,
	|		Распределение.СтатьяРасходов,
	|		Распределение.АналитикаРасходов
	|	ИЗ
	|		Документ.РаспределениеПрочихЗатрат КАК Распределение
	|	ГДЕ
	|		Распределение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Распределение.Проведен
	|		И Распределение.Организация В (&МассивОрганизаций)
	|		И НЕ &ПартионныйУчетВерсии22
	|	) КАК ДД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	НаправлениеДеятельности,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расходы.Организация                                    КАК Организация,
	|	Расходы.Регистратор                                    КАК Регистратор,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)          КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО                                           КАК ИдентификаторПартии,
	|	НЕОПРЕДЕЛЕНО                                           КАК Партия,
	|	Расходы.Подразделение                                  КАК Подразделение,
	|	СУММА(Расходы.ДоляСтоимостиПриход)                     КАК Количество,
	|	МАКСИМУМ(ЕСТЬNULL(СуммыРасходов.Сумма, 0))             КАК Сумма,
	|	МАКСИМУМ(ЕСТЬNULL(СуммыРасходов.СуммаБезНДС, 0))       КАК СуммаБезНДС,
	|	МАКСИМУМ(ЕСТЬNULL(СуммыРасходов.СуммаРегл, 0))         КАК СуммаРегл,
	|	МАКСИМУМ(ЕСТЬNULL(СуммыРасходов.ПостояннаяРазница, 0)) КАК ПостояннаяРазница,
	|	МАКСИМУМ(ЕСТЬNULL(СуммыРасходов.ВременнаяРазница, 0))  КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтНезавершенноеПроизводство
	|ИЗ (
	// распределение на этапы при ПУ21
	|	ВЫБРАТЬ
	|		Расходы.Организация,
	|		Операция.СтатьяРасходов,
	|		Операция.АналитикаРасходов,
	|		Операция.Подразделение,
	|		Операция.НаправлениеДеятельности,
	|		Расходы.Регистратор,
	|		СУММА(Расходы.ДоляСтоимости) КАК ДоляСтоимостиПриход
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Операция
	|			ПО Операция.Ссылка = Расходы.Регистратор
	|	ГДЕ
	|		Расходы.СлужебноеВидДвиженияПриход
	|		И НЕ &ПартионныйУчетВерсии22
	|	СГРУППИРОВАТЬ ПО
	|		Расходы.Организация,
	|		Операция.СтатьяРасходов,
	|		Операция.АналитикаРасходов,
	|		Операция.Подразделение,
	|		Операция.НаправлениеДеятельности,
	|		Расходы.Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение на другие статьи при ПУ21
	|	ВЫБРАТЬ
	|		Операция.Организация,
	|		Операция.СтатьяРасходов,
	|		Операция.АналитикаРасходов,
	|		Операция.Подразделение,
	|		Операция.НаправлениеДеятельности,
	|		Операция.Ссылка КАК Регистратор,
	|		СУММА(Строки.ДоляСтоимости) КАК ДоляСтоимостиПриход
	|	ИЗ
	|		Документ.РаспределениеПрочихЗатрат КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.Списание КАК Строки
	|			ПО Строки.Ссылка = Операция.Ссылка
	|	ГДЕ
	|		Операция.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Операция.Организация В(&МассивОрганизаций)
	|		И Операция.Проведен
	|		И НЕ &ПартионныйУчетВерсии22
	|	СГРУППИРОВАТЬ ПО
	|		Операция.Организация,
	|		Операция.СтатьяРасходов,
	|		Операция.АналитикаРасходов,
	|		Операция.Подразделение,
	|		Операция.НаправлениеДеятельности,
	|		Операция.Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение на партии и другие статьи для ПУ 2.2
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.Регистратор,
	|		СУММА(ДД.ДоляСтоимости) КАК ДоляСтоимостиПриход
	|	ИЗ
	|		ДолиПроизводственныхРасходов КАК ДД
	|	ГДЕ
	|		ДД.Организация В(&МассивОрганизаций)
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.Регистратор

	|	) КАК Расходы
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходов
	|		ПО СуммыРасходов.Организация = Расходы.Организация
	|		И СуммыРасходов.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И СуммыРасходов.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И СуммыРасходов.Подразделение = Расходы.Подразделение
	|		И СуммыРасходов.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|СГРУППИРОВАТЬ ПО
	|	Расходы.Организация,
	|	Расходы.Регистратор,
	|	Расходы.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение на выпуск - приход показателя отнесения за текущий месяц
	|ВЫБРАТЬ
	|	ДД.Организация                                       КАК Организация,
	|	ДД.Регистратор                                       КАК Регистратор,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) КАК РазделУчета,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)        КАК ВидЗапасов,
	|	ДД.ИдентификаторПартии                               КАК ИдентификаторПартии,
	|	НЕОПРЕДЕЛЕНО                                         КАК Партия,
	|	ДД.Подразделение                                     КАК Подразделение,
	|	СУММА(ДД.ПоказательОтнесенияНаВыпуск)                КАК Количество,
	|	0                                                    КАК Сумма,
	|	0                                                    КАК СуммаБезНДС,
	|	0                                                    КАК СуммаРегл,
	|	0                                                    КАК ПостояннаяРазница,
	|	0                                                    КАК ВременнаяРазница
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.ДокументИсточник КАК Регистратор,
	|		ИдентификаторыПартий.ИдентификаторПартии,
	|		ДД.Подразделение,
	|		ДД.ПоказательОтнесенияНаВыпуск
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|				ПО ДД.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|				И ДД.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|				И ДД.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|	ГДЕ
	|		ДД.СлужебноеВидДвиженияПриход
	|		И &ПартионныйУчетВерсии22
	|
	|	) КАК ДД
	|
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Организация,
	|		ДД.ИдентификаторПартии,
	|		ДД.Регистратор,
	|		ДД.Подразделение
	|";
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтНезавершенноеПроизводство");
	Запрос.УстановитьПараметр("МассивНормируемыхРасходов", Перечисления.ВидыРасходовНУ.НормируемыеРасходы());
	Запрос.Выполнить();
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ДолиСписанияКосвенныхРасходов,ПрочиеРасходыНезавершенногоПроизводстваОстатки,втСуммыРасходов,СуммыРасходов,ПартииДляОтнесенияРасходовСводно");
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

// Этап 3.5
// Формирует временную таблицу ВтПередачиТоваров
//
Процедура СформироватьТаблицуПередачМеждуОрганизациями(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьТаблицуПередачМеждуОрганизациями");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроданныеТовары.ОрганизацияВладелец            КАК ОрганизацияПродавец,
	|	ПроданныеТовары.ВидЗапасовПродавца.Организация КАК ОрганизацияПолучатель,
	|	ПроданныеТовары.АналитикаУчетаНоменклатуры     КАК АналитикаУчетаНоменклатуры,
	|	СУММА(ПроданныеТовары.КоличествоОстаток)       КАК Количество,
	|
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца.ВидЗапасовВладельца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасовПродавца,
	|
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасовПолучателя
	|
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&ГраницаКонецПериода,
	|		&ПредварительныйРасчет
	|		И ОрганизацияВладелец В (&МассивОрганизаций)
	|		И ВидЗапасовПродавца.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	) КАК ПроданныеТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроданныеТовары.ОрганизацияВладелец,
	|	ПроданныеТовары.ВидЗапасовПродавца.Организация,
	|	ПроданныеТовары.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца.ВидЗапасовВладельца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ПроданныеТовары.ВидЗапасовПродавца
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	&КонецПериода                                                           КАК Период,
	|	Товары.АналитикаУчетаНоменклатуры                                       КАК АналитикаУчетаНоменклатуры,
	|	Товары.ОрганизацияПродавец                                              КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|
	|	Товары.ВидЗапасовПродавца   КАК ВидЗапасов,
	|	Товары.ВидЗапасовПолучателя КАК КорВидЗапасов,
	|
	|	Товары.Количество КАК Количество,
	|	0                 КАК Стоимость,
	|	0                 КАК ПостояннаяРазница,
	|	0                 КАК ВременнаяРазница,
	|	0                 КАК СтоимостьБезНДС,
	|	0                 КАК СтоимостьРегл,
	|
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)          КАК КорРазделУчета,
	|	Товары.ОрганизацияПолучатель                                                     КАК КорОрганизация,
	|	Товары.АналитикаУчетаНоменклатуры                                                КАК КорАналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ ВтПередачиТоваров
	|ИЗ
	|	Товары КАК Товары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Товары.ОрганизацияПолучатель КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|
	|	Товары.ВидЗапасовПолучателя КАК ВидЗапасов,
	|	Неопределено КАК КорВидЗапасов,
	|
	|	Товары.Количество КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьРегл,
	|
	|	Неопределено КАК КорРазделУчета,
	|	Неопределено КАК КорОрганизация,
	|	Неопределено КАК КорАналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) КАК ХозяйственнаяОперация
	|ИЗ
	|	Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ Товары
	|";
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтПередачиТоваров");
	Запрос.Выполнить();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.6
Процедура СформироватьУзлыКорректировкиСписанияСтоимости(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьУзлыКорректировкиСписанияСтоимости");
	
	ТекстЗапроса =
	"
	// Данные об аналитике для расчета.
	|//ПредварительныйРасчет ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ПОМЕСТИТЬ ВтАналитикаНоменклатуры
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|//ПредварительныйРасчет ГДЕ
	|//ПредварительныйРасчет	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|//ПредварительныйРасчет	ИЛИ УчетСебестоимости.РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ОБЪЕДИНИТЬ
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ВЫБРАТЬ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|//ПредварительныйРасчет		Организация В (&МассивОрганизаций)
	|//ПредварительныйРасчет		И РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет	) КАК УчетСебестоимости
	|//ПредварительныйРасчет ;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ДД.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета
	|ПОМЕСТИТЬ
	|	ЕстьВозвратныеОтходы
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.Количество < 0
	//++ НЕ УТКА
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа)
	//-- НЕ УТКА
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|;
	|////////////////////////////////////////////////////////////////////////////////
	// Данные о движении товаров за период.
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация                КАК Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.РазделУчета                КАК РазделУчета,
	|	ВложенныйЗапрос.ВидЗапасов                 КАК ВидЗапасов,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ									   КАК Партия,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ									   КАК АналитикаУчетаПартий,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ									   КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ									   КАК ВидДеятельностиНДС,
	|
	|	СУММА(ВложенныйЗапрос.Количество)          КАК Количество,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Стоимость) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК Стоимость,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьБезНДС) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаДопРасходов) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаДопРасходовБезНДС) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК СтоимостьДопРасходыБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьЗабалансовая) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Трудозатраты) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеСНДС) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеБезНДС) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  			   КАК ПостатейныеБезНДС,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23,10))  			   КАК ПостояннаяРазница,
	|	1 										   КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23,10))  			   КАК ВременнаяРазница,
	|	1 										   КАК ВременнаяРазницаЗнак
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|
	|	(ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				ТОГДА УчетСебестоимости.Количество
	|			ИНАЧЕ 0 КОНЕЦ КАК Количество,
	|
	|		// Данные о суммах внешних поступлений.
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И НЕ &ПредварительныйРасчет ТОГДА
	|			УчетСебестоимости.Стоимость
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК Стоимость,
	|
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И НЕ &ПредварительныйРасчет ТОГДА
	|			УчетСебестоимости.СтоимостьБезНДС
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьБезНДС,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СуммаДопРасходов
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СуммаДопРасходов,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СуммаДопРасходовБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СуммаДопРасходовБезНДС,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Трудозатраты
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК Трудозатраты,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеСНДС,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные о возвратах прошлых периодов.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК Количество,
			// Данные о суммах внешних поступлений.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК Стоимость,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьБезНДС,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СуммаДопРасходов
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СуммаДопРасходов,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СуммаДопРасходовБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СуммаДопРасходовБезНДС,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансовая
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Трудозатраты
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК Трудозатраты,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеСНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеСНДС,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВТВозвраты КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные о передачах между организациям.
	|		УчетСебестоимости.Организация                				КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры 				КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                				КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                		 		КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК Количество,
			// Данные о суммах внешних поступлений.
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.Стоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК Стоимость,
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				УчетСебестоимости.СтоимостьБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        				КАК СтоимостьБезНДС,
	|
	|		0                                            				КАК СуммаДопРасходов,
	|		0                                            				КАК СуммаДопРасходовБезНДС,
	|
	|		0                                            				КАК СтоимостьЗабалансовая,
	|		0                                            				КАК Трудозатраты,
	|		0                                            				КАК ПостатейныеСНДС,
	|		0                                            				КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВтПередачиТоваров КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.АналитикаУчетаНоменклатуры 							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета                							КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|
	|		0                                  							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьБезНДС,
	|		Таблица.СуммаДопРасходов           							КАК СуммаДопРасходов,
	|		Таблица.СуммаДопРасходовБезНДС     							КАК СуммаДопРасходовБезНДС,
	|
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		0                                  							КАК ПостатейныеСНДС,
	|		0                                  							КАК ПостатейныеБезНДС
	|	ИЗ 
	|		ВТДопРасходов КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам на начало расчетного периода.
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                   КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                   КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                    КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     	КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       	КАК АналитикаУчетаПартий,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  	КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         	КАК ВидДеятельностиНДС,
	|
	|		УчетСебестоимости.КоличествоОстаток             КАК Количество,
	|		УчетСебестоимости.СтоимостьОстаток              КАК Стоимость,
	|		УчетСебестоимости.СтоимостьБезНДСОстаток        КАК СтоимостьБезНДС,
	|		УчетСебестоимости.СуммаДопРасходовОстаток       КАК СуммаДопРасходов,
	|		УчетСебестоимости.СуммаДопРасходовБезНДСОстаток КАК СуммаДопРасходовБезНДС,
	|
	|		УчетСебестоимости.СтоимостьЗабалансоваяОстаток  КАК СтоимостьЗабалансовая,
	|		УчетСебестоимости.ТрудозатратыОстаток			КАК Трудозатраты,
	|		УчетСебестоимости.ПостатейныеСНДСОстаток		КАК ПостатейныеСНДС,
	|		УчетСебестоимости.ПостатейныеБезНДСОстаток		КАК ПостатейныеБезНДС
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|			//ПредварительныйРасчет И (АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов)
	|			//ПредварительныйРасчет В
	|			//ПредварительныйРасчет (ВЫБРАТЬ
	|			//ПредварительныйРасчет 	АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов
	|			//ПредварительныйРасчет	ИЗ ВтАналитикаНоменклатуры)
	|		) КАК УчетСебестоимости
	//++ НЕ УТ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по прочим расходам незавершенного производства 22.
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.Регистратор                							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета               		 					КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		Таблица.ИдентификаторПартии        			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		Таблица.Подразделение						 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|
	|		Таблица.Количество                 							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьБезНДС,
	|		0                                  							КАК СуммаДопРасходов,
	|		0                                  							КАК СуммаДопРасходовБезНДС,
	|
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		Таблица.Сумма                      							КАК ПостатейныеСНДС,
	|		Таблица.СуммаБезНДС                							КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВтНезавершенноеПроизводство КАК Таблица
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по прочим расходам незавершенного производства 21.
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.Регистратор             							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета               		 					КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		Таблица.Партия                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|
	|		Таблица.Количество                 							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьБезНДС,
	|		0                                  							КАК СуммаДопРасходов,
	|		0                                  							КАК СуммаДопРасходовБезНДС,
	|
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		Таблица.Сумма                      							КАК ПостатейныеСНДС,
	|		Таблица.СуммаБезНДС                							КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВтНезавершенноеПроизводство КАК Таблица
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам прочих расходов незавершенного производства для 2.2.
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.Регистратор                							КАК АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) КАК РазделУчета,
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)				КАК ВидЗапасов,
	|		Таблица.ИдентификаторПартии         			 			КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		Таблица.Подразделение						 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|
	|		Таблица.ПоказательОтнесенияНаВыпуск							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьБезНДС,
	|		0                                  							КАК СуммаДопРасходов,
	|		0                                  							КАК СуммаДопРасходовБезНДС,
	|
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		Таблица.Стоимость                  							КАК ПостатейныеСНДС,
	|		Таблица.СтоимостьБезНДС            							КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВтОстаткиНезавершенногоПроизводства КАК Таблица
	//-- НЕ УТ
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.РазделУчета,
	|	ВложенныйЗапрос.Организация,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ
	|";
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПредварительныйРасчет", "");
	КонецЕсли;

	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить(); // создание ВтУзлыКорректировки
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет
	 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОВзвешеннаяОценка Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета, Запрос); // корректировка ВтУзлыКорректировки
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтАналитикаНоменклатуры");
	КонецЕсли;
	
	ПараметрыНумерации = УниверсальныеМеханизмыПартийИСебестоимости.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		, // без группировки
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС", // порядок
		"НомерУзла", // поле номера
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, НомерУзла"); // индекс
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВтУзлыКорректировки");
	
	ПараметрыРасчета.КоличествоУзлов =
		УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");
	
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.7, 3.11
Процедура РассчитатьСтоимость(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РассчитатьСтоимость" + ?(РасчетСтоимостиРегл, "(Регл)", ""));
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = ?(РасчетСтоимостиРегл, ТекстЗапросаДвиженияСтоимостиРегл(), ТекстЗапросаДвиженияСтоимости());
	
	Запрос.Выполнить();
	
	//++ НЕ УТ
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "Выпуски");
	//-- НЕ УТ
	
	РешитьСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл);
	
КонецПроцедуры

// Этап 3.8, 3.12
Процедура ЗарегистрироватьСтоимость(ПараметрыРасчета, РегистрацияСтоимостиРегл)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимость" + ?(РегистрацияСтоимостиРегл, "(Регл)", ""));
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("РегистрацияСтоимостиРегл", РегистрацияСтоимостиРегл);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваровВременная
	|ИЗ
	|	ВТСтоимостьПартийТоваров КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСтоимостьПартийТоваров";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА (Т.КоличествоРасход <= 0 И Т.КоличествоОстаток <= 0)
	|				ИЛИ (Т.КоличествоРасход >= 0 И Т.КоличествоОстаток >= 0)
	|		ТОГДА Т.КоличествоРасход + Т.КоличествоОстаток
	|		ИНАЧЕ Т.КоличествоРасход
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ВТОборотыКоличествоСПартиями
	|ИЗ
	|(ВЫБРАТЬ
	|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
	|	ДанныеПоКоличеству.РазделУчета,
	|	ДанныеПоКоличеству.ВидЗапасов,
	|	ДанныеПоКоличеству.Организация,
	|	ДанныеПоКоличеству.Партия,
	|	ДанныеПоКоличеству.АналитикаУчетаПартий,
	|	ДанныеПоКоличеству.АналитикаФинансовогоУчета,
	|	ДанныеПоКоличеству.ВидДеятельностиНДС,
	|	СУММА(ДанныеПоКоличеству.КоличествоРасход)  КАК КоличествоРасход,
	|	СУММА(ДанныеПоКоличеству.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Обороты.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И Обороты.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ Обороты.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		Обороты.ВидЗапасов,
	|		Обороты.Организация,
	|		Обороты.Партия,
	|		Обороты.АналитикаУчетаПартий,
	|		Обороты.АналитикаФинансовогоУчета,
	|		Обороты.ВидДеятельностиНДС,
	|		Обороты.Количество 	КАК КоличествоРасход,
	|		0 					КАК КоличествоОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = Обороты.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Обороты.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = Обороты.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ГДЕ
	|		НЕ Обороты.СлужебноеВидДвиженияПриход
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Остатки.АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Остатки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И Остатки.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ Остатки.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		Остатки.ВидЗапасов,
	|		Остатки.Организация,
	|		Остатки.Партия,
	|		Остатки.АналитикаУчетаПартий,
	|		Остатки.АналитикаФинансовогоУчета,
	|		Остатки.ВидДеятельностиНДС,
	|		0 					КАК КоличествоРасход,
	|		Остатки.Количество 	КАК КоличествоОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = Остатки.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = Остатки.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	) КАК ДанныеПоКоличеству
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
	|	ДанныеПоКоличеству.Организация,
	|	ДанныеПоКоличеству.ВидЗапасов,
	|	ДанныеПоКоличеству.РазделУчета,
	|	ДанныеПоКоличеству.Партия,
	|	ДанныеПоКоличеству.АналитикаУчетаПартий,
	|	ДанныеПоКоличеству.АналитикаФинансовогоУчета,
	|	ДанныеПоКоличеству.ВидДеятельностиНДС
	|) КАК Т
	|
	|ГДЕ
	|	ВЫБОР
	|		КОГДА (Т.КоличествоРасход <= 0 И Т.КоличествоОстаток <= 0)
	|				ИЛИ (Т.КоличествоРасход >= 0 И Т.КоличествоОстаток >= 0)
	|		ТОГДА Т.КоличествоРасход + Т.КоличествоОстаток
	|		ИНАЧЕ Т.КоличествоРасход
	|	КОНЕЦ <> 0
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Обороты.АналитикаУчетаНоменклатуры,
	|	Обороты.РазделУчета,
	|	Обороты.ВидЗапасов,
	|	Обороты.Организация,
	|	СУММА(Обороты.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТОборотыКоличествоБезПартий
	|ИЗ
	|	ВТОборотыКоличествоСПартиями КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.АналитикаУчетаНоменклатуры,
	|	Обороты.РазделУчета,
	|	Обороты.ВидЗапасов,
	|	Обороты.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Обороты.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Остатки.АналитикаУчетаНоменклатуры 												 КАК АналитикаУчетаНоменклатуры,
	|	Остатки.РазделУчета 															 КАК РазделУчета,
	|	Остатки.ВидЗапасов 																 КАК ВидЗапасов,
	|	Остатки.Организация 															 КАК Организация,
	|	Остатки.Партия                          	  									 КАК Партия,
	|	Остатки.АналитикаУчетаПартий                									 КАК АналитикаУчетаПартий,
	|	Остатки.АналитикаФинансовогоУчета           									 КАК АналитикаФинансовогоУчета,
	|	Остатки.ВидДеятельностиНДС                  									 КАК ВидДеятельностиНДС,
	|
	|	Остатки.Количество 																 		 КАК Количество,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.Стоимость КАК ЧИСЛО(23,10)) / Остатки.Количество 			 	 КАК ЧИСЛО (23, 10)) КАК Стоимость,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.СтоимостьБезНДС КАК ЧИСЛО(23,10)) / Остатки.Количество 		 КАК ЧИСЛО (23, 10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.СуммаДопРасходов КАК ЧИСЛО(23,10)) / Остатки.Количество 		 КАК ЧИСЛО (23, 10)) КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.СуммаДопРасходовБезНДС КАК ЧИСЛО(23,10)) / Остатки.Количество  КАК ЧИСЛО (23, 10)) КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.ПостояннаяРазница КАК ЧИСЛО(23,10)) / Остатки.Количество 	 	 КАК ЧИСЛО (23, 10)) КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.ВременнаяРазница КАК ЧИСЛО(23,10)) / Остатки.Количество 		 КАК ЧИСЛО (23, 10)) КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.СтоимостьЗабалансовая КАК ЧИСЛО(23,10)) / Остатки.Количество   КАК ЧИСЛО (23, 10)) КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.Трудозатраты КАК ЧИСЛО(23,10)) / Остатки.Количество 			 КАК ЧИСЛО (23, 10)) КАК Трудозатраты,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.ПостатейныеСНДС КАК ЧИСЛО(23,10)) / Остатки.Количество 		 КАК ЧИСЛО (23, 10)) КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Остатки.ПостатейныеБезНДС КАК ЧИСЛО(23,10)) / Остатки.Количество		 КАК ЧИСЛО (23, 10)) КАК ПостатейныеБезНДС,
	|	ВЫБОР
	|		КОГДА Остатки.ПостояннаяРазница / Остатки.Количество < 0
	|			ТОГДА -1
	|			ИНАЧЕ 1
	|	КОНЕЦ 																			 КАК ПостояннаяРазницаЗнак,
	|	ВЫБОР
	|		КОГДА Остатки.ВременнаяРазница / Остатки.Количество < 0
	|			ТОГДА -1
	|			ИНАЧЕ 1
	|	КОНЕЦ 																			 КАК ВременнаяРазницаЗнак
	|ПОМЕСТИТЬ ВТОстаткиСтоимости
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК Узлы
	|			ПО Узлы.АналитикаУчетаНоменклатуры  = Остатки.АналитикаУчетаНоменклатуры
	|			И Узлы.РазделУчета 					= Остатки.РазделУчета
	|			И Узлы.ВидЗапасов 					= Остатки.ВидЗапасов
	|			И Узлы.Организация 					= Остатки.Организация
	|			И Узлы.Партия 						= Остатки.Партия
	|			И Узлы.АналитикаУчетаПартий 		= Остатки.АналитикаУчетаПартий
	|			И Узлы.АналитикаФинансовогоУчета 	= Остатки.АналитикаФинансовогоУчета
	|			И Узлы.ВидДеятельностиНДС 			= Остатки.ВидДеятельностиНДС
	|			И Узлы.Количество > 0
	|ГДЕ
	|	Остатки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И Остатки.Количество > 0
	|	И Узлы.НомерУзла ЕСТЬ NULL
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Таблица.Организация                                   	 		 КАК Организация,
	|	Таблица.АналитикаУчетаНоменклатуры                    	 		 КАК АналитикаУчетаНоменклатуры,
	|	Таблица.ВидЗапасов                                    	 		 КАК ВидЗапасов,
	|	Таблица.РазделУчета                                   	 		 КАК РазделУчета,
	|	Таблица.Партия                          	  			 		 КАК Партия,
	|	Таблица.АналитикаУчетаПартий                			 		 КАК АналитикаУчетаПартий,
	|	Таблица.АналитикаФинансовогоУчета           			 		 КАК АналитикаФинансовогоУчета,
	|	Таблица.ВидДеятельностиНДС                  			 		 КАК ВидДеятельностиНДС,
	|
	|	СУММА(Таблица.Стоимость)                             	 		 КАК Стоимость,
	|	СУММА(Таблица.СтоимостьБезНДС)                      	 		 КАК СтоимостьБезНДС,
	|	СУММА(Таблица.СтоимостьДопРасходы)                 	     		 КАК СтоимостьДопРасходы,
	|	СУММА(Таблица.СтоимостьДопРасходыБезНДС)           	     		 КАК СтоимостьДопРасходыБезНДС,
	|
	|	СУММА(Таблица.СтоимостьЗабалансовая)                     		 КАК СтоимостьЗабалансовая,
	|	СУММА(Таблица.Трудозатраты)                         	 		 КАК Трудозатраты,
	|	СУММА(Таблица.ПостатейныеСНДС)                         	 		 КАК ПостатейныеСНДС,
	|	СУММА(Таблица.ПостатейныеБезНДС)                         		 КАК ПостатейныеБезНДС,
	|
	|	СУММА(Таблица.ПостояннаяРазница	* Таблица.ПостояннаяРазницаЗнак) КАК ПостояннаяРазница,
	|	СУММА(Таблица.ВременнаяРазница * Таблица.ВременнаяРазницаЗнак)   КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТСтоимостьТоваровБезВидаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		УзлыКорректировки.Организация                КАК Организация,
	|		УзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|		УзлыКорректировки.РазделУчета                КАК РазделУчета,
	|		УзлыКорректировки.Партия					 КАК Партия,
	|		УзлыКорректировки.АналитикаУчетаПартий		 КАК АналитикаУчетаПартий,
	|		УзлыКорректировки.АналитикаФинансовогоУчета	 КАК АналитикаФинансовогоУчета,
	|		УзлыКорректировки.ВидДеятельностиНДС		 КАК ВидДеятельностиНДС,
	|		ТаблицаРешений.Стоимость                     КАК Стоимость,
	|		ТаблицаРешений.СтоимостьБезНДС               КАК СтоимостьБезНДС,
	|		ТаблицаРешений.ПостояннаяРазница             КАК ПостояннаяРазница,
	|		ТаблицаРешений.ПостояннаяРазницаЗнак         КАК ПостояннаяРазницаЗнак,
	|		ТаблицаРешений.ВременнаяРазница              КАК ВременнаяРазница,
	|		ТаблицаРешений.ВременнаяРазницаЗнак          КАК ВременнаяРазницаЗнак,
	|		ТаблицаРешений.СтоимостьДопРасходы           КАК СтоимостьДопРасходы,
	|		ТаблицаРешений.СтоимостьДопРасходыБезНДС     КАК СтоимостьДопРасходыБезНДС,
	|		ТаблицаРешений.СтоимостьЗабалансовая         КАК СтоимостьЗабалансовая,
	|		ТаблицаРешений.Трудозатраты                  КАК Трудозатраты,
	|		ТаблицаРешений.ПостатейныеСНДС               КАК ПостатейныеСНДС,
	|		ТаблицаРешений.ПостатейныеБезНДС             КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВтТаблицаРешений КАК ТаблицаРешений
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировки
	|				ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|	ГДЕ
	|		(ТаблицаРешений.Стоимость <> 0
	|			ИЛИ ТаблицаРешений.СтоимостьБезНДС <> 0
	|			ИЛИ ТаблицаРешений.СтоимостьДопРасходы <> 0
	|			ИЛИ ТаблицаРешений.СтоимостьДопРасходыБезНДС <> 0
	|			ИЛИ ТаблицаРешений.СтоимостьЗабалансовая <> 0
	|			ИЛИ ТаблицаРешений.Трудозатраты <> 0
	|			ИЛИ ТаблицаРешений.ПостатейныеСНДС <> 0
	|			ИЛИ ТаблицаРешений.ПостатейныеБезНДС <> 0)
	|		И УзлыКорректировки.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Остатки.Организация                   КАК Организация,
	|		Остатки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|		Остатки.ВидЗапасов                    КАК ВидЗапасов,
	|		Остатки.РазделУчета                	  КАК РазделУчета,
	|		Остатки.Партия					 	  КАК Партия,
	|		Остатки.АналитикаУчетаПартий		  КАК АналитикаУчетаПартий,
	|		Остатки.АналитикаФинансовогоУчета	  КАК АналитикаФинансовогоУчета,
	|		Остатки.ВидДеятельностиНДС		 	  КАК ВидДеятельностиНДС,
	|		Остатки.Стоимость                     КАК Стоимость,
	|		Остатки.СтоимостьБезНДС               КАК СтоимостьБезНДС,
	|		Остатки.ПостояннаяРазница             КАК ПостояннаяРазница,
	|		Остатки.ПостояннаяРазницаЗнак         КАК ПостояннаяРазницаЗнак,
	|		Остатки.ВременнаяРазница              КАК ВременнаяРазница,
	|		Остатки.ВременнаяРазницаЗнак          КАК ВременнаяРазницаЗнак,
	|		Остатки.СтоимостьДопРасходы           КАК СтоимостьДопРасходы,
	|		Остатки.СтоимостьДопРасходыБезНДС     КАК СтоимостьДопРасходыБезНДС,
	|		Остатки.СтоимостьЗабалансовая         КАК СтоимостьЗабалансовая,
	|		Остатки.Трудозатраты                  КАК Трудозатраты,
	|		Остатки.ПостатейныеСНДС               КАК ПостатейныеСНДС,
	|		Остатки.ПостатейныеБезНДС             КАК ПостатейныеБезНДС
	|	ИЗ
	|		ВТОстаткиСтоимости КАК Остатки
	|	) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.Организация,
	|	Таблица.ВидЗапасов,
	|	Таблица.РазделУчета,
	|	Таблица.Партия,
	|	Таблица.АналитикаУчетаПартий,
	|	Таблица.АналитикаФинансовогоУчета,
	|	Таблица.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица.Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка								КАК ДокументДвижения,
	|	&НачалоПериода 														КАК Период,
	|
	|	СтоимостьТоваров.Организация 										КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 						КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 										КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 										КАК РазделУчета,
	|	СтоимостьТоваров.Партия					 	  						КАК Партия,
	|	СтоимостьТоваров.АналитикаУчетаПартий		  						КАК АналитикаУчетаПартий,
	|	СтоимостьТоваров.АналитикаФинансовогоУчета	  						КАК АналитикаФинансовогоУчета,
	|	СтоимостьТоваров.ВидДеятельностиНДС		 	  						КАК ВидДеятельностиНДС,
	|
	// упр.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.Стоимость
	|	КОНЕЦ 																КАК Стоимость,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьБезНДС
	|	КОНЕЦ 																КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходы
	|	КОНЕЦ 																КАК СтоимостьДопРасходы,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходыБезНДС
	|	КОНЕЦ 																КАК СтоимостьДопРасходыБезНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансовая
	|	КОНЕЦ 																КАК СтоимостьЗабалансовая,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.Трудозатраты
	|	КОНЕЦ 																КАК Трудозатраты,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ПостатейныеСНДС
	|	КОНЕЦ 																КАК ПостатейныеСНДС,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА 0
	|		ИНАЧЕ СтоимостьТоваров.ПостатейныеБезНДС
	|	КОНЕЦ 																КАК ПостатейныеБезНДС,
	|
	// регл.
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьЗабалансовая
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК СтоимостьЗабалансоваяРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.СтоимостьДопРасходы
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ДопРасходыРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.Трудозатраты
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ТрудозатратыРегл,
	|	ВЫБОР КОГДА &РегистрацияСтоимостиРегл
	|		ТОГДА СтоимостьТоваров.ПостатейныеСНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ 																КАК ПостатейныеРегл,
	|
	// разницы
	|	СтоимостьТоваров.ПостояннаяРазница									КАК ПостояннаяРазница,
	|	СтоимостьТоваров.ВременнаяРазница									КАК ВременнаяРазница,
	|
	// количество
	|	ЕСТЬNULL(Обороты.Количество, 0)										КАК Количество
	|
	|ПОМЕСТИТЬ ВТСтоимостьТоваров
	|ИЗ
	|	ВТСтоимостьТоваровБезВидаУчета КАК СтоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО СтоимостьТоваров.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыКоличествоСПартиями КАК Обороты
	|			ПО СтоимостьТоваров.АналитикаУчетаНоменклатуры  = Обороты.АналитикаУчетаНоменклатуры
	|			И СтоимостьТоваров.РазделУчета 					= Обороты.РазделУчета
	|			И СтоимостьТоваров.ВидЗапасов 					= Обороты.ВидЗапасов
	|			И СтоимостьТоваров.Организация 					= Обороты.Организация
	|			И СтоимостьТоваров.Партия 						= Обороты.Партия
	|			И СтоимостьТоваров.АналитикаУчетаПартий 		= Обороты.АналитикаУчетаПартий
	|			И СтоимостьТоваров.АналитикаФинансовогоУчета 	= Обороты.АналитикаФинансовогоУчета
	|			И СтоимостьТоваров.ВидДеятельностиНДС 			= Обороты.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СтоимостьТоваров.ДокументДвижения									КАК ДокументДвижения,
	|	СтоимостьТоваров.Период 											КАК Период,
	|
	|	СтоимостьТоваров.Организация 										КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 						КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 										КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 										КАК РазделУчета,
	|	СтоимостьТоваров.Партия					 	  						КАК Партия,
	|	СтоимостьТоваров.АналитикаУчетаПартий		  						КАК АналитикаУчетаПартий,
	|	СтоимостьТоваров.АналитикаФинансовогоУчета	  						КАК АналитикаФинансовогоУчета,
	|	СтоимостьТоваров.ВидДеятельностиНДС		 	  						КАК ВидДеятельностиНДС,
	|
	|	СУММА(СтоимостьТоваров.Стоимость)		 	  						КАК Стоимость,
	|	СУММА(СтоимостьТоваров.СтоимостьБезНДС)		 	  					КАК СтоимостьБезНДС,
	|	СУММА(СтоимостьТоваров.СтоимостьЗабалансовая)		 	  			КАК СтоимостьЗабалансовая,
	|	СУММА(СтоимостьТоваров.СтоимостьДопРасходы)		 	  				КАК СтоимостьДопРасходы,
	|	СУММА(СтоимостьТоваров.СтоимостьДопРасходыБезНДС)		 	  		КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(СтоимостьТоваров.Трудозатраты)		 	  					КАК Трудозатраты,
	|	СУММА(СтоимостьТоваров.ПостатейныеСНДС)		 	  					КАК ПостатейныеСНДС,
	|	СУММА(СтоимостьТоваров.ПостатейныеБезНДС)		 	  				КАК ПостатейныеБезНДС,
	|	СУММА(СтоимостьТоваров.СтоимостьРегл)		 	  					КАК СтоимостьРегл,
	|	СУММА(СтоимостьТоваров.СтоимостьЗабалансоваяРегл)		 	  		КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(СтоимостьТоваров.ПостояннаяРазница)		 	  				КАК ПостояннаяРазница,
	|	СУММА(СтоимостьТоваров.ВременнаяРазница)		 	  				КАК ВременнаяРазница,
	|	СУММА(СтоимостьТоваров.ДопРасходыРегл)		 	  					КАК ДопРасходыРегл,
	|	СУММА(СтоимостьТоваров.ТрудозатратыРегл)		 	  				КАК ТрудозатратыРегл,
	|	СУММА(СтоимостьТоваров.ПостатейныеРегл)		 	  					КАК ПостатейныеРегл
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьТоваров.ДокументДвижения								КАК ДокументДвижения,
	|		СтоимостьТоваров.Период 										КАК Период,
	|
	|		СтоимостьТоваров.Организация 									КАК Организация,
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 					КАК АналитикаУчетаНоменклатуры,
	|		СтоимостьТоваров.ВидЗапасов 									КАК ВидЗапасов,
	|		СтоимостьТоваров.РазделУчета 									КАК РазделУчета,
	|		СтоимостьТоваров.Партия					 	  					КАК Партия,
	|		СтоимостьТоваров.АналитикаУчетаПартий		  					КАК АналитикаУчетаПартий,
	|		СтоимостьТоваров.АналитикаФинансовогоУчета	  					КАК АналитикаФинансовогоУчета,
	|		СтоимостьТоваров.ВидДеятельностиНДС		 	  					КАК ВидДеятельностиНДС,
	|
	|		СтоимостьТоваров.Стоимость		 	  							КАК Стоимость,
	|		СтоимостьТоваров.СтоимостьБезНДС		 	  					КАК СтоимостьБезНДС,
	|		СтоимостьТоваров.СтоимостьЗабалансовая		 	  				КАК СтоимостьЗабалансовая,
	|		СтоимостьТоваров.СтоимостьДопРасходы		 	  				КАК СтоимостьДопРасходы,
	|		СтоимостьТоваров.СтоимостьДопРасходыБезНДС		 	  			КАК СтоимостьДопРасходыБезНДС,
	|		СтоимостьТоваров.Трудозатраты		 	  						КАК Трудозатраты,
	|		СтоимостьТоваров.ПостатейныеСНДС		 	  					КАК ПостатейныеСНДС,
	|		СтоимостьТоваров.ПостатейныеБезНДС		 	  					КАК ПостатейныеБезНДС,
	|		СтоимостьТоваров.СтоимостьРегл		 	  						КАК СтоимостьРегл,
	|		СтоимостьТоваров.СтоимостьЗабалансоваяРегл		 	  			КАК СтоимостьЗабалансоваяРегл,
	|		СтоимостьТоваров.ПостояннаяРазница		 	  					КАК ПостояннаяРазница,
	|		СтоимостьТоваров.ВременнаяРазница		 	  					КАК ВременнаяРазница,
	|		СтоимостьТоваров.ДопРасходыРегл		 	  						КАК ДопРасходыРегл,
	|		СтоимостьТоваров.ТрудозатратыРегл		 	  					КАК ТрудозатратыРегл,
	|		СтоимостьТоваров.ПостатейныеРегл		 	  					КАК ПостатейныеРегл
	|	ИЗ
	|		ВТСтоимостьПартийТоваровВременная КАК СтоимостьТоваров
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СтоимостьТоваров.ДокументДвижения								КАК ДокументДвижения,
	|		СтоимостьТоваров.Период 										КАК Период,
	|
	|		СтоимостьТоваров.Организация 									КАК Организация,
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 					КАК АналитикаУчетаНоменклатуры,
	|		СтоимостьТоваров.ВидЗапасов 									КАК ВидЗапасов,
	|		СтоимостьТоваров.РазделУчета 									КАК РазделУчета,
	|		СтоимостьТоваров.Партия					 	  					КАК Партия,
	|		СтоимостьТоваров.АналитикаУчетаПартий		  					КАК АналитикаУчетаПартий,
	|		СтоимостьТоваров.АналитикаФинансовогоУчета	  					КАК АналитикаФинансовогоУчета,
	|		СтоимостьТоваров.ВидДеятельностиНДС		 	  					КАК ВидДеятельностиНДС,
	|
	|		СтоимостьТоваров.Стоимость		 	  							КАК Стоимость,
	|		СтоимостьТоваров.СтоимостьБезНДС		 	  					КАК СтоимостьБезНДС,
	|		СтоимостьТоваров.СтоимостьЗабалансовая		 	  				КАК СтоимостьЗабалансовая,
	|		СтоимостьТоваров.СтоимостьДопРасходы		 	  				КАК СтоимостьДопРасходы,
	|		СтоимостьТоваров.СтоимостьДопРасходыБезНДС		 	  			КАК СтоимостьДопРасходыБезНДС,
	|		СтоимостьТоваров.Трудозатраты		 	  						КАК Трудозатраты,
	|		СтоимостьТоваров.ПостатейныеСНДС		 	  					КАК ПостатейныеСНДС,
	|		СтоимостьТоваров.ПостатейныеБезНДС		 	  					КАК ПостатейныеБезНДС,
	|		СтоимостьТоваров.СтоимостьРегл		 	  						КАК СтоимостьРегл,
	|		СтоимостьТоваров.СтоимостьЗабалансоваяРегл		 	  			КАК СтоимостьЗабалансоваяРегл,
	|		СтоимостьТоваров.ПостояннаяРазница		 	  					КАК ПостояннаяРазница,
	|		СтоимостьТоваров.ВременнаяРазница		 	  					КАК ВременнаяРазница,
	|		СтоимостьТоваров.ДопРасходыРегл		 	  						КАК ДопРасходыРегл,
	|		СтоимостьТоваров.ТрудозатратыРегл		 	  					КАК ТрудозатратыРегл,
	|		СтоимостьТоваров.ПостатейныеРегл		 	  					КАК ПостатейныеРегл
	|	ИЗ
	|		ВТСтоимостьТоваров КАК СтоимостьТоваров
	|	) КАК СтоимостьТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваров.ДокументДвижения,
	|	СтоимостьТоваров.Период,
	|	СтоимостьТоваров.Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета,
	|	СтоимостьТоваров.Партия,
	|	СтоимостьТоваров.АналитикаУчетаПартий,
	|	СтоимостьТоваров.АналитикаФинансовогоУчета,
	|	СтоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СтоимостьТоваров.ДокументДвижения														КАК ДокументДвижения,
	|	СтоимостьТоваров.Период 																КАК Период,
	|
	|	СтоимостьТоваров.Организация 															КАК Организация,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 											КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.ВидЗапасов 															КАК ВидЗапасов,
	|	СтоимостьТоваров.РазделУчета 															КАК РазделУчета,
	|
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.Стоимость * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК Стоимость,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансовая * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК СтоимостьЗабалансовая,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходы * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК СтоимостьДопРасходы,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходыБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК СтоимостьДопРасходыБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.Трудозатраты * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК Трудозатраты,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеСНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ПостатейныеСНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеБезНДС * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ПостатейныеБезНДС,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансоваяРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостояннаяРазница * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ВременнаяРазница * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ВременнаяРазница,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ДопРасходыРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ДопРасходыРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ТрудозатратыРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ТрудозатратыРегл,
	|	СУММА(
	|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеРегл * СтоимостьТоваров.Количество
	|				 / Обороты.Количество КАК ЧИСЛО (23, 10)))									КАК ПостатейныеРегл
	|ИЗ
	|	ВТСтоимостьТоваров КАК СтоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОборотыКоличествоБезПартий КАК Обороты
	|			ПО СтоимостьТоваров.АналитикаУчетаНоменклатуры  = Обороты.АналитикаУчетаНоменклатуры
	|			И СтоимостьТоваров.РазделУчета 					= Обороты.РазделУчета
	|			И СтоимостьТоваров.ВидЗапасов 					= Обороты.ВидЗапасов
	|			И СтоимостьТоваров.Организация 					= Обороты.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьТоваров.ДокументДвижения,
	|	СтоимостьТоваров.Период,
	|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СтоимостьТоваров.РазделУчета,
	|	СтоимостьТоваров.ВидЗапасов,
	|	СтоимостьТоваров.Организация,
	|	Обороты.Количество
	|";
	
	// Сформируем движения по регистру сведений СтоимостьТоваров (без партий)
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя,
		Запрос);
	
	// Завершим расчет
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТОборотыКоличествоСПартиями, ВТОстаткиСтоимости, ВТСтоимостьТоваровБезВидаУчета,
		|ВТОборотыКоличествоБезПартий, ВТСтоимостьТоваров, ВТСтоимостьПартийТоваровВременная");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 3.9
Процедура СтоимостьНезавершенногоПроизводства(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СтоимостьНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ПараметрыРасчета.КоличествоУзлов <> 0 Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УзлыКорректировки.Организация 				КАК Организация,
		|	Аналитика.Ссылка							КАК ДокументИсточник,
		|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА УзлыКорректировки.АналитикаФинансовогоУчета ИНАЧЕ Аналитика.Подразделение КОНЕЦ КАК Подразделение,
		|	Аналитика.НаправлениеДеятельности 			КАК НаправлениеДеятельности,
		|	Аналитика.СтатьяРасходов 					КАК СтатьяРасходов,
		|	Аналитика.АналитикаРасходов 				КАК АналитикаРасходов,
		|	УзлыКорректировки.Партия					КАК Партия,
		|	ТаблицаРешений.Стоимость 				 	КАК Стоимость,
		|	ТаблицаРешений.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
		|	ТаблицаРешений.ПостояннаяРазница 			КАК ПостояннаяРазница,
		|	ТаблицаРешений.ВременнаяРазница 			КАК ВременнаяРазница,
		|	ТаблицаРешений.СтоимостьДопРасходы 			КАК СтоимостьДопРасходы,
		|	ТаблицаРешений.СтоимостьДопРасходыБезНДС 	КАК СтоимостьДопРасходыБезНДС,
		|	ТаблицаРешений.СтоимостьЗабалансовая 		КАК СтоимостьЗабалансовая,
		|	ТаблицаРешений.Трудозатраты 				КАК Трудозатраты,
		|	ТаблицаРешений.ПостатейныеСНДС 				КАК ПостатейныеСНДС,
		|	ТаблицаРешений.ПостатейныеБезНДС 			КАК ПостатейныеБезНДС,
		|	0 											КАК СтоимостьРегл,
		|	0 											КАК СтоимостьЗабалансоваяРегл,
		|	0 											КАК ДопРасходыРегл,
		|	0 											КАК ТрудозатратыРегл,
		|	0 											КАК ПостатейныеРегл
		|
		|ПОМЕСТИТЬ ВтСтоимостиНезавершенногоПроизводства
		|ИЗ
		|	ВтТаблицаРешений КАК ТаблицаРешений
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ВтУзлыКорректировки КАК УзлыКорректировки
		|	ПО
		|		ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ВтАналитикаУчетаРасходов КАК Аналитика
		|	ПО
		|		УзлыКорректировки.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		|ГДЕ
		|	(ТаблицаРешений.Стоимость <> 0
		|		ИЛИ ТаблицаРешений.СтоимостьБезНДС <> 0
		|		ИЛИ ТаблицаРешений.СтоимостьДопРасходы <> 0
		|		ИЛИ ТаблицаРешений.СтоимостьДопРасходыБезНДС <> 0
		|		ИЛИ ТаблицаРешений.СтоимостьЗабалансовая <> 0
		|		ИЛИ ТаблицаРешений.Трудозатраты <> 0
		|		ИЛИ ТаблицаРешений.ПостатейныеСНДС <> 0
		|		ИЛИ ТаблицаРешений.ПостатейныеБезНДС <> 0)
		|	И УзлыКорректировки.АналитикаУчетаНоменклатуры ССЫЛКА Документ.РаспределениеПрочихЗатрат
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Подразделение,
		|	НаправлениеДеятельности,
		|	СтатьяРасходов,
		|	АналитикаРасходов,
		|	Партия
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) 				 КАК Организация,
		|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)	 КАК ДокументИсточник,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) 		 КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	 КАК НаправлениеДеятельности,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) 				 КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО												 КАК Партия,
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК СтоимостьДопРасходы,
		|	0 КАК СтоимостьДопРасходыБезНДС,
		|	0 КАК СтоимостьЗабалансовая,
		|	0 КАК Трудозатраты,
		|	0 КАК ПостатейныеСНДС,
		|	0 КАК ПостатейныеБезНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеРегл
		|
		|ПОМЕСТИТЬ ВтСтоимостиНезавершенногоПроизводства
		|";
	КонецЕсли;
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтСтоимостиНезавершенногоПроизводства");
	Запрос.Выполнить();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

// Этап 3.10
// Формирует временную таблицу узлов корректировки - ВтУзлыКорректировки.
//
Процедура СформироватьУзлыКорректировкиСписанияСтоимостиРегл(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьУзлыКорректировкиСписанияСтоимостиРегл");
	
	ТекстЗапроса =
	"
	// Данные об аналитике для расчета.
	|//ПредварительныйРасчет ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ПОМЕСТИТЬ ВтАналитикаНоменклатуры
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|//ПредварительныйРасчет
	|//ПредварительныйРасчет ОБЪЕДИНИТЬ
	|//ПредварительныйРасчет 
	|//ПредварительныйРасчет ВЫБРАТЬ
	|//ПредварительныйРасчет	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|//ПредварительныйРасчет	УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|//ПредварительныйРасчет	УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов
	|//ПредварительныйРасчет ИЗ
	|//ПредварительныйРасчет	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|//ПредварительныйРасчет		РазделУчета = Значение(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|//ПредварительныйРасчет		И Организация В (&МассивОрганизаций)
	|//ПредварительныйРасчет	) КАК УчетСебестоимости
	|//ПредварительныйРасчет ;
	|////////////////////////////////////////////////////////////////////////////////
	|
	// Данные о движении товаров за период.
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация                КАК Организация,
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.РазделУчета                КАК РазделУчета,
	|	ВложенныйЗапрос.ВидЗапасов                 КАК ВидЗапасов,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ									   КАК Партия,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ									   КАК АналитикаУчетаПартий,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ									   КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ									   КАК ВидДеятельностиНДС,
	|
	|	СУММА(ВложенныйЗапрос.Количество)          КАК Количество,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Стоимость) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(23,10))   КАК Стоимость,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23,10))  КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ПостояннаяРазница) < 0 И СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				-ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостояннаяРазница) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостояннаяРазница) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  КАК ПостояннаяРазница,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.ПостояннаяРазница) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР
	|			КОГДА СУММА(ВложенныйЗапрос.ВременнаяРазница) < 0 И СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				-ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|				ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23,10))  КАК ВременнаяРазница,
	|	(ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.ВременнаяРазница) < 0 ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК ВременнаяРазницаЗнак,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьДопРасходы) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(23,10))   КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23,10))  КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СтоимостьЗабалансовая) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(23,10))   КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Трудозатраты) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(23,10))   КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА СУММА(ВложенныйЗапрос.Количество) <> 0 ТОГДА
	|			ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ПостатейныеСНДС) КАК ЧИСЛО(23,10)) / СУММА(ВложенныйЗапрос.Количество)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО(23,10))   КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23,10))  КАК ПостатейныеБезНДС
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|
	|	(ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			 И УчетСебестоимости.Количество < 0
	|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|				ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Количество,
	// Данные о суммах внешних поступлений.
	|		ВЫБОР КОГДА (УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|			ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|		 И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		 И УчетСебестоимости.Количество = 0
	|		 И НЕ &ПредварительныйРасчет ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И УчетСебестоимости.РасчетСебестоимости
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И УчетСебестоимости.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			И (УчетСебестоимости.Количество <> 0 ИЛИ &СредняяЗаМесяц ИЛИ &ПартионныйУчетВерсии22)
	|		ТОГДА
	|			УчетСебестоимости.СтоимостьРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК Стоимость,
	|
	|		ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход И &ПартионныйУчетВерсии22
	|				ТОГДА УчетСебестоимости.ДопРасходыРегл
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|				И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|				И УчетСебестоимости.Количество = 0
	|				И НЕ &СредняяЗаМесяц
	|				И НЕ УчетСебестоимости.РасчетСебестоимости
	|			ТОГДА
	|				УчетСебестоимости.СтоимостьРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СтоимостьДопРасходы,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВременнаяРазница,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация В (&МассивОперацийПоступление)
	|			И УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.СтоимостьЗабалансоваяРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК СтоимостьЗабалансовая,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ТрудозатратыРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК Трудозатраты,
	|		ВЫБОР КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА
	|				УчетСебестоимости.ПостатейныеРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ                                        КАК ПостатейныеСНДС
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|		//ПредварительныйРасчет		ГДЕ
	|		//ПредварительныйРасчет    		(УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет			УчетСебестоимости.РазделУчета,
	|		//ПредварительныйРасчет			УчетСебестоимости.ВидЗапасов)
	|		//ПредварительныйРасчет				В
	|		//ПредварительныйРасчет				(ВЫБРАТЬ
	|		//ПредварительныйРасчет					АналитикаУчетаНоменклатуры,
	|		//ПредварительныйРасчет					РазделУчета,
	|		//ПредварительныйРасчет					ВидЗапасов
	|		//ПредварительныйРасчет			 	ИЗ ВтАналитикаНоменклатуры)
	|	
	////////////////////// Эта часть для предварительного расчета стоимости.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
			// Данные по всем движениям за период. По "внешним" приходам собираются суммы и количество поступления.
	|		УчетСебестоимости.Организация                КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                 КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|
	|		УчетСебестоимости.Количество                 КАК Количество,
			// Данные о суммах внешних поступлений.
	|		УчетСебестоимости.СтоимостьРегл              КАК Стоимость,
	|		УчетСебестоимости.ДопРасходыРегл             КАК СтоимостьДопРасходы,
	|		УчетСебестоимости.ПостояннаяРазница          КАК ПостояннаяРазница,
	|		УчетСебестоимости.ВременнаяРазница           КАК ВременнаяРазница,
	|		УчетСебестоимости.СтоимостьЗабалансоваяРегл  КАК СтоимостьЗабалансовая,
	|		УчетСебестоимости.ТрудозатратыРегл           КАК Трудозатраты,
	|		УчетСебестоимости.ПостатейныеРегл            КАК ПостатейныеСНДС
	|	ИЗ
	|		ВТВозвраты КАК УчетСебестоимости
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ // Доп. расходы
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.АналитикаУчетаНоменклатуры 							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета                							КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		0                                  							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		Таблица.ДопРасходыРегл             							КАК СтоимостьДопРасходы,
	|		0                                  							КАК ПостояннаяРазница,
	|		0                                  							КАК ВременнаяРазница,
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		0                                  							КАК ПостатейныеСНДС
	|
	|	ИЗ
	|		ВТДопРасходов КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам на начало расчетного периода.
	|	ВЫБРАТЬ
	|		УчетСебестоимости.Организация                           КАК Организация,
	|		УчетСебестоимости.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.РазделУчета                           КАК РазделУчета,
	|		УчетСебестоимости.ВидЗапасов                            КАК ВидЗапасов,
	|		УчетСебестоимости.Партия                     			КАК Партия,
	|		УчетСебестоимости.АналитикаУчетаПартий       			КАК АналитикаУчетаПартий,
	|		УчетСебестоимости.АналитикаФинансовогоУчета  			КАК АналитикаФинансовогоУчета,
	|		УчетСебестоимости.ВидДеятельностиНДС         			КАК ВидДеятельностиНДС,
	|		УчетСебестоимости.КоличествоОстаток                     КАК Количество,
	|		УчетСебестоимости.СтоимостьРеглОстаток                  КАК Стоимость,
	|		УчетСебестоимости.ДопРасходыРеглОстаток                 КАК СтоимостьДопРасходы,
	|		УчетСебестоимости.ПостояннаяРазницаОстаток              КАК ПостояннаяРазница,
	|		УчетСебестоимости.ВременнаяРазницаОстаток               КАК ВременнаяРазница,
	|		УчетСебестоимости.СтоимостьЗабалансоваяРеглОстаток  	КАК СтоимостьЗабалансовая,
	|		УчетСебестоимости.ТрудозатратыРеглОстаток           	КАК Трудозатраты,
	|		УчетСебестоимости.ПостатейныеРеглОстаток            	КАК ПостатейныеСНДС
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|			//ПредварительныйРасчет И (АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов)
	|			//ПредварительныйРасчет В
	|			//ПредварительныйРасчет (ВЫБРАТЬ
	|			//ПредварительныйРасчет 	АналитикаУчетаНоменклатуры,
	|			//ПредварительныйРасчет 	РазделУчета,
	|			//ПредварительныйРасчет 	ВидЗапасов
	|			//ПредварительныйРасчет	ИЗ ВтАналитикаНоменклатуры)
	|		) КАК УчетСебестоимости
	|ГДЕ
	|	УчетСебестоимости.КоличествоОстаток <> 0
	//++ НЕ УТ
	//////////////////////////////////////////////////////////////////////////////
	|	ОБЪЕДИНИТЬ ВСЕ
	// Данные по прочим расходам незавершенного производства 22.
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.Регистратор                							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета                							КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		Таблица.ИдентификаторПартии        							КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		Таблица.Подразделение										КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		Таблица.Количество                 							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьДопРасходы,
	|		Таблица.ПостояннаяРазница          							КАК ПостояннаяРазница,
	|		Таблица.Временнаяразница           							КАК ВременнаяРазница,
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		Таблица.СуммаРегл                  							КАК ПостатейныеСНДС
	|	ИЗ
	|		ВтНезавершенноеПроизводство КАК Таблица
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по прочим расходам незавершенного производства 21.
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.Регистратор                							КАК АналитикаУчетаНоменклатуры,
	|		Таблица.РазделУчета                							КАК РазделУчета,
	|		Таблица.ВидЗапасов                 							КАК ВидЗапасов,
	|		Таблица.Партия                     			 				КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО  								 				КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		Таблица.Количество                 							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьДопРасходы,
	|		Таблица.ПостояннаяРазница          							КАК ПостояннаяРазница,
	|		Таблица.Временнаяразница           							КАК ВременнаяРазница,
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		Таблица.СуммаРегл                  							КАК ПостатейныеСНДС
	|	ИЗ
	|		ВтНезавершенноеПроизводство КАК Таблица
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Данные по остаткам прочих расходов незавершенного производства.
	|	ВЫБРАТЬ
	|		Таблица.Организация                							КАК Организация,
	|		Таблица.Регистратор                							КАК АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) КАК РазделУчета,
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)				КАК ВидЗапасов,
	|		Таблица.ИдентификаторПартии        							КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		Таблица.Подразделение										КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)  КАК ВидДеятельностиНДС,
	|		Таблица.ПоказательОтнесенияНаВыпуск							КАК Количество,
	|		0                                  							КАК Стоимость,
	|		0                                  							КАК СтоимостьДопРасходы,
	|		Таблица.ПостояннаяРазница          							КАК ПостояннаяРазница,
	|		Таблица.Временнаяразница           							КАК ВременнаяРазница,
	|		0                                  							КАК СтоимостьЗабалансовая,
	|		0                                  							КАК Трудозатраты,
	|		Таблица.СтоимостьРегл              							КАК ПостатейныеСНДС
	|	ИЗ
	|		ВтОстаткиНезавершенногоПроизводства КАК Таблица
	|
	//-- НЕ УТ
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаНоменклатуры,
	|	ВложенныйЗапрос.ВидЗапасов,
	|	ВложенныйЗапрос.РазделУчета,
	|	ВложенныйЗапрос.Организация,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Партия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаУчетаПартий
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.АналитикаФинансовогоУчета
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &РегламентноеЗадание
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ ВложенныйЗапрос.ВидДеятельностиНДС
	|	КОНЕЦ
	|";
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПредварительныйРасчет", "");
	КонецЕсли;

	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Выполнить(); // создание ВтУзлыКорректировки
	
	Если НЕ ПараметрыРасчета.ПредварительныйРасчет
	 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОВзвешеннаяОценка Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиРеглПоФИФО(ПараметрыРасчета, Запрос); // корректировка ВтУзлыКорректировки
	КонецЕсли;

	Если НЕ ПараметрыРасчета.ПредварительныйРасчет Тогда
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтАналитикаНоменклатуры");
	КонецЕсли;
	
	ПараметрыНумерации = УниверсальныеМеханизмыПартийИСебестоимости.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		, // без группировки
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС", // порядок
		"НомерУзла", // поле номера
		"АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, НомерУзла"); // индекс
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВтУзлыКорректировки");
	
	ПараметрыРасчета.КоличествоУзловРегл =
		УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировки");
	
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 3.13
Процедура СтоимостьНезавершенногоПроизводстваРегл(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СтоимостьНезавершенногоПроизводстваРегл");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ПараметрыРасчета.КоличествоУзловРегл <> 0 Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УзлыКорректировки.Организация			КАК Организация,
		|	Аналитика.Ссылка						КАК ДокументИсточник,
		|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА УзлыКорректировки.АналитикаФинансовогоУчета ИНАЧЕ Аналитика.Подразделение КОНЕЦ КАК Подразделение,
		|	Аналитика.НаправлениеДеятельности		КАК НаправлениеДеятельности,
		|	Аналитика.СтатьяРасходов,
		|	Аналитика.АналитикаРасходов,
		|	УзлыКорректировки.Партия,
		|	0 				 						КАК Стоимость,
		|	0 										КАК СтоимостьБезНДС,
		|	ТаблицаРешений.ПостояннаяРазница * ТаблицаРешений.ПостояннаяРазницаЗнак КАК ПостояннаяРазница,
		|	ТаблицаРешений.ВременнаяРазница * ТаблицаРешений.ВременнаяРазницаЗнак   КАК ВременнаяРазница,
		|	0 										КАК СтоимостьДопРасходы,
		|	0 										КАК СтоимостьДопРасходыБезНДС,
		|	0 										КАК СтоимостьЗабалансовая,
		|	0 										КАК Трудозатраты,
		|	0 										КАК ПостатейныеСНДС,
		|	0 										КАК ПостатейныеБезНДС,
		|	ТаблицаРешений.Стоимость 				КАК СтоимостьРегл,
		|	ТаблицаРешений.СтоимостьЗабалансовая	КАК СтоимостьЗабалансоваяРегл,
		|	ТаблицаРешений.СтоимостьДопРасходы 		КАК ДопРасходыРегл,
		|	ТаблицаРешений.Трудозатраты 			КАК ТрудозатратыРегл,
		|	ТаблицаРешений.ПостатейныеСНДС 			КАК ПостатейныеРегл
		|ПОМЕСТИТЬ ВтСтоимостиНезавершенногоПроизводстваРегл
		|ИЗ
		|	ВтТаблицаРешений КАК ТаблицаРешений
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ВтУзлыКорректировки КАК УзлыКорректировки
		|	ПО
		|		ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ВтАналитикаУчетаРасходов КАК Аналитика
		|	ПО
		|		УзлыКорректировки.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		|ГДЕ
		|	(ТаблицаРешений.Стоимость <> 0 ИЛИ ТаблицаРешений.ВременнаяРазница <> 0 ИЛИ ТаблицаРешений.ПостояннаяРазница <> 0
		|	ИЛИ ТаблицаРешений.СтоимостьЗабалансовая <> 0 ИЛИ ТаблицаРешений.СтоимостьДопРасходы <> 0
		|	ИЛИ ТаблицаРешений.Трудозатраты <> 0 ИЛИ ТаблицаРешений.ПостатейныеСНДС <> 0)
		|	И УзлыКорректировки.АналитикаУчетаНоменклатуры ССЫЛКА Документ.РаспределениеПрочихЗатрат
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Подразделение,
		|	НаправлениеДеятельности,
		|	СтатьяРасходов,
		|	АналитикаРасходов,
		|	Партия
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)				 КАК Организация,
		|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)	 КАК ДокументИсточник,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		 КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	 КАК НаправлениеДеятельности,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК СтоимостьДопРасходы,
		|	0 КАК СтоимостьДопРасходыБезНДС,
		|	0 КАК СтоимостьЗабалансовая,
		|	0 КАК Трудозатраты,
		|	0 КАК ПостатейныеСНДС,
		|	0 КАК ПостатейныеБезНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеРегл
		|ПОМЕСТИТЬ ВтСтоимостиНезавершенногоПроизводстваРегл
		|";
	КонецЕсли;
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтСтоимостиНезавершенногоПроизводстваРегл");
	Запрос.Выполнить();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

// Этап 3.14
// Процедура рассчитывает отклонения в суммах движений по регистру СебестоимостьТоваров от рассчитанной себестоимости 
// и производит корректировку движений следующих регистров:
// СебестоимостьТоваров, ПрочиеРасходы
//
Процедура СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияЗапасов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		ДД.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета
	|ПОМЕСТИТЬ
	|	ЕстьВозвратныеОтходы
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.Количество < 0
	//++ НЕ УТКА
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа)
	//-- НЕ УТКА
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ИСТИНА КАК РаботаДляДавальца
	|ПОМЕСТИТЬ
	|	РаботыДляДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	|	И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|	И &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ИСТИНА КАК РаботаДляДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	И НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период                        	КАК Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   							КАК ВидДвижения,
	|	УчетСебестоимости.Регистратор                   	КАК ДокументДвижения,
	|	УчетСебестоимости.Организация                   	КАК Организация,
	|	АналитикаНоменклатуры.Склад                     	КАК Склад,
	|	АналитикаНоменклатуры.Номенклатура             		КАК Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры    	КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|		ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	УчетСебестоимости.ВидЗапасов                    	КАК ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов            	КАК ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация         	КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры 	КАК КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.Склад                  	КАК КорСклад,
	|	КорАналитикаНоменклатуры.Номенклатура           	КАК КорНоменклатура,
	|	УчетСебестоимости.КорРазделУчета                	КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов                 	КАК КорВидЗапасов,
	|	УчетСебестоимости.КорВидЗапасов.ТипЗапасов         	КАК КорТипЗапасов,
	|	УчетСебестоимости.КорОрганизация                	КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение                 	КАК Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам     	КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента                  	КАК ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов            		КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания        	КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов 			  КАК ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.СтатьяДоходов                 	КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов              	КАК АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов         	КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов      	КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки           	КАК ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки                     	КАК КодСтроки,
	|	УчетСебестоимости.ПериодПродажи                 	КАК ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции               	КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(КорНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL
	|	 И УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПоКомиссииМеждуОрганизациями 
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ 												КАК СторноОтчетПоКомиссии,
	|	УчетСебестоимости.Партия                          	КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия                 		КАК КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий           КАК КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета      КАК КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС             КАК КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции                 КАК СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи                 		КАК ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник                 	КАК ДокументИсточник,
	|	УчетСебестоимости.АналитикаУчетаПартийПроизводства  КАК АналитикаУчетаПартийПроизводства,
	|	ЕСТЬNULL(РаботыДляДавальца.РаботаДляДавальца, ЛОЖЬ) КАК ПродукцияДавальца,
	|	ЛОЖЬ												КАК РаботаДляДавальца,
	|	СУММА(УчетСебестоимости.Количество)        			КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость)              	КАК Стоимость,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС)        	КАК СтоимостьБезНДС,
	|	СУММА(УчетСебестоимости.СтоимостьРегл)          	КАК СтоимостьРегл,
	|	СУММА(УчетСебестоимости.ПостояннаяРазница)      	КАК ПостояннаяРазница,
	|	СУММА(УчетСебестоимости.ВременнаяРазница)       	КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая)      КАК СтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл)  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.КорСтоимость)           	КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.НДСРегл)           			КАК НДСРегл
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ СторноОтчетыКомиссионера КАК СторноОтчетыКомиссионера
	|		ПО СторноОтчетыКомиссионера.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И СторноОтчетыКомиссионера.РазделУчета = УчетСебестоимости.РазделУчета
	|		И СторноОтчетыКомиссионера.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И СторноОтчетыКомиссионера.Организация = УчетСебестоимости.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК КорНазначения
	|		ПО КорНазначения.Ссылка = КорАналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|ГДЕ
	|	(НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		ИЛИ (УчетСебестоимости.Количество <> 0
	|		И УчетСебестоимости.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|			 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|			 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))))
	|	И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПереносДанных)
	//++ НЕ УТ
	|	И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|		И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	|	И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	//-- НЕ УТ
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	АналитикаНоменклатуры.Склад,
	|	АналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ),
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.Склад,
	|	КорАналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ЕСТЬNULL(КорНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ВЫБОР КОГДА НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL
	|	 И УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПоКомиссииМеждуОрганизациями 
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник,
	|	УчетСебестоимости.АналитикаУчетаПартийПроизводства,
	|	ЕСТЬNULL(РаботыДляДавальца.РаботаДляДавальца, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период                        	КАК Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   							КАК ВидДвижения,
	|	УчетСебестоимости.Регистратор                   	КАК ДокументДвижения,
	|	УчетСебестоимости.Организация                   	КАК Организация,
	|	АналитикаНоменклатуры.Склад                     	КАК Склад,
	|	АналитикаНоменклатуры.Номенклатура             		КАК Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры    	КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|		ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	УчетСебестоимости.ВидЗапасов                    	КАК ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов            	КАК ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация         	КАК ХозяйственнаяОперация,
	|	РаботыДляДавальца.АналитикаУчетаНоменклатуры 		КАК КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.Склад                  	КАК КорСклад,
	|	КорАналитикаНоменклатуры.Номенклатура           	КАК КорНоменклатура,
	|	РаботыДляДавальца.РазделУчета                		КАК КорРазделУчета,
	|	РаботыДляДавальца.ВидЗапасов                 		КАК КорВидЗапасов,
	|	РаботыДляДавальца.ТипЗапасов         				КАК КорТипЗапасов,
	|	УчетСебестоимости.КорОрганизация                	КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение                 	КАК Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам     	КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента                  	КАК ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов            		КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания        	КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов 			  КАК ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.СтатьяДоходов                 	КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов              	КАК АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов         	КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов      	КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки           	КАК ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки                     	КАК КодСтроки,
	|	УчетСебестоимости.ПериодПродажи                 	КАК ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции               	КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(КорНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	|	ЛОЖЬ 												КАК СторноОтчетПоКомиссии,
	|	УчетСебестоимости.Партия                          	КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия                 		КАК КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий           КАК КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета      КАК КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС             КАК КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции                 КАК СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи                 		КАК ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник                 	КАК ДокументИсточник,
	|	УчетСебестоимости.АналитикаУчетаПартийПроизводства  КАК АналитикаУчетаПартийПроизводства,
	|	ЛОЖЬ												КАК ПродукцияДавальца,
	|	ИСТИНА												КАК РаботаДляДавальца,
	|	СУММА(УчетСебестоимости.Количество)        			КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость)              	КАК Стоимость,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС)        	КАК СтоимостьБезНДС,
	|	СУММА(УчетСебестоимости.СтоимостьРегл)          	КАК СтоимостьРегл,
	|	СУММА(УчетСебестоимости.ПостояннаяРазница)      	КАК ПостояннаяРазница,
	|	СУММА(УчетСебестоимости.ВременнаяРазница)       	КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая)      КАК СтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл)  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.КорСтоимость)           	КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.НДСРегл)           			КАК НДСРегл
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО РаботыДляДавальца.АналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК КорНазначения
	|		ПО КорНазначения.Ссылка = КорАналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПереносДанных)
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	АналитикаНоменклатуры.Склад,
	|	АналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ),
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	РаботыДляДавальца.АналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.Склад,
	|	КорАналитикаНоменклатуры.Номенклатура,
	|	РаботыДляДавальца.РазделУчета,
	|	РаботыДляДавальца.ВидЗапасов,
	|	РаботыДляДавальца.ТипЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходов,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ЕСТЬNULL(КорНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник,
	|	УчетСебестоимости.АналитикаУчетаПартийПроизводства
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Организация,
	|	РазделУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                        КАК Период,
	|	ТаблицаКорректировки.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаКорректировки.Организация                   КАК Организация,
	|	ТаблицаКорректировки.Склад                         КАК Склад,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		ИНАЧЕ ТаблицаКорректировки.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов                    КАК ВидЗапасов,
	|	ЕСТЬNULL(ТаблицаКорректировки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.КорСклад                      КАК КорСклад,
	|	ТаблицаКорректировки.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаКорректировки.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ЕСТЬNULL(ТаблицаКорректировки.КорТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК КорТипЗапасов,
	|	ТаблицаКорректировки.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаКорректировки.Подразделение                 КАК Подразделение,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.ЗаказКлиента                  КАК ЗаказКлиента,
	|	ТаблицаКорректировки.АналитикаРасходов             КАК АналитикаРасходов,
	|	ТаблицаКорректировки.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходов  КАК ВариантРаспределенияРасходов,
	|	ТаблицаКорректировки.ПринятиеКНалоговомуУчету      КАК ПринятиеКНалоговомуУчету,
	|	ТаблицаКорректировки.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	ТаблицаКорректировки.СтатьяДоходов                 КАК СтатьяДоходов,
	|	ТаблицаКорректировки.АналитикаДоходов              КАК АналитикаДоходов,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаКорректировки.КодСтроки                     КАК КодСтроки,
	|	ТаблицаКорректировки.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаКорректировки.ГруппаПродукции               КАК ГруппаПродукции,
	|	ТаблицаКорректировки.СторноОтчетПоКомиссии		   КАК СторноОтчетПоКомиссии,
	|	ТаблицаКорректировки.Партия                        КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.КорПартия                 	   КАК КорПартия,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаКорректировки.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.ТипЗаписи                 	   КАК ТипЗаписи,
	|	ТаблицаКорректировки.ДокументИсточник              КАК ДокументИсточник,
	|	ТаблицаКорректировки.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	//++ НЕ УТ
	|	ВЫБОР ЕСТЬNULL(ПартииТМЦВЭксплуатации.СпособПогашенияСтоимостиНУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	|	
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ТаблицаКорректировки.ВидЗапасов
	|		ИНАЧЕ 
	|			ТаблицаКорректировки.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ТаблицаКорректировки.КорВидЗапасов
	|		ИНАЧЕ 
	|			ТаблицаКорректировки.КорНоменклатура
	|	КОНЕЦ КАК КорИсточникГФУНоменклатуры,
	|	ВЫБОР КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (&МассивОперацийПередачи) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ                                              КАК ЭтоПередачаМеждуОрганизациями,
	|	ТаблицаКорректировки.КорСтоимость                  КАК КорСтоимость,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.Стоимость
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.Стоимость, 0) КАК ЧИСЛО(15,2))
	|		- ТаблицаКорректировки.Стоимость
	|	КОНЕЦ) КАК Стоимость,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.РаботаДляДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(15,2))
	|		- ТаблицаКорректировки.СтоимостьЗабалансовая
	|	КОНЕЦ) КАК СтоимостьЗабалансовая,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьБезНДС
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьБезНДС, 0) КАК ЧИСЛО(15,2))
	|		- ТаблицаКорректировки.СтоимостьБезНДС
	|	КОНЕЦ) КАК СтоимостьБезНДС,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостояннаяРазница, 0)  КАК ЧИСЛО(15,2))
	|		 	- ТаблицаКорректировки.ПостояннаяРазница КОНЕЦ) КАК ПостояннаяРазница,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ВременнаяРазница, 0)  КАК ЧИСЛО(15,2))
	|		 	- ТаблицаКорректировки.ВременнаяРазница КОНЕЦ) КАК ВременнаяРазница,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходы, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК СуммаДопРасходов,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК СуммаДопРасходовБезНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.Трудозатраты, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК Трудозатраты,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеСНДС, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК ПостатейныеСНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеБезНДС, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК ПостатейныеБезНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК ДопРасходыРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК ТрудозатратыРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеРегл, 0) КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК ПостатейныеРегл,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьРегл
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(15,2))
	|		 	- ТаблицаКорректировки.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.РаботаДляДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(15,2))
	|	 		- ТаблицаКорректировки.СтоимостьЗабалансоваяРегл КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|
	|	ТаблицаКорректировки.НДСРегл КАК НДСРегл,
	|	ТаблицаКорректировки.Стоимость КАК ИсходнаяСтоимость,
	|	ТаблицаКорректировки.СтоимостьБезНДС КАК ИсходнаяСтоимостьБезНДС,
	|	ТаблицаКорректировки.СтоимостьРегл КАК ИсходнаяСтоимостьРегл,
	|	ТаблицаКорректировки.Количество КАК Количество
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТСтоимостьПартийТоваров КАК СтоимостьТоваров
	|	ПО 
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 	= ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И СтоимостьТоваров.ВидЗапасов               	= ТаблицаКорректировки.ВидЗапасов
	|		И СтоимостьТоваров.Организация              	= ТаблицаКорректировки.Организация
	|		И СтоимостьТоваров.РазделУчета              	= ТаблицаКорректировки.РазделУчета
	|		И СтоимостьТоваров.Партия 						= ТаблицаКорректировки.Партия
	|		И СтоимостьТоваров.АналитикаУчетаПартий 		= ТаблицаКорректировки.АналитикаУчетаПартий
	|		И СтоимостьТоваров.АналитикаФинансовогоУчета 	= ТаблицаКорректировки.АналитикаФинансовогоУчета
	|		И СтоимостьТоваров.ВидДеятельностиНДС 			= ТаблицаКорректировки.ВидДеятельностиНДС
	|		И ТаблицаКорректировки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	//++ НЕ УТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ПередачиВЭксплуатацию
	|	ПО ТаблицаКорректировки.ДокументДвижения = ПередачиВЭксплуатацию.Ссылка
	|		И ТаблицаКорректировки.ИдентификаторСтроки = ПередачиВЭксплуатацию.ИдентификаторСтроки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦВЭксплуатации
	|	ПО ПередачиВЭксплуатацию.ПартияТМЦВЭксплуатации = ПартииТМЦВЭксплуатации.Ссылка
	//-- НЕ УТ
	|ГДЕ
	|	НЕ ТаблицаКорректировки.СторноОтчетПоКомиссии
	|";
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		// Корректировка списания товаров
		СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, Выборка, Выборка.ВидДвижения);

		// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
		Если ЗначениеЗаполнено(Выборка.КорРазделУчета)
		 И НЕ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
		 И НЕ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
				И Выборка.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) Тогда
			
			СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, Выборка);
			
		КонецЕсли;
			
		// Сторнирование себестоимости товаров по управленческой организации.
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет Тогда

			СформироватьДвиженияСебестоимостьТоваровСторноВУпрУчете(ПараметрыРасчета, Выборка);

		КонецЕсли;

		// Корректировка списания товаров на затраты в регистре учет прочих расходов.
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
			//++ НЕ УТ
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставОС
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставНМА
			//-- НЕ УТ
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
			Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании)
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда
		
			ЭтоВыпускПродукции = Ложь;
			//++ НЕ УТ
			ЭтоВыпускПродукции = (ТипЗнч(Выборка.ДокументДвижения) = Тип("ДокументСсылка.ВыпускПродукции"));
			//-- НЕ УТ
			Если ЗначениеЗаполнено(Выборка.СтатьяАктивовПассивов) Тогда
				СформироватьДвиженияПрочиеАктивыПассивы(
					ПараметрыРасчета,
					Выборка,
					Выборка.Стоимость
					+ Выборка.СуммаДопРасходов
					+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0)
					+ Выборка.Трудозатраты
					+ Выборка.ПостатейныеСНДС);
			Иначе
				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					Выборка.Стоимость
						+ Выборка.СуммаДопРасходов
						+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимость, 0)
						+ Выборка.Трудозатраты
						+ Выборка.ПостатейныеСНДС,
					Выборка.СтоимостьБезНДС
						+ Выборка.СуммаДопРасходовБезНДС
						+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьБезНДС, 0)
						+ Выборка.Трудозатраты
						+ Выборка.ПостатейныеБезНДС,
					Выборка.СтоимостьРегл
						+ Выборка.ДопРасходыРегл
						+ ?(ЭтоВыпускПродукции, Выборка.ИсходнаяСтоимостьРегл, 0)
						+ Выборка.ТрудозатратыРегл
						+ Выборка.ПостатейныеРегл,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);
			КонецЕсли;
		КонецЕсли;

		// Формирование прочих доходов\расходов при пересортице
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
		 И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда

			СуммаПереоценки = Выборка.Стоимость + Выборка.СуммаДопРасходов - Выборка.КорСтоимость + Выборка.Трудозатраты + Выборка.ПостатейныеСНДС;
			Если СуммаПереоценки > 0 Тогда 

				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					СуммаПереоценки,
					Выборка.СтоимостьБезНДС
						+ Выборка.СуммаДопРасходовБезНДС
						+ Выборка.Трудозатраты
						+ Выборка.ПостатейныеБезНДС,
					Выборка.СтоимостьРегл
						+ Выборка.ДопРасходыРегл
						+ Выборка.ТрудозатратыРегл
						+ Выборка.ПостатейныеРегл,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);

			ИначеЕсли СуммаПереоценки < 0 Тогда

				СформироватьДвиженияПрочиеДоходы(
					ПараметрыРасчета,
					Выборка,
					-СуммаПереоценки);

			КонецЕсли;

		КонецЕсли;

		// Формирование прочих расходов при порче
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
		 И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию
		 И Выборка.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку Тогда

			СуммаПереоценки = Выборка.Стоимость + Выборка.СуммаДопРасходов - Выборка.КорСтоимость + Выборка.Трудозатраты + Выборка.ПостатейныеСНДС;

			Если СуммаПереоценки <> 0 Тогда
				
				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					СуммаПереоценки,
					Выборка.СтоимостьБезНДС
						+ Выборка.СуммаДопРасходовБезНДС
						+ Выборка.Трудозатраты
						+ Выборка.ПостатейныеБезНДС,
					Выборка.СтоимостьРегл
						+ Выборка.ДопРасходыРегл
						+ Выборка.ТрудозатратыРегл
						+ Выборка.ПостатейныеРегл,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);

			КонецЕсли;

		КонецЕсли;

		// Формирование прочих доходов/расходов при возврате товаров поставщику.
		Если ((Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
			И Выборка.КорСтоимость <> 0)
			ИЛИ (Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
				И Выборка.КорСтоимость <> 0)
			ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
			ИЛИ Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары)
			И ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
			
			СуммаПереоценки = Выборка.Стоимость + Выборка.СуммаДопРасходов + Выборка.Трудозатраты + Выборка.ПостатейныеСНДС;
			СуммаПереоценкиБезНДС = Выборка.СтоимостьБезНДС
						+ Выборка.СуммаДопРасходовБезНДС
						+ Выборка.Трудозатраты
						+ Выборка.ПостатейныеБезНДС;
			СуммаПереоценкиРегл = Выборка.СтоимостьРегл
						+ Выборка.ДопРасходыРегл
						+ Выборка.ТрудозатратыРегл
						+ Выборка.ПостатейныеРегл;

			Если СуммаПереоценки > 0 Или СуммаПереоценкиБезНДС > 0 Или СуммаПереоценкиРегл > 0
				Или Выборка.ПостояннаяРазница > 0 Или Выборка.ВременнаяРазница > 0 Тогда 

				СформироватьДвиженияПрочиеРасходы(
					ПараметрыРасчета,
					Выборка,
					СуммаПереоценки,
					СуммаПереоценкиБезНДС,
					СуммаПереоценкиРегл,
					Выборка.ПостояннаяРазница,
					Выборка.ВременнаяРазница);

			ИначеЕсли СуммаПереоценки < 0 Тогда

				СформироватьДвиженияПрочиеДоходы(
					ПараметрыРасчета,
					Выборка,
					- СуммаПереоценки);

			КонецЕсли;
			
		КонецЕсли;
		
		// Корректировка движений по оборотным регистрам управленческого учета.
		СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, ЕстьВозвратныеОтходы, РаботыДляДавальца");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 3.15
Процедура СкорректироватьСтоимостьСписанияНезавершенногоПроизводства21(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов, 
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС
	|ПОМЕСТИТЬ
	|	Выпуски
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	//-- НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика)
	|;
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Движения.Регистратор) = ТИП(Документ.ВыпускПродукции)
	|			ТОГДА ВЫРАЗИТЬ(Движения.Регистратор КАК Документ.ВыпускПродукции).Дата
	|		ИНАЧЕ Движения.Период
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Движения.Регистратор КАК ДокументДвижения,
	|	Движения.Организация КАК Организация,
	|	Движения.ПартияПроизводства КАК ПартияПроизводства,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	Движения.Этап КАК Этап,
	|	Движения.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Движения.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	Движения.РазделУчета КАК РазделУчета,
	|	Движения.ВидЗапасов КАК ВидЗапасов,
	|	Движения.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	Движения.АналитикаУчетаПродукции.Назначение КАК Назначение,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	Движения.Подразделение КАК Подразделение,
	|	Распределение.Подразделение КАК ИсходноеПодразделение,
	|	Распределение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Движения.АналитикаРасходов КАК АналитикаРасходов,
	|	Движения.СтатьяРасходов КАК СтатьяРасходов,
	|	Движения.СтатьяРасходов.КосвенныеЗатратыНУ КАК КосвенныеЗатратыНУ,
	|	Движения.СтатьяРасходов.ПринятиеКНалоговомуУчету КАК ПринимаемыеВНУ,
	|	Движения.Продукция КАК Продукция,
	|	Движения.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Движения.ГруппаПродукции КАК ГруппаПродукции,
	|	ВЫБОР КОГДА Движения.СлужебноеВидДвиженияПриход
	|		ТОГДА Движения.Регистратор
	|		ИНАЧЕ Движения.ДокументИсточник
	|	КОНЕЦ КАК ДокументИсточник,
	|	Движения.ДокументВыпуска КАК ДокументВыпуска,
	|	СУММА(Движения.ДоляСтоимости) КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|		ПО Движения.Регистратор = Распределение.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Движения.АналитикаУчетаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|		ПО АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|		И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|		И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|		И АналитикаПродукцииБезНазначения.Склад = Аналитика.Склад
	|		И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|ГДЕ
	|	Движения.СлужебноеВидДвиженияПриход
	|		ИЛИ НЕ Движения.СлужебноеВидДвиженияПриход
	|		И Движения.ДокументИсточник <> ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.СтатьяРасходов,
	|	Движения.СтатьяРасходов.КосвенныеЗатратыНУ,
	|	Движения.СтатьяРасходов.ПринятиеКНалоговомуУчету,
	|	Движения.АналитикаРасходов,
	|	Распределение.Подразделение,
	|	Распределение.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Движения.Регистратор) = ТИП(Документ.ВыпускПродукции)
	|			ТОГДА ВЫРАЗИТЬ(Движения.Регистратор КАК Документ.ВыпускПродукции).Дата
	|		ИНАЧЕ Движения.Период
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	Движения.Регистратор,
	|	Движения.Подразделение,
	|	Движения.ПартияПроизводства,
	|	Движения.ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция,
	|	Движения.Этап,
	|	Движения.СтатьяКалькуляции,
	|	Движения.ВидЗапасов,
	|	Движения.ВидЗапасов.ТипЗапасов,
	|	Движения.АналитикаУчетаПродукции.Назначение,
	|	Движения.РазделУчета,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Движения.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ),
	|	Движения.Продукция,
	|	Движения.ХарактеристикаПродукции,
	|	Движения.ГруппаПродукции,
	|	Движения.Организация,
	|	ВЫБОР КОГДА Движения.СлужебноеВидДвиженияПриход
	|		ТОГДА Движения.Регистратор
	|		ИНАЧЕ Движения.ДокументИсточник
	|	КОНЕЦ,
	|	Движения.ДокументВыпуска
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ИсходноеПодразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период КАК Период,
	|	ТаблицаКорректировки.ВидДвижения КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения КАК ДокументДвижения,
	|	ТаблицаКорректировки.Организация КАК Организация,
	|	ТаблицаКорректировки.ПартияПроизводства КАК ПартияПроизводства,
	|	ТаблицаКорректировки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаКорректировки.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ТаблицаКорректировки.Этап КАК Этап,
	|	ТаблицаКорректировки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	ТаблицаКорректировки.АналитикаУчетаПродукции КАК АналитикаУчетаПродукцииСебестоимость,
	|	ТаблицаКорректировки.Продукция КАК Продукция,
	|	ТаблицаКорректировки.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ТаблицаКорректировки.РазделУчета КАК РазделУчета,
	|	ЕСТЬNULL(Выпуски.ВидЗапасов, ТаблицаКорректировки.ВидЗапасов) КАК ВидЗапасов,
	|	ЕСТЬNULL(Выпуски.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	|	ЕСТЬNULL(Выпуски.АналитикаУчетаПартий, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПартий,
	|	ЕСТЬNULL(Выпуски.АналитикаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК АналитикаФинансовогоУчета,
	|	ЕСТЬNULL(Выпуски.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаКорректировки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.Подразделение КАК Подразделение,
	|	ТаблицаКорректировки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаКорректировки.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаКорректировки.ГруппаПродукции КАК ГруппаПродукции,
	|	ТаблицаКорректировки.ИсходноеПодразделение КАК ИсходноеПодразделение,
	|	ТаблицаКорректировки.Подразделение КАК КорПодразделение,
	|	ТаблицаКорректировки.ДокументИсточник КАК ДокументИсточник,
	|	ТаблицаКорректировки.ДокументВыпуска КАК ДокументВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартийПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	ТаблицаКорректировки.Количество КАК Количество,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.Стоимость, 0) КАК ЧИСЛО(15,2)) КАК Стоимость,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0) КАК ЧИСЛО(15,2)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходы, 0) КАК ЧИСЛО(15,2)) КАК СуммаДопРасходов,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(15,2)) КАК СуммаДопРасходовБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|		* (ЕСТЬNULL(Стоимости.ПостояннаяРазница, 0)
	|			+ ВЫБОР
	|				КОГДА НЕ ТаблицаКорректировки.ПринимаемыеВНУ ТОГДА ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0)
	|				ИНАЧЕ ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) КОНЕЦ)
	|		КАК ЧИСЛО(15,2)) КАК ПостояннаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|		* (ЕСТЬNULL(Стоимости.ВременнаяРазница, 0)
	|			+ ВЫБОР
	|				КОГДА ТаблицаКорректировки.КосвенныеЗатратыНУ И ТаблицаКорректировки.ПринимаемыеВНУ
	|					ТОГДА ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеРегл, 0)
	|					- ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0)
	|				ИНАЧЕ ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) КОНЕЦ)
	|	КАК ЧИСЛО(15,2)) КАК ВременнаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0) КАК ЧИСЛО(15,2)) КАК СтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(15,2)) 		КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.Трудозатраты, 0) КАК ЧИСЛО(15,2)) 					КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.ПостатейныеСНДС, 0) КАК ЧИСЛО(15,2)) 				КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.ПостатейныеБезНДС, 0) КАК ЧИСЛО(15,2)) 			КАК ПостатейныеБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(15,2)) КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0) КАК ЧИСЛО(15,2)) 			КАК ДопРасходыРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0) КАК ЧИСЛО(15,2)) 			КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ПостатейныеРегл, 0) КАК ЧИСЛО(15,2)) 			КАК ПостатейныеРегл
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО Выпуски.Регистратор = ТаблицаКорректировки.ДокументДвижения
	|		И Выпуски.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаПродукции
	|		И Выпуски.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводства КАК Стоимости
	|	ПО 
	|		ТаблицаКорректировки.Организация = Стоимости.Организация
	|		И ТаблицаКорректировки.ИсходноеПодразделение = Стоимости.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И ТаблицаКорректировки.ПартияПроизводства = Стоимости.Партия
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводстваРегл КАК СтоимостиРегл
	|	ПО 
	|		ТаблицаКорректировки.Организация = СтоимостиРегл.Организация
	|		И ТаблицаКорректировки.ИсходноеПодразделение = СтоимостиРегл.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = СтоимостиРегл.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = СтоимостиРегл.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = СтоимостиРегл.АналитикаРасходов
	|		И ТаблицаКорректировки.ПартияПроизводства = СтоимостиРегл.Партия
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Назначения КАК СпрНазначения
	|	ПО
	|		ТаблицаКорректировки.Назначение = СпрНазначения.Ссылка
	|ГДЕ
	|	ТаблицаКорректировки.Количество <> 0	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.СтатьяРасходов,
	|	ТаблицаКорректировки.АналитикаРасходов,
	|	ТаблицаКорректировки.Подразделение,
	|	ТаблицаКорректировки.ПартияПроизводства,
	|	ТаблицаКорректировки.ЗаказНаПроизводство,
	|	ТаблицаКорректировки.КодСтрокиПродукция,
	|	ТаблицаКорректировки.Этап,
	|	ТаблицаКорректировки.СтатьяКалькуляции,
	|	ТаблицаКорректировки.ГруппаПродукции,
	|	ТаблицаКорректировки.ДокументИсточник,
	|	ТаблицаКорректировки.ДокументВыпуска,
	|	ТаблицаКорректировки.ВидДвижения,
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.ДокументДвижения
	|";
	
	СтрокаОстатка = Новый Структура("Организация, Подразделение, ПартияПроизводства, ЗаказНаПроизводство, КодСтрокиПродукция, Этап,
	|СтатьяКалькуляции, СтатьяРасходов, АналитикаРасходов, ГруппаПродукции, ДокументИсточник, Количество,
	|Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС, СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл");
	
	Суммы = Новый Структура("Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС, СтоимостьРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл");	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеРасходыНезавершенногоПроизводства
	Пока Выборка.Следующий() Цикл
		
		Если СтрокаОстатка.Организация <> Выборка.Организация
		 ИЛИ СтрокаОстатка.Подразделение <> Выборка.Подразделение
		 ИЛИ СтрокаОстатка.ПартияПроизводства <> Выборка.ПартияПроизводства
		 ИЛИ СтрокаОстатка.ЗаказНаПроизводство <> Выборка.ЗаказНаПроизводство
		 ИЛИ СтрокаОстатка.КодСтрокиПродукция <> Выборка.КодСтрокиПродукция
		 ИЛИ СтрокаОстатка.Этап <> Выборка.Этап
		 ИЛИ СтрокаОстатка.СтатьяКалькуляции <> Выборка.СтатьяКалькуляции
		 ИЛИ СтрокаОстатка.СтатьяРасходов <> Выборка.СтатьяРасходов
		 ИЛИ СтрокаОстатка.АналитикаРасходов <> Выборка.АналитикаРасходов
		 ИЛИ СтрокаОстатка.ГруппаПродукции <> Выборка.ГруппаПродукции
		 ИЛИ СтрокаОстатка.ДокументИсточник <> Выборка.ДокументИсточник Тогда
		 
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			ЗаполнитьЗначенияСвойств(Суммы, 		Выборка);
			
			СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, Выборка, Суммы);
			
		Иначе
			
			Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				
				СтрокаОстатка.Количество = СтрокаОстатка.Количество + Выборка.Количество;
				Для Каждого КлючИЗначение Из Суммы Цикл
					СтрокаОстатка[КлючИЗначение.Ключ] = СтрокаОстатка[КлючИЗначение.Ключ] + Выборка[КлючИЗначение.Ключ];
				КонецЦикла;
				
				ЗаполнитьЗначенияСвойств(Суммы, Выборка);
				СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, Выборка, Суммы);
				
				ЗаполнитьЗначенияСвойств(Суммы, СтрокаОстатка);
				
			Иначе
				
				ЕстьНенулеваяСумма = Ложь;
				
				Для Каждого КлючИЗначение Из Суммы Цикл
					Суммы[КлючИЗначение.Ключ] =	?(СтрокаОстатка.Количество <> 0,
						Окр(Выборка.Количество * СтрокаОстатка[КлючИЗначение.Ключ] / СтрокаОстатка.Количество, 2, 1), 0);
					ЕстьНенулеваяСумма = ЕстьНенулеваяСумма ИЛИ (Суммы[КлючИЗначение.Ключ] <> 0);
				КонецЦикла;
				
				Если ЕстьНенулеваяСумма Тогда
					
					СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, Выборка, Суммы);
					
					Если ЗначениеЗаполнено(Выборка.РазделУчета) Тогда
					 	СформироватьДвиженияСебестоимостьТоваровСписаниеНЗП(ПараметрыРасчета, Выборка, Суммы);
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаОстатка.Количество = СтрокаОстатка.Количество - Выборка.Количество;
				Для Каждого КлючИЗначение Из Суммы Цикл
					СтрокаОстатка[КлючИЗначение.Ключ] = СтрокаОстатка[КлючИЗначение.Ключ] - Суммы[КлючИЗначение.Ключ];
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
		 И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
		 
			СформироватьДвиженияПрочиеРасходыСписаниеНЗП(ПараметрыРасчета, Выборка, Выборка);
		 
		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, Выпуски");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.15
Процедура СкорректироватьСтоимостьСписанияНезавершенногоПроизводства22(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов, 
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС
	|ПОМЕСТИТЬ
	|	Выпуски
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	//-- НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика)
	|;
	|ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Движения.Регистратор КАК ДокументДвижения,
	|	Движения.Организация КАК Организация,
	|	Движения.ПартияПроизводства КАК ПартияПроизводства,
	// для приходов стоимость формируется без учета партий, а для расхода - для каждой партии
	|	ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИдентификаторыПартий.ИдентификаторПартии
	|	КОНЕЦ КАК ИдентификаторПартии,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	Движения.Этап КАК Этап,
	|	Движения.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Движения.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	Движения.РазделУчета КАК РазделУчета,
	|	Движения.ВидЗапасов КАК ВидЗапасов,
	|	Движения.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	Движения.АналитикаУчетаПродукции.Назначение КАК Назначение,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	Движения.Подразделение КАК Подразделение,
	// для приходов выбирается исходное подразделение расхода, а для расходов - подразделение, на которое расход отнесен
	|	ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА Распределение.Подразделение
	|		ИНАЧЕ Движения.Подразделение
	|	КОНЕЦ КАК ИсходноеПодразделение,
	|	ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА Распределение.НаправлениеДеятельности
	|		ИНАЧЕ Движения.ДокументИсточник.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	Движения.АналитикаРасходов КАК АналитикаРасходов,
	|	Движения.СтатьяРасходов КАК СтатьяРасходов,
	|	Движения.СтатьяРасходов.КосвенныеЗатратыНУ КАК КосвенныеЗатратыНУ,
	|	Движения.СтатьяРасходов.ПринятиеКНалоговомуУчету КАК ПринимаемыеВНУ,
	|	Движения.Продукция КАК Продукция,
	|	Движения.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Движения.ГруппаПродукции КАК ГруппаПродукции,
	|	ВЫБОР КОГДА Движения.СлужебноеВидДвиженияПриход
	|		ТОГДА Движения.Регистратор
	|		ИНАЧЕ Движения.ДокументИсточник
	|	КОНЕЦ КАК ДокументИсточник,
	|	Движения.ДокументВыпуска КАК ДокументВыпуска,
	|	Движения.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	|	Движения.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|	СУММА(Движения.ПоказательОтнесенияНаПартию) КАК ПоказательОтнесенияНаПартию,
	|	СУММА(Движения.ПоказательОтнесенияНаВыпуск) КАК ПоказательОтнесенияНаВыпуск,
	// для приходов количество это ПоказательОтнесенияНаПартию, а для расходов - ПоказательОтнесенияНаВыпуск
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА Движения.СлужебноеВидДвиженияПриход
	|			ТОГДА Движения.ПоказательОтнесенияНаПартию
	|		ИНАЧЕ Движения.ПоказательОтнесенияНаВыпуск
	|	КОНЕЦ КАК ЧИСЛО(23,10))) КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|		ПО Движения.Регистратор = Распределение.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Движения.АналитикаУчетаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|		ПО АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|		И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|		И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|		И АналитикаПродукцииБезНазначения.Склад = Аналитика.Склад
	|		И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|		ПО Движения.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|		И Движения.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|		И Движения.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|ГДЕ
	|	Движения.СлужебноеВидДвиженияПриход
	|		ИЛИ НЕ Движения.СлужебноеВидДвиженияПриход
	|		И Движения.ДокументИсточник <> ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.СтатьяРасходов,
	|	Движения.СтатьяРасходов.КосвенныеЗатратыНУ,
	|	Движения.СтатьяРасходов.ПринятиеКНалоговомуУчету,
	|	Движения.АналитикаРасходов,
	|	Распределение.Подразделение,
	|	Распределение.НаправлениеДеятельности,
	|	Движения.ДокументИсточник.НаправлениеДеятельности,
	|	Движения.Период,
	|	Движения.СлужебноеВидДвиженияПриход,
	|	Движения.Регистратор,
	|	Движения.Подразделение,
	|	Движения.ДокументИсточник.Подразделение,
	|	Движения.ПартияПроизводства,
	|	Движения.ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция,
	|	Движения.Этап,
	|	Движения.СтатьяКалькуляции,
	|	Движения.ВидЗапасов,
	|	Движения.ВидЗапасов.ТипЗапасов,
	|	Движения.АналитикаУчетаПродукции.Назначение,
	|	Движения.РазделУчета,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Движения.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ),
	|	Движения.Продукция,
	|	Движения.ХарактеристикаПродукции,
	|	Движения.ГруппаПродукции,
	|	Движения.Организация,
	|	Движения.Регистратор,
	|	ВЫБОР КОГДА Движения.СлужебноеВидДвиженияПриход
	|		ТОГДА Движения.Регистратор
	|		ИНАЧЕ Движения.ДокументИсточник
	|	КОНЕЦ,
	|	Движения.ДокументВыпуска,
	|	Движения.АналитикаУчетаПартийПроизводства,
	|	Движения.ПравилоОтнесенияНаВыпуск,
	|	ИдентификаторыПартий.ИдентификаторПартии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ИсходноеПодразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период КАК Период,
	|	ТаблицаКорректировки.ВидДвижения КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения КАК ДокументДвижения,
	|	ТаблицаКорректировки.Организация КАК Организация,
	|	ТаблицаКорректировки.ПартияПроизводства КАК ПартияПроизводства,
	|	ТаблицаКорректировки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаКорректировки.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ТаблицаКорректировки.Этап КАК Этап,
	|	ТаблицаКорректировки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	ТаблицаКорректировки.АналитикаУчетаПродукции КАК АналитикаУчетаПродукцииСебестоимость,
	|	ТаблицаКорректировки.Продукция КАК Продукция,
	|	ТаблицаКорректировки.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ТаблицаКорректировки.РазделУчета КАК РазделУчета,
	|	ЕСТЬNULL(Выпуски.ВидЗапасов, ТаблицаКорректировки.ВидЗапасов) КАК ВидЗапасов,
	|	ЕСТЬNULL(Выпуски.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	|	ЕСТЬNULL(Выпуски.АналитикаУчетаПартий, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПартий,
	|	ЕСТЬNULL(Выпуски.АналитикаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК АналитикаФинансовогоУчета,
	|	ЕСТЬNULL(Выпуски.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаКорректировки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.Подразделение КАК Подразделение,
	|	ТаблицаКорректировки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаКорректировки.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаКорректировки.ГруппаПродукции КАК ГруппаПродукции,
	|	ТаблицаКорректировки.ИсходноеПодразделение КАК ИсходноеПодразделение,
	|	ТаблицаКорректировки.Подразделение КАК КорПодразделение,
	|	ТаблицаКорректировки.ДокументИсточник КАК ДокументИсточник,
	|	ТаблицаКорректировки.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	|	ТаблицаКорректировки.ДокументВыпуска КАК ДокументВыпуска,
	|	ТаблицаКорректировки.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.Стоимость, 0) КАК ЧИСЛО(15,2)) КАК Стоимость,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0) КАК ЧИСЛО(15,2)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходы, 0) КАК ЧИСЛО(15,2)) КАК СуммаДопРасходов,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(15,2)) КАК СуммаДопРасходовБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|		* ВЫБОР
	|				КОГДА НЕ ТаблицаКорректировки.ПринимаемыеВНУ
	|					ТОГДА ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеРегл, 0)
	|				ИНАЧЕ ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) КОНЕЦ
	|		КАК ЧИСЛО(15,2)) КАК ПостояннаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|		* ВЫБОР
	|				КОГДА ТаблицаКорректировки.КосвенныеЗатратыНУ И ТаблицаКорректировки.ПринимаемыеВНУ
	|					ТОГДА ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0)
	|					+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеРегл, 0)
	|					- ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0)
	|				ИНАЧЕ ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) КОНЕЦ
	|	КАК ЧИСЛО(15,2)) КАК ВременнаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0) КАК ЧИСЛО(15,2)) КАК СтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(15,2)) 		КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.Трудозатраты, 0) КАК ЧИСЛО(15,2)) 					КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.ПостатейныеСНДС, 0) КАК ЧИСЛО(15,2)) 				КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.ПостатейныеБезНДС, 0) КАК ЧИСЛО(15,2)) 			КАК ПостатейныеБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(15,2)) КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0) КАК ЧИСЛО(15,2)) 			КАК ДопРасходыРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0) КАК ЧИСЛО(15,2)) 			КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ПостатейныеРегл, 0) КАК ЧИСЛО(15,2)) 			КАК ПостатейныеРегл
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО Выпуски.Регистратор = ТаблицаКорректировки.ДокументДвижения
	|		И Выпуски.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаПродукции
	|		И Выпуски.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводства КАК Стоимости
	|	ПО 
	|		ТаблицаКорректировки.Организация = Стоимости.Организация
	|		И ТаблицаКорректировки.ИсходноеПодразделение = Стоимости.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И ТаблицаКорректировки.ИдентификаторПартии = Стоимости.Партия
	|		И ТаблицаКорректировки.ДокументИсточник = Стоимости.ДокументИсточник
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводстваРегл КАК СтоимостиРегл
	|	ПО 
	|		ТаблицаКорректировки.Организация = СтоимостиРегл.Организация
	|		И ТаблицаКорректировки.ИсходноеПодразделение = СтоимостиРегл.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = СтоимостиРегл.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = СтоимостиРегл.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = СтоимостиРегл.АналитикаРасходов
	|		И ТаблицаКорректировки.ИдентификаторПартии = СтоимостиРегл.Партия
	|		И ТаблицаКорректировки.ДокументИсточник = СтоимостиРегл.ДокументИсточник
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Назначения КАК СпрНазначения
	|	ПО
	|		ТаблицаКорректировки.Назначение = СпрНазначения.Ссылка
	|ГДЕ
	|	ТаблицаКорректировки.Количество <> 0	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.СтатьяРасходов,
	|	ТаблицаКорректировки.АналитикаРасходов,
	|	ТаблицаКорректировки.Подразделение,
	|	ТаблицаКорректировки.ПартияПроизводства,
	|	ТаблицаКорректировки.ЗаказНаПроизводство,
	|	ТаблицаКорректировки.КодСтрокиПродукция,
	|	ТаблицаКорректировки.Этап,
	|	ТаблицаКорректировки.СтатьяКалькуляции,
	|	ТаблицаКорректировки.ГруппаПродукции,
	|	ТаблицаКорректировки.ДокументИсточник,
	|	ТаблицаКорректировки.ДокументВыпуска,
	|	ТаблицаКорректировки.ВидДвижения,
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.ДокументДвижения
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Суммы = Новый Структура("Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС, СтоимостьРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл");
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	// - ПрочиеРасходыНезавершенногоПроизводства
	// - СебестоимостьТоваров
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Суммы, Выборка);
		СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, Выборка, Суммы);
		
		Если Выборка.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			СформироватьДвиженияСебестоимостьТоваровСписаниеНЗП(ПараметрыРасчета, Выборка, Суммы);
		КонецЕсли;
		
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов
			И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			
			СформироватьДвиженияПрочиеРасходыСписаниеНЗП(ПараметрыРасчета, Выборка, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, Выпуски");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.16
Процедура СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводства(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Операция.Дата КАК Период,
	|	Операция.Ссылка КАК ДокументДвижения,
	|	Операция.Организация КАК Организация,
	|	Операция.Подразделение КАК Подразделение,
	|	Операция.СтатьяРасходов КАК СтатьяРасходов,
	|	Операция.АналитикаРасходов КАК АналитикаРасходов,
	|	Операция.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Строки.СтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтатьяРасходовПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Строки.АналитикаРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаРасходовПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА Строки.СтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтатьяАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА Строки.АналитикаРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаАктивовПассивов,
	|	Строки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(Строки.ДоляСтоимости) КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат КАК Операция
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.Списание КАК Строки
	|		ПО Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Операция.Организация В(&МассивОрганизаций)
	|	И Операция.Проведен
	|	И НЕ &ПартионныйУчетВерсии22
	|	
	|СГРУППИРОВАТЬ ПО
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	Операция.Подразделение,
	|	Операция.СтатьяРасходов,
	|	Операция.АналитикаРасходов,
	|	Операция.НаправлениеДеятельности,
	|	Строки.НаправлениеДеятельности,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаРасходов,
	|	Строки.ИдентификаторСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК ДокументДвижения,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	ДД.КорСтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	ДД.КорАналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	ДД.КорСтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ДД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СУММА(ДД.ДоляСтоимости) КАК Количество
	|ИЗ
	|	ДолиПроизводственныхРасходов КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.КорСтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.КорСтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.ИдентификаторСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.ДокументДвижения,
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.Подразделение,
	|	ТаблицаКорректировки.СтатьяРасходов,
	|	ТаблицаКорректировки.АналитикаРасходов,
	|	ТаблицаКорректировки.НаправлениеДеятельности,
	|	ТаблицаКорректировки.НаправлениеДеятельностиПолучатель,
	|	ТаблицаКорректировки.СтатьяРасходовПолучатель,
	|	ТаблицаКорректировки.АналитикаРасходовПолучатель,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* (ЕСТЬNULL(Стоимости.Стоимость, 0)
	|				+ ЕСТЬNULL(Стоимости.ПостатейныеСНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.Трудозатраты, 0)) КАК ЧИСЛО(15,2)) КАК Стоимость,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* (ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.ПостатейныеБезНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.Трудозатраты, 0)) КАК ЧИСЛО(15,2)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходы, 0) КАК ЧИСЛО(15,2)) КАК СуммаДопРасходов,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(15,2)) КАК СуммаДопРасходовБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) КАК ЧИСЛО(15,2)) КАК ПостояннаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			*ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) КАК ЧИСЛО(15,2)) КАК ВременнаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* (ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0)) КАК ЧИСЛО(15,2)) КАК СтоимостьРегл
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводства КАК Стоимости
	|	ПО 
	|		ТаблицаКорректировки.Организация = Стоимости.Организация
	|		И ТаблицаКорректировки.Подразделение = Стоимости.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И Стоимости.Партия = НЕОПРЕДЕЛЕНО
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводстваРегл КАК СтоимостиРегл
	|	ПО 
	|		ТаблицаКорректировки.Организация = СтоимостиРегл.Организация
	|		И ТаблицаКорректировки.Подразделение = СтоимостиРегл.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = СтоимостиРегл.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = СтоимостиРегл.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = СтоимостиРегл.АналитикаРасходов
	|		И СтоимостиРегл.Партия = НЕОПРЕДЕЛЕНО
	|ГДЕ
	|	ТаблицаКорректировки.Количество <> 0	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.СтатьяРасходов,
	|	ТаблицаКорректировки.АналитикаРасходов,
	|	ТаблицаКорректировки.Подразделение,
	|	ТаблицаКорректировки.СтатьяРасходовПолучатель,
	|	ТаблицаКорректировки.АналитикаРасходовПолучатель,
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.ДокументДвижения,
	|	ТаблицаКорректировки.ИдентификаторСтроки
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		СформироватьДвиженияПрочиеРасходыПрочееСписаниеНЗП(ПараметрыРасчета, Выборка);
		
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

// Этап 3.17
Процедура СкорректироватьСтоимостьПродаж(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПродаж");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер         КАК Партнер,
	|	АналитикаПартнеров.Контрагент      КАК Контрагент,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Продажи.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ) КАК ВидЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	(ВЫБОР КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	КОГДА Продажи.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	КОГДА Аналитика.Склад ССЫЛКА Справочник.Партнеры ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Аналитика.Склад ССЫЛКА Справочник.Организации ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ) КАК РазделУчета,
	|	СУММА(Продажи.Количество)          КАК Количество
	|
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Продажи.АналитикаУчетаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер,
	|	АналитикаПартнеров.Контрагент,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Продажи.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ),
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	(ВЫБОР КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	КОГДА Продажи.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	КОГДА Аналитика.Склад ССЫЛКА Справочник.Партнеры ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Аналитика.Склад ССЫЛКА Справочник.Организации ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ)
	|
	|ИМЕЮЩИЕ
	|
	|	СУММА(Продажи.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Организация,
	|	РазделУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.ДокументДвижения КАК ДокументДвижения
	|ПОМЕСТИТЬ
	|	ВтРегистраторыПродаж
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Себестоимость.Период,
	|	Себестоимость.Регистратор КАК ДокументДвижения,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	(ВЫБОР
	//++ НЕ УТКА
	|		КОГДА Себестоимость.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА НЕОПРЕДЕЛЕНО
	//-- НЕ УТКА
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Себестоимость.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ) КАК ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	СУММА(Себестоимость.Количество) КАК Количество,
	|	СУММА(Себестоимость.Стоимость
	|		+ Себестоимость.Трудозатраты
	|		+ Себестоимость.ПостатейныеСНДС) КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС
	|		+ Себестоимость.Трудозатраты
	|		+ Себестоимость.ПостатейныеБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СуммаДопРасходов) КАК СуммаДопРасходов,
	|	СУММА(Себестоимость.СуммаДопРасходовБезНДС) КАК СуммаДопРасходовБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл
	|		+ Себестоимость.ДопРасходыРегл
	|		+ Себестоимость.ТрудозатратыРегл
	|		+ Себестоимость.ПостатейныеРегл) КАК СтоимостьРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница) КАК ВременнаяРазница
	|ПОМЕСТИТЬ
	|	ВтСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторыПродаж КАК РегистраторыПродаж
	|		ПО РегистраторыПродаж.Период = Себестоимость.Период
	|		И РегистраторыПродаж.ДокументДвижения = Себестоимость.Регистратор
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	(ВЫБОР
	//++ НЕ УТКА
	|		КОГДА Себестоимость.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА НЕОПРЕДЕЛЕНО
	//-- НЕ УТКА
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Себестоимость.ВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КОНЕЦ),
	|	Себестоимость.Организация,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                     КАК Период,
	|	ТаблицаКорректировки.ДокументДвижения           КАК ДокументДвижения,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.ЗаказКлиента               КАК ЗаказКлиента,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.Организация                КАК Организация,
	|	ТаблицаКорректировки.Партнер                    КАК Партнер,
	|	ТаблицаКорректировки.Контрагент                 КАК Контрагент,
	|	ТаблицаКорректировки.Подразделение              КАК Подразделение,
	|	ТаблицаКорректировки.ТипЗапасов                 КАК ТипЗапасов,
	|	ТаблицаКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаКорректировки.Менеджер                   КАК Менеджер,
	|	ТаблицаКорректировки.Склад                      КАК Склад,
	|	ТаблицаКорректировки.Соглашение                 КАК Соглашение,
	|	ТаблицаКорректировки.Договор                    КАК Договор,
	|	ТаблицаКорректировки.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	ТаблицаКорректировки.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	ТаблицаКорректировки.ВалютаДокумента            КАК ВалютаДокумента,
	|	ТаблицаКорректировки.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	ТаблицаКорректировки.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ТаблицаКорректировки.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.Стоимость / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.Стоимость КАК ЧИСЛО(15,2))) КАК Стоимость,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.СтоимостьБезНДС / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.СтоимостьБезНДС КАК ЧИСЛО(15,2))) КАК СтоимостьБезНДС,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.ПостояннаяРазница / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.ПостояннаяРазница КАК ЧИСЛО(15,2))) КАК ПостояннаяРазница,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.ВременнаяРазница / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.ВременнаяРазница КАК ЧИСЛО(15,2))) КАК ВременнаяРазница,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.СуммаДопРасходов / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.СтоимостьДопРасходы КАК ЧИСЛО(15,2))) КАК СуммаДопРасходов,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.СуммаДопРасходовБезНДС / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.СтоимостьДопРасходыБезНДС КАК ЧИСЛО(15,2))) КАК СуммаДопРасходовБезНДС,
	|
	|	ЕСТЬNULL(
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* Себестоимость.СтоимостьРегл / Себестоимость.Количество КАК ЧИСЛО(15,2)),
	|		ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* СтоимостьТоваров.СтоимостьРегл КАК ЧИСЛО(15,2))) КАК СтоимостьРегл,
	|	0 КАК НДСРегл
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТКэшСтоимостьТоваров КАК СтоимостьТоваров
	|	ПО 
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И СтоимостьТоваров.ВидЗапасов = ТаблицаКорректировки.ВидЗапасов
	|		И СтоимостьТоваров.Организация = ТаблицаКорректировки.Организация
	|		И СтоимостьТоваров.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		И НЕ &ПартионныйУчетВерсии22
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСебестоимость КАК Себестоимость
	|		ПО Себестоимость.Период = ТаблицаКорректировки.Период
	|		И Себестоимость.ДокументДвижения = ТаблицаКорректировки.ДокументДвижения
	|		И Себестоимость.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И (Себестоимость.ВидЗапасов = ТаблицаКорректировки.ВидЗапасов ИЛИ Себестоимость.ВидЗапасов = НЕОПРЕДЕЛЕНО)
	|		И Себестоимость.Организация = ТаблицаКорректировки.Организация
	|		И Себестоимость.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		И Себестоимость.ЗаказКлиента = ТаблицаКорректировки.ЗаказКлиента
	|		И Себестоимость.АналитикаУчетаПоПартнерам = ТаблицаКорректировки.АналитикаУчетаПоПартнерам
	|		И Себестоимость.Количество <> 0
	|";
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Корректировка себестоимости продаж по хоз операциям продажи.
		СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, Выборка);
		
		Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда	
			
			СформироватьДвиженияЗакупки(ПараметрыРасчета, Выборка);
				
		КонецЕсли;

	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, ВтРегистраторыПродаж, ВтСебестоимость");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.18
Процедура ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета)

	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимостьПродаж");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаПродукции КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР КОГДА Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|			ТОГДА Партии.КорВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов
	|		КОНЕЦ КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.Количество,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|	
	|	) КАК Партии
	|ГДЕ
	|	Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	СУММА(
	|		ВЫБОР КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	СУММА(Продажи.Количество)          КАК ИсходноеКоличество,
	|	0                                  КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Продажи.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(Продажи.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Регистратор КАК ДокументДвижения,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СуммаДопРасходов,
	|	0 КАК СуммаДопРасходовБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Партии.НДСРегл) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
	|НалогообложениеНДС, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС, Количество,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|СтоимостьРегл, НДСРегл, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, СтоимостьЗабалансоваяРегл
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл,
	|СуммаДопРасходов, СуммаДопРасходовБезНДС, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, СтоимостьЗабалансоваяРегл
	|");

	Выборка = Запрос.Выполнить().Выбрать();
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);

		КонецЕсли;
		
	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтПартии, ВтРегистраторы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.19
Процедура СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СписатьОшибкиОкругленияРасчетаСебестоимости");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Списываем только те остатки, в которых все "суммовые" ресурсы имеют значения, укладывающиеся в пределы погрешности. 
	// Если хоть один "суммовой" ресурс превышает величину погрешности, то такой остаток ошибкой округления не считаем.
	// Для регистра ПрочиеРасходы подход отличается: для него проверка ведется остатка для каждого ресурса по-отдельности.
	// Если какой-то ресурс укладывается в пределы погрешности, то списываем только его.
	
	// Списание ошибок округления в регистре СебестоимостьТоваров
	// Также создадим пустую временную таблицу ВТОкруглениеПрочиеРасходы для УТ - там не будет ошибок округления в регистре ПрочиеРасходы.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК ДокументДвижения,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	Себестоимость.Организация 					КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета 					КАК РазделУчета,
	|	Себестоимость.ВидЗапасов 					КАК ВидЗапасов,
	|	Себестоимость.Партия                        КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Склад) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА Аналитика.Склад
	|		ИНАЧЕ Аналитика.Склад.Подразделение
	|	КОНЕЦ 										КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости)	КАК СтатьяРасходовСписания,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Себестоимость.Стоимость 					КАК Стоимость,
	|	Себестоимость.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	Себестоимость.СуммаДопРасходов 				КАК СуммаДопРасходов,
	|	Себестоимость.СуммаДопРасходовБезНДС 		КАК СуммаДопРасходовБезНДС,
	|	Себестоимость.СтоимостьРегл 				КАК СтоимостьРегл,
	|	Себестоимость.ПостояннаяРазница 			КАК ПостояннаяРазница,
	|	Себестоимость.ВременнаяРазница 				КАК ВременнаяРазница,
	|	Себестоимость.СтоимостьЗабалансовая         КАК СтоимостьЗабалансовая,
	|	Себестоимость.Трудозатраты       		    КАК Трудозатраты,
	|	Себестоимость.ПостатейныеСНДС       		КАК ПостатейныеСНДС,
	|	Себестоимость.ПостатейныеБезНДС       	    КАК ПостатейныеБезНДС,
	|	Себестоимость.СтоимостьЗабалансоваяРегл     КАК СтоимостьЗабалансоваяРегл,
	|	Себестоимость.ДопРасходыРегл                КАК ДопРасходыРегл,
	|	Себестоимость.ТрудозатратыРегл              КАК ТрудозатратыРегл,
	|	Себестоимость.ПостатейныеРегл               КАК ПостатейныеРегл
	|ПОМЕСТИТЬ ВТОкруглениеСебестоимостьТоваров
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Себестоимость.АналитикаУчетаНоменклатуры
	|
	|ГДЕ
	|	Себестоимость.Количество = 0
	|	И (Себестоимость.Стоимость МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.СтоимостьБезНДС МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.СуммаДопРасходов МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.СуммаДопРасходовБезНДС МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.СтоимостьРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	//++ НЕ УТ
	|		И Себестоимость.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	//-- НЕ УТ
	|		И Себестоимость.СтоимостьЗабалансовая МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.Трудозатраты МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.ПостатейныеСНДС МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.ПостатейныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.СтоимостьЗабалансоваяРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.ДопРасходыРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.ТрудозатратыРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		И Себестоимость.ПостатейныеРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ		 КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	0 			 КАК Сумма,
	|	0 			 КАК СуммаБезНДС,
	|	0 			 КАК СуммаРегл,
	|	0 			 КАК ПостояннаяРазница,
	|	0 			 КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ         КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
	|	НЕОПРЕДЕЛЕНО КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	0            КАК Стоимость,
	|	0            КАК СтоимостьБезНДС,
	|	0            КАК СтоимостьРегл,
	|	0            КАК ПостояннаяРазница,
	|	0            КАК ВременнаяРазница,
	|	0            КАК ДоляСтоимости
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходыНЗП
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТОкруглениеСебестоимостьТоваров КАК Т
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя,
		Запрос);
	
	//++ НЕ УТ
	// Списание ошибок округления в регистре ПрочиеРасходы
	Запрос.Текст =
	"УНИЧТОЖИТЬ ВТОкруглениеПрочиеРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК ДокументДвижения,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	ПрочиеРасходы.Организация 					КАК Организация,
	|	ПрочиеРасходы.Подразделение 				КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов 				КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов 			КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности 		КАК НаправлениеДеятельности,
	|
	|	ВЫБОР КОГДА ПрочиеРасходы.Сумма МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ТОГДА ПрочиеРасходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК Сумма,
	|	ВЫБОР КОГДА ПрочиеРасходы.СуммаБезНДС МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ТОГДА ПрочиеРасходы.СуммаБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаБезНДС,
	|	ВЫБОР КОГДА ПрочиеРасходы.СуммаРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ТОГДА ПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаРегл,
	|	ВЫБОР КОГДА ПрочиеРасходы.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ТОГДА ПрочиеРасходы.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК ПостояннаяРазница,
	|	ВЫБОР КОГДА ПрочиеРасходы.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ТОГДА ПрочиеРасходы.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходы
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО ПрочиеРасходы.Организация = ДокументыРасчетаСебестоимости.Организация
	|
	|ГДЕ
	|	ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|	И (ПрочиеРасходы.Сумма МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ИЛИ ПрочиеРасходы.СуммаБезНДС МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ИЛИ ПрочиеРасходы.СуммаРегл МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ИЛИ ПрочиеРасходы.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость
	|		ИЛИ ПрочиеРасходы.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиСтоимость И &ЗначениеПогрешностиСтоимость)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТОкруглениеПрочиеРасходы КАК Т
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя,
		Запрос);
		
	// Списание ошибок округления в регистре ПрочиеРасходыНезавершенногоПроизводства
	Запрос.Текст =
	"УНИЧТОЖИТЬ ВТОкруглениеПрочиеРасходыНЗП
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка	КАК ДокументДвижения,
	|	&КонецПериода							КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	КАК ВидДвижения,
	|	ПрочиеРасходыНЗП.Организация			КАК Организация,
	|	ПрочиеРасходыНЗП.Подразделение			КАК Подразделение,
	|	ПрочиеРасходыНЗП.ПартияПроизводства		КАК ПартияПроизводства,
	|	ПрочиеРасходыНЗП.ЗаказНаПроизводство	КАК ЗаказНаПроизводство,
	|	ПрочиеРасходыНЗП.КодСтрокиПродукция		КАК КодСтрокиПродукция,
	|	ПрочиеРасходыНЗП.Этап					КАК Этап,
	|	ПрочиеРасходыНЗП.СтатьяКалькуляции		КАК СтатьяКалькуляции,
	|	ПрочиеРасходыНЗП.СтатьяРасходов			КАК СтатьяРасходов,
	|	ПрочиеРасходыНЗП.АналитикаРасходов		КАК АналитикаРасходов,
	|	ПрочиеРасходыНЗП.ГруппаПродукции		КАК ГруппаПродукции,
	|	ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|	ПрочиеРасходыНЗП.Стоимость				КАК Стоимость,
	|	ПрочиеРасходыНЗП.СтоимостьБезНДС		КАК СтоимостьБезНДС,
	|	ПрочиеРасходыНЗП.СтоимостьРегл			КАК СтоимостьРегл,
	|	ПрочиеРасходыНЗП.ПостояннаяРазница		КАК ПостояннаяРазница,
	|	ПрочиеРасходыНЗП.ВременнаяРазница		КАК ВременнаяРазница,
	|	ПрочиеРасходыНЗП.ДоляСтоимости			КАК ДоляСтоимости
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходыНЗП
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО ПрочиеРасходыНЗП.Организация = ДокументыРасчетаСебестоимости.Организация
	|
	|ГДЕ
	|	(
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.Стоимость > 0 ТОГДА ПрочиеРасходыНЗП.Стоимость ИНАЧЕ - ПрочиеРасходыНЗП.Стоимость КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.СтоимостьБезНДС > 0 ТОГДА ПрочиеРасходыНЗП.СтоимостьБезНДС ИНАЧЕ - ПрочиеРасходыНЗП.СтоимостьБезНДС КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.СтоимостьРегл > 0 ТОГДА ПрочиеРасходыНЗП.СтоимостьРегл ИНАЧЕ - ПрочиеРасходыНЗП.СтоимостьРегл КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.ПостояннаяРазница > 0 ТОГДА ПрочиеРасходыНЗП.ПостояннаяРазница ИНАЧЕ - ПрочиеРасходыНЗП.ПостояннаяРазница КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.ВременнаяРазница > 0 ТОГДА ПрочиеРасходыНЗП.ВременнаяРазница ИНАЧЕ - ПрочиеРасходыНЗП.ВременнаяРазница КОНЕЦ
	|	)
	|		<
	|	(
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.Стоимость <> 0 ТОГДА &ЗначениеПогрешностиСтоимость ИНАЧЕ 0 КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.СтоимостьБезНДС <> 0 ТОГДА &ЗначениеПогрешностиСтоимость ИНАЧЕ 0 КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.СтоимостьРегл <> 0 ТОГДА &ЗначениеПогрешностиСтоимость ИНАЧЕ 0 КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.ПостояннаяРазница <> 0 ТОГДА &ЗначениеПогрешностиСтоимость ИНАЧЕ 0 КОНЕЦ + 
	|		ВЫБОР КОГДА ПрочиеРасходыНЗП.ВременнаяРазница <> 0 ТОГДА &ЗначениеПогрешностиСтоимость ИНАЧЕ 0 КОНЕЦ
	|	)
	|	И ПрочиеРасходыНЗП.ДоляСтоимости МЕЖДУ -&ЗначениеПогрешностиКоличество И &ЗначениеПогрешностиКоличество
	|	И ПрочиеРасходыНЗП.ПоказательОтнесенияНаВыпуск МЕЖДУ -&ЗначениеПогрешностиКоличество И &ЗначениеПогрешностиКоличество
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТОкруглениеПрочиеРасходыНЗП КАК Т
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя,
		Запрос);
	//-- НЕ УТ
	
	// Формирование кор. движений в регистре ПрочиеРасходы
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ДокументДвижения 																КАК ДокументДвижения,
	|	&КонецПериода 																	КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 											КАК ВидДвижения,
	|	Т.Организация 																	КАК Организация,
	|	Т.Подразделение																	КАК Подразделение,
	|	Т.НаправлениеДеятельности														КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяРасходов,
	|	СУММА(Т.Сумма) 																	КАК Сумма
	|ПОМЕСТИТЬ ВТКорДвиженияПрочиеРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения 				 КАК ДокументДвижения,
	|		Т.Организация 					 КАК Организация,
	|		Т.Подразделение 				 КАК Подразделение,
	|		Т.НаправлениеДеятельности 		 КАК НаправлениеДеятельности,
	|		Т.Стоимость + Т.СуммаДопРасходов КАК Сумма
	|	ИЗ
	|		ВТОкруглениеСебестоимостьТоваров КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения,
	|		Т.Организация,
	|		Т.Подразделение,
	|		Т.НаправлениеДеятельности,
	|		Т.Сумма
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходы КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения,
	|		Т.Организация,
	|		Т.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|		Т.Стоимость
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходыНЗП КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.Сумма) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТКорДвиженияПрочиеРасходы КАК Т
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя,
		Запрос);
		
	// Корректировка движений по оборотным регистрам управленческого учета.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&КонецПериода 					КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакрытиеМесяца) КАК ХозяйственнаяОперация,
	|	Т.ДокументДвижения 				КАК ДокументДвижения,
	|	Т.Организация 					КАК Организация,
	|	Т.Подразделение 				КАК Подразделение,
	|	Т.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Т.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	Т.НаправлениеДеятельности		КАК КорНаправлениеДеятельности,
	|	Т.Склад 						КАК Склад,
	|	Т.ТипЗапасов 					КАК ТипЗапасов,
	|	Т.ВидЗапасов 					КАК ВидЗапасов,
	|	Т.СтатьяРасходовСписания 		КАК СтатьяРасходовСписания,
	|	Т.АналитикаРасходов 			КАК АналитикаРасходов,
	|	Т.ИсточникГФУНоменклатуры		КАК ИсточникГФУНоменклатуры,
	|	Т.Стоимость 					КАК Стоимость,
	|	Т.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	Т.СтоимостьРегл 				КАК СтоимостьРегл
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		НЕОПРЕДЕЛЕНО 												КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		Т.АналитикаУчетаНоменклатуры 								КАК АналитикаУчетаНоменклатуры,
	|		АналитикаНоменклатуры.Склад 								КАК Склад,
	|		Т.ВидЗапасов.ТипЗапасов 									КАК ТипЗапасов,
	|		Т.ВидЗапасов 												КАК ВидЗапасов,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяРасходовСписания,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА Т.ВидЗапасов
	|			ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|		КОНЕЦ 														КАК ИсточникГФУНоменклатуры,
	|		-(Т.Стоимость + Т.СуммаДопРасходов)							КАК Стоимость,
	|		-(Т.СтоимостьБезНДС + Т.СуммаДопРасходовБезНДС)				КАК СтоимостьБезНДС,
	|		-Т.СтоимостьРегл 											КАК СтоимостьРегл
	|	ИЗ
	|		ВТОкруглениеСебестоимостьТоваров КАК Т
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО Т.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		Т.Подразделение 											КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		Т.СтатьяРасходов 											КАК СтатьяДоходовРасходов,
	|		Т.АналитикаРасходов 										КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		-Т.Сумма 													КАК Стоимость,
	|		-Т.СуммаБезНДС 												КАК СтоимостьБезНДС,
	|		-Т.СуммаРегл 												КАК СтоимостьРегл
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходы КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		Т.Подразделение 											КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		Т.СтатьяРасходов 											КАК СтатьяДоходовРасходов,
	|		Т.АналитикаРасходов 										КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		-Т.Стоимость												КАК Стоимость,
	|		-Т.СтоимостьБезНДС											КАК СтоимостьБезНДС,
	|		-Т.СтоимостьРегл											КАК СтоимостьРегл
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходыНЗП КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		НЕОПРЕДЕЛЕНО 												КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяДоходовРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		Т.Сумма 													КАК Стоимость,
	|		0 															КАК СтоимостьБезНДС,
	|		0 															КАК СтоимостьРегл
	|	ИЗ
	|		ВТКорДвиженияПрочиеРасходы КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.Склад,
	|	Т.ТипЗапасов,
	|	Т.ВидЗапасов,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.ИсточникГФУНоменклатуры,
	|	Т.Стоимость,
	|	Т.СтоимостьБезНДС,
	|	Т.СтоимостьРегл
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Т.Стоимость) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДС) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРегл) <> 0)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТОкруглениеСебестоимостьТоваров, ВТОкруглениеПрочиеРасходы, ВТОкруглениеПрочиеРасходыНЗП, ВТКорДвиженияПрочиеРасходы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры


// Этап 4.1
// Процедура выполняет распределение выручки и себестоимости продаж по направлениям деятельности.
// Параметры:
// НачалоПериода - дата, начало периода для сбора данных о продажах.
// КонецПериода - дата, окончание периода для сбора данных о продажах.
//
Процедура РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьВыручкуПоНаправлениямДеятельности");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыручкаИСебестоимость.Подразделение             		 КАК Подразделение,
	|	АналитикаПоПартнерам.Организация                		 КАК Организация,
	|	АналитикаПоПартнерам.Партнер                    		 КАК Партнер,
	|	АналитикаПоПартнерам.НаправлениеДеятельности      		 КАК НаправлениеДеятельности,
	|	АналитикаНоменклатуры.Номенклатура              		 КАК Номенклатура,
	|	СУММА(ВыручкаИСебестоимость.СуммаВыручки)				 КАК СуммаВыручки,
	|	СУММА(ВыручкаИСебестоимость.Себестоимость
	|		+ ВыручкаИСебестоимость.СуммаДополнительныхРасходов) КАК Себестоимость
	|ПОМЕСТИТЬ ВТТаблицаВыручки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	ВыручкаИСебестоимость.ТипЗапасов В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.АгентскаяУслуга))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.Подразделение,
	|	АналитикаПоПартнерам.Организация,
	|	АналитикаПоПартнерам.Партнер,
	|	АналитикаПоПартнерам.НаправлениеДеятельности,
	|	АналитикаНоменклатуры.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВыручкаИСебестоимость.СуммаВыручки) <> 0
	|	ИЛИ СУММА(ВыручкаИСебестоимость.Себестоимость + ВыручкаИСебестоимость.СуммаДополнительныхРасходов) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВыручки.Подразделение               КАК Подразделение,
	|	ТаблицаВыручки.Организация                 КАК Организация,
	|	ТаблицаВыручки.Номенклатура                КАК Номенклатура,
	|	ТаблицаВыручки.Партнер                     КАК Партнер,
	|	ТаблицаВыручки.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ТаблицаВыручки.СуммаВыручки                КАК СуммаВыручки,
	|	ТаблицаВыручки.Себестоимость               КАК Себестоимость,
	|	НастройкаРаспределения.СпособРаспределения КАК СпособРаспределения,
	|	ВЫБОР
	|		КОГДА ТаблицаВыручки.Партнер = НастройкаРаспределения.Партнер ТОГДА
	|			1000
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Подразделение = НастройкаРаспределения.Подразделение ТОГДА
	|			100
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Номенклатура = НастройкаРаспределения.Номенклатура ТОГДА
	|			10
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Организация = НастройкаРаспределения.Организация ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                      КАК Приоритет
	|ПОМЕСТИТЬ ВтТаблицаРаспределения
	|
	|ИЗ
	|	ВТТаблицаВыручки КАК ТаблицаВыручки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности.СрезПоследних(
	|			&КонецПериода,
	|		) КАК НастройкаРаспределения
	|		ПО
	|			НастройкаРаспределения.Используется
	|			И ТаблицаВыручки.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			И (ТаблицаВыручки.Организация              = НастройкаРаспределения.Организация
	|				ИЛИ НастройкаРаспределения.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Партнер              = НастройкаРаспределения.Партнер
	|				ИЛИ НастройкаРаспределения.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Подразделение              = НастройкаРаспределения.Подразделение
	|				ИЛИ НастройкаРаспределения.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Номенклатура              = НастройкаРаспределения.Номенклатура
	|				ИЛИ НастройкаРаспределения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Подразделение,
	|	Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 								 КАК ДокументДвижения,
	|	&КонецПериода                                                        КАК Период,
	|	ТаблицаФинансовыхРезультатов.Организация                             КАК Организация,
	|	ТаблицаФинансовыхРезультатов.Подразделение                           КАК Подразделение,
	|	ТаблицаФинансовыхРезультатов.СпособРаспределения                     КАК СпособРаспределения,
	|	СУММА(ТаблицаФинансовыхРезультатов.СуммаВыручки)                     КАК СуммаВыручки,
	|	СУММА(ТаблицаФинансовыхРезультатов.Себестоимость)                    КАК Себестоимость,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ВыручкаОтПродаж)       КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.СебестоимостьПродаж)  КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			ТаблицаФинансовыхРезультатов.СпособРаспределения
	|		ИНАЧЕ
	|			СпособыРаспределения.НаправлениеДеятельности
	|	КОНЕЦ                                                                КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			1
	|		ИНАЧЕ
	|			ЕСТЬNULL(СпособыРаспределения.Коэффициент, 1)
	|	КОНЕЦ                                                                КАК КоэффициентРаспределения
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТаблицаРаспределения.Организация                   КАК Организация,
	|		ТаблицаРаспределения.Подразделение                 КАК Подразделение,
	|		СУММА(ТаблицаРаспределения.СуммаВыручки)           КАК СуммаВыручки,
	|		СУММА(ТаблицаРаспределения.Себестоимость)          КАК Себестоимость,
	|		ЕСТЬNULL(ТаблицаРаспределения.СпособРаспределения, НЕОПРЕДЕЛЕНО) КАК СпособРаспределения
	|	ИЗ
	|		ВтТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|	ГДЕ
	|		ТаблицаРаспределения.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		И ТаблицаРаспределения.Приоритет В
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(Таб.Приоритет) КАК Приоритет
	|				ИЗ
	|					ВтТаблицаРаспределения КАК Таб
	|				ГДЕ
	|					Таб.Организация        = ТаблицаРаспределения.Организация
	|					И Таб.Партнер            = ТаблицаРаспределения.Партнер
	|					И Таб.Подразделение      = ТаблицаРаспределения.Подразделение
	|					И Таб.Номенклатура         = ТаблицаРаспределения.Номенклатура)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРаспределения.Организация,
	|		ТаблицаРаспределения.Подразделение,
	|		ЕСТЬNULL(ТаблицаРаспределения.СпособРаспределения, НЕОПРЕДЕЛЕНО)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ТаблицаРаспределения.Организация                   КАК Организация,
	|		ТаблицаРаспределения.Подразделение                 КАК Подразделение,
	|		СУММА(ТаблицаРаспределения.СуммаВыручки)           КАК СуммаВыручки,
	|		СУММА(ТаблицаРаспределения.Себестоимость)          КАК Себестоимость,
	|		ТаблицаРаспределения.НаправлениеДеятельности       КАК СпособРаспределения
	|	ИЗ
	|		ВтТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|	ГДЕ
	|		ТаблицаРаспределения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРаспределения.Организация,
	|		ТаблицаРаспределения.Подразделение,
	|		ТаблицаРаспределения.НаправлениеДеятельности
	|
	|	) КАК ТаблицаФинансовыхРезультатов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.СпособыРаспределенияПоНаправлениямДеятельности.НаправленияДеятельности КАК СпособыРаспределения
	|		ПО ТаблицаФинансовыхРезультатов.СпособРаспределения = СпособыРаспределения.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|		ПО ТаблицаФинансовыхРезультатов.Организация = ДокументыРасчетаСебестоимости.Организация
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументыРасчетаСебестоимости.Ссылка,
	|	ТаблицаФинансовыхРезультатов.Организация,
	|	ТаблицаФинансовыхРезультатов.Подразделение,
	|	ТаблицаФинансовыхРезультатов.СпособРаспределения,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			ТаблицаФинансовыхРезультатов.СпособРаспределения
	|		ИНАЧЕ
	|			СпособыРаспределения.НаправлениеДеятельности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			1
	|		ИНАЧЕ
	|			ЕСТЬNULL(СпособыРаспределения.Коэффициент, 1)
	|	КОНЕЦ
	|
	|ИТОГИ
	|	МАКСИМУМ(СуммаВыручки),
	|	МАКСИМУМ(Себестоимость),
	|	СУММА(КоэффициентРаспределения)
	|
	|ПО
	|	Организация,
	|	Подразделение,
	|	СпособРаспределения
	|";
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ФинансовыеРезультаты.Имя;
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаПодразделение = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
		
		Пока ВыборкаПодразделение.Следующий() Цикл
			
			ВыборкаСпособыРаспределения = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СпособРаспределения");
			
			Пока ВыборкаСпособыРаспределения.Следующий() Цикл
				
				ВсегоДолей            = ВыборкаСпособыРаспределения.КоэффициентРаспределения;
				РасходыКРаспределению = ВыборкаСпособыРаспределения.Себестоимость;
				ДоходыКРаспределению  = ВыборкаСпособыРаспределения.СуммаВыручки;
				
				ВыборкаДетали = ВыборкаСпособыРаспределения.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				Пока ВыборкаДетали.Следующий() Цикл

					Если ВсегоДолей <> 0 Тогда
						Расходы = Окр(РасходыКРаспределению * ВыборкаДетали.КоэффициентРаспределения / ВсегоДолей,
										2, РежимОкругления.Окр15как20);
					Иначе
						Расходы = 0;
					КонецЕсли;

					Если ВсегоДолей <> 0 Тогда
						Доходы = Окр(ДоходыКРаспределению * ВыборкаДетали.КоэффициентРаспределения / ВсегоДолей,
										2, РежимОкругления.Окр15как20);
					Иначе
						Доходы = 0;
					КонецЕсли;

					РасходыКРаспределению = РасходыКРаспределению - Расходы;
					ДоходыКРаспределению  = ДоходыКРаспределению  - Доходы;
					ВсегоДолей            = ВсегоДолей            - ВыборкаДетали.КоэффициентРаспределения;

					// Формирование движений по фин. результату.
					ДанныеДвижения = Новый Структура(
						"Период, ДокументДвижения, Организация, Подразделение, НаправлениеДеятельности, СпособРаспределения");
					
					ЗаполнитьЗначенияСвойств(ДанныеДвижения, ВыборкаДетали);
					
					Если Доходы <> 0 Тогда
						ДанныеДвижения.Вставить("Доходы", 		 Доходы);
						ДанныеДвижения.Вставить("СтатьяДоходов", ВыборкаДетали.СтатьяДоходов);
					КонецЕсли;

					Если Расходы <> 0 Тогда
						ДанныеДвижения.Вставить("Расходы", 		  Расходы);
						ДанныеДвижения.Вставить("СтатьяРасходов", ВыборкаДетали.СтатьяРасходов);
					КонецЕсли;
					
					Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения);
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТТаблицаВыручки, ВтТаблицаРаспределения");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры

// Этап 4.2
Процедура СписатьПрочиеДоходыРасходы(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "СписатьПрочиеДоходыРасходы");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК ДокументДвижения,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|	ПрочиеДоходы.Организация 					КАК Организация,
	|	ПрочиеДоходы.Подразделение 					КАК Подразделение,
	|	ПрочиеДоходы.СтатьяДоходов 					КАК СтатьяДоходов,
	|	ПрочиеДоходы.АналитикаДоходов 				КАК АналитикаДоходов,
	|	ПрочиеДоходы.Сумма							КАК Сумма
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеДоходы КАК ПрочиеДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО ПрочиеДоходы.Организация = ДокументыРасчетаСебестоимости.Организация
	|ГДЕ
	|	ПрочиеДоходы.Сумма <> 0
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя,
		Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК ДокументДвижения,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|	ПрочиеРасходы.Организация 					КАК Организация,
	|	ПрочиеРасходы.Подразделение 				КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов 				КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов 			КАК АналитикаРасходов,
	|	ПрочиеРасходы.Сумма							КАК Сумма
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО ПрочиеРасходы.Организация = ДокументыРасчетаСебестоимости.Организация
	|ГДЕ
	|	ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|	И ПрочиеРасходы.Сумма <> 0
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя,
		Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 4.3
Процедура ОтразитьПрибылиИУбытки(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ОтразитьПрибылиИУбытки");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Организация				КАК Организация,
	|	ВыручкаИСебестоимость.Организация				КАК Аналитика,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности 	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица1
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период 								КАК Период,
	|		АналитикаПоПартнерам.Организация                			КАК Организация,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА ВыручкаИСебестоимость.ТипЗапасов В (
	|			Значение(Перечисление.ТипыЗапасов.Товар),
	|			Значение(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА
	|			ВыручкаИСебестоимость.СуммаВыручки
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ 														КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Организация				КАК Организация,
	|	ВыручкаИСебестоимость.Организация				КАК Аналитика,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности 	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 						  КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период 							  КАК Период,
	|		АналитикаПоПартнерам.Организация 						  КАК Организация,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА ВыручкаИСебестоимость.ТипЗапасов В (
	|			Значение(Перечисление.ТипыЗапасов.Товар),
	|			Значение(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА
	|			ВыручкаИСебестоимость.Себестоимость
	|			+ ВыручкаИСебестоимость.СуммаДополнительныхРасходов
	|		ИНАЧЕ
	|			ВыручкаИСебестоимость.СуммаДополнительныхРасходов
	|		КОНЕЦ 													  КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Организация				КАК Аналитика,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица2
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Организация                			КАК Организация,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.СуммаВыручки							КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		И НЕ ВыручкаИСебестоимость.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Организация				КАК Аналитика,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Организация                			КАК Организация,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Себестоимость
	|			+ ВыручкаИСебестоимость.СуммаДополнительныхРасходов 	КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		И НЕ ВыручкаИСебестоимость.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	 КАК ВидДвижения,
	|	ПрочиеДоходы.Регистратор				 КАК ДокументДвижения,
	|	ПрочиеДоходы.Период						 КАК Период,
	|	ПрочиеДоходы.Организация				 КАК Организация,
	|	ПрочиеДоходы.Организация				 КАК Аналитика,
	|	ПрочиеДоходы.НаправлениеДеятельности	 КАК НаправлениеДеятельности,
	|	СУММА(ПрочиеДоходы.Сумма)				 КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица3
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеДоходы КАК ПрочиеДоходы
	|ГДЕ
	|	НЕ &ФормироватьФинансовыйРезультат
	|	И ПрочиеДоходы.РасчетСебестоимости
	|	И НЕ ПрочиеДоходы.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеДоходы.Регистратор,
	|	ПрочиеДоходы.Период,
	|	ПрочиеДоходы.Организация,
	|	ПрочиеДоходы.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	  КАК ВидДвижения,
	|	ПрочиеРасходы.Регистратор				  КАК ДокументДвижения,
	|	ПрочиеРасходы.Период					  КАК Период,
	|	ПрочиеРасходы.Организация				  КАК Организация,
	|	ПрочиеРасходы.Организация				  КАК Аналитика,
	|	ПрочиеРасходы.НаправлениеДеятельности	  КАК НаправлениеДеятельности,
	|	СУММА(ПрочиеРасходы.Сумма) 			      КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица4
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	НЕ &ФормироватьФинансовыйРезультат
	|	И ПрочиеРасходы.РасчетСебестоимости
	|	И НЕ ПрочиеРасходы.СлужебноеВидДвиженияПриход
	|	И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходы.Регистратор,
	|	ПрочиеРасходы.Период,
	|	ПрочиеРасходы.Организация,
	|	ПрочиеРасходы.НаправлениеДеятельности
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДанныеДвижений.ДокументДвижения 	 								  КАК ДокументДвижения,
	|	ДанныеДвижений.Период				 								  КАК Период,
	|	ДанныеДвижений.Организация			 								  КАК Организация,
	|	ДанныеДвижений.Аналитика			 								  КАК Аналитика,
	|	ДанныеДвижений.НаправлениеДеятельности			 					  КАК НаправлениеДеятельности,
	|	ДанныеДвижений.ВидДвижения			 								  КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки) КАК Статья,
	|	СУММА(ДанныеДвижений.Сумма)			 								  КАК Сумма
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Аналитика								КАК Аналитика,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица1 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Аналитика								КАК Аналитика,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица2 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Аналитика								КАК Аналитика,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица3 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Аналитика								КАК Аналитика,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица4 КАК Т
	|
	|	) КАК ДанныеДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДвижений.ДокументДвижения,
	|	ДанныеДвижений.Период,
	|	ДанныеДвижений.Организация,
	|	ДанныеДвижений.Аналитика,
	|	ДанныеДвижений.НаправлениеДеятельности,
	|	ДанныеДвижений.ВидДвижения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеДвижений.Сумма) <> 0
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя,
		Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТПромежуточнаяТаблица1, ВТПромежуточнаяТаблица2, ВТПромежуточнаяТаблица3, ВТПромежуточнаяТаблица4");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 4.4
Процедура ОтразитьВУправленческомБалансе(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ОтразитьВУправленческомБалансе");
	
	// Дополним перечень измененных документов документами внеоборотных активов.
	// Для полученного перечня документов установим признак необходимости повторного отражения в учете.
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ТекстЗапросаУправленческогоБаланса
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыОрганизаций.АналитикаРасходов КАК Объект
	|ПОМЕСТИТЬ ВТВнеоборотныеАктивы
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.СтатьяРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	И ТоварыОрганизаций.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СебестоимостьТоваров.АналитикаРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|ГДЕ
	|	СебестоимостьТоваров.СтатьяРасходовСписания.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.Стоимость КАК Стоимость,
	|	Т.СуммаДопРасходов КАК СуммаДопРасходов,
	|	Т.Трудозатраты КАК Трудозатраты,
	|	Т.ПостатейныеСНДС КАК ПостатейныеСНДС
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Стоимость + Т.СуммаДопРасходов + Т.Трудозатраты + Т.ПостатейныеСНДС <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗапасов,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТПрочиеДоходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеДоходы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТПрочиеРасходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТПартииПрочихРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК Т
	|ГДЕ
	|	Т.Стоимость <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Статья КАК Статья,
	|	Т.Аналитика КАК Аналитика,
	|	Т.Сумма КАК Сумма,
	|	Т.ВидИсточника КАК ВидИсточника,
	|	Т.Источник КАК Источник
	|ПОМЕСТИТЬ ВТАктивыПассивы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеАктивыПассивы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыКОтражению.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ ДокументыКОтражению
	|ИЗ
	|	(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СебестоимостьТоваров.Регистратор КАК Ссылка
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		НЕ(СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров)
	//++ НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеДокумента.Ссылка КАК Ссылка
	|	ИЗ
	|		ВТВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС.ОС КАК ДанныеДокумента
	|			ПО ВнеоборотныеАктивы.Объект = ДанныеДокумента.ОсновноеСредство
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Проведен
	|		И ДанныеДокумента.Ссылка.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		ВТВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС.ОС КАК ДанныеДокумента
	|			ПО ВнеоборотныеАктивы.Объект = ДанныеДокумента.ОсновноеСредство
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Проведен
	|		И ДанныеДокумента.Ссылка.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		ВТВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуНМА КАК ДанныеДокумента
	|			ПО ВнеоборотныеАктивы.Объект = ДанныеДокумента.НематериальныйАктив
	|	ГДЕ
	|		ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Проведен
	|		И ДанныеДокумента.Ссылка.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТрудозатратыНЗП.Регистратор
	|	ИЗ
	|		ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНЗП
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПартииПрочихРасходов.Регистратор
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.Регистратор) <> ТИП(Документ.СчетФактураНалоговыйАгент)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеАктивыПассивы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ГДЕ
	|		ПрочиеАктивыПассивы.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеДоходы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеДоходы КАК ПрочиеДоходы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеРасходы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеРасходы КАК ПрочиеРасходы
	|
	|) КАК ДокументыКОтражению
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	#КонецОбласти
	
	ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ДокументыКОтражению");
	Запрос.Выполнить();
	ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
	
	Если УниверсальныеМеханизмыПартийИСебестоимости.РазмерВременнойТаблицы(ПараметрыРасчета, "ДокументыКОтражению") > 0 Тогда
		
		// Передадим временную таблицу ДокументыКОтражению
		ПараметрыДвижений = Новый Структура;
		ПараметрыДвижений.Вставить("ВидОтложенногоРасчета", Перечисления.ВидыИсточниковУправленческогоБаланса.РасчетСебестоимости);
		ПараметрыДвижений.Вставить("ДокументыКОтражению",   ПараметрыРасчета.МенеджерВременныхТаблиц);
		ПараметрыДвижений.Вставить("Период", ПараметрыРасчета.РасчетныйПериод.НачалоПериода);
		
		ЗапросДвижений = УправленческийУчетПроведениеСервер.ЗапросДвиженийАктивовПассивов(ПараметрыДвижений);
		
		УниверсальныеМеханизмыПартийИСебестоимости.СформироватьДвиженияПоРегиструПоДаннымЗапроса(
			ПараметрыРасчета,
			Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя,
			ЗапросДвижений);
			
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			ЗапросДвижений.Параметры.ИменаВременныхТаблиц);
		
	КонецЕсли;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ДокументыКОтражению, ВТВнеоборотныеАктивы, ВТСебестоимость, ВТПрочиеДоходы, ВТПрочиеРасходы, ВТПартииПрочихРасходов, ВТАктивыПассивы");
	
	УниверсальныеМеханизмыПартийИСебестоимости.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаВтТаблицаРасходовПоОстаткам()
	
	ТекстЗапроса = "
	| ВЫБРАТЬ
	|	ТаблицаРасходы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.Подразделение КАК Подразделение,
	|	ТаблицаРасходы.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаРасходы.ПравилоРаспределения КАК ПравилоРаспределения,
	|	ТаблицаРасходы.Сумма КАК Сумма,
	|	ТаблицаРасходы.СуммаБезНДС КАК СуммаБезНДС,
	|	ТаблицаРасходы.СуммаРегл КАК СуммаРегл,
	|	ТаблицаРасходы.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ТаблицаРасходы.ВременнаяРазница КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтТаблицаРасходов
	|ИЗ
	|	&ТаблицаРасходов КАК ТаблицаРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаСпособовРаспределения()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.ПравилоРаспределения КАК ПравилоРаспределения,
	|	ТаблицаРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ВЫБОР КОГДА ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	ТОГДА
	|		Ложь
	|	ИНАЧЕ
	|		Истина
	|	КОНЕЦ КАК АналитикаЗаполнена,
	|	МАКСИМУМ(ТаблицаРасходы.НомерСтроки) КАК ИндексБазы
	|ПОМЕСТИТЬ ТаблицаСпособовРаспределения
	|ИЗ
	|	ВтТаблицаРасходов КАК ТаблицаРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.ПравилоРаспределения,
	|	ТаблицаРасходы.АналитикаРасходов,
	|	ВЫБОР КОГДА ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИЛИ ТаблицаРасходы.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	ТОГДА
	|		Ложь
	|	ИНАЧЕ
	|		Истина
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаДокументов()
	
	ТекстЗапроса = "
	// Поступление товаров по конкретным документам закупки или по заказам поставщикам.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ТаблицаТовары
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаЗаполнена
	|		И (ДанныеДокумента.Ссылка = ТаблицаСпособовРаспределения.АналитикаРасходов
	|       	ИЛИ ТаблицаТовары.ЗаказПоставщику = ТаблицаСпособовРаспределения.АналитикаРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Поступления товаров по любым документам закупки.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ТаблицаТовары
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ТаблицаТовары.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		И ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Перемещения товаров по конкретным документам перемещения или по заказам на перемещение.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаЗаполнена
	|		И (ДанныеДокумента.Ссылка = ТаблицаСпособовРаспределения.АналитикаРасходов
	|       	ИЛИ ДанныеДокумента.ЗаказНаПеремещение = ТаблицаСпособовРаспределения.АналитикаРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Перемещения товаров по любым документам перемещения или по любым заказам на перемещение.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДанныеДокумента.ЗаказНаПеремещение <> ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка) И ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
	|		ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Передачи товаров между организациями.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаСпособовРаспределения.АналитикаРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаПоступленияТоваров()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.КоличествоОстаток КАК Количество,
	|	УчетСебестоимости.СтоимостьОстаток КАК Стоимость
	|ПОМЕСТИТЬ ВтПоступленияТоваров
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|		РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|		И Организация В(&МассивОрганизаций)
	|	) КАК УчетСебестоимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ТОГДА
	|			0
	|		ИНАЧЕ
	|			УчетСебестоимости.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров ТОГДА
	|			0
	|		ИНАЧЕ
	|			УчетСебестоимости.Стоимость
	|		КОНЕЦ
	|	) КАК Стоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|ГДЕ
	|	УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|		ИЛИ УчетСебестоимости.Регистратор ССЫЛКА Документ.СборкаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.ИндексБазы КАК ИндексБазы,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(УчетСебестоимости.Количество) КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость) КАК Стоимость
	|ПОМЕСТИТЬ ТаблицаПоступленияТоваров
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК УчетСебестоимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|			ПО УчетСебестоимости.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|ГДЕ
	// движения прошлых периодов
	|	УчетСебестоимости.Период < &НачалоПериода
	|	И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И УчетСебестоимости.Активность
	|	И УчетСебестоимости.Организация В (&МассивОрганизаций)
	|	И (УчетСебестоимости.АналитикаУчетаНоменклатуры, УчетСебестоимости.ВидЗапасов) В (
	|		ВЫБРАТЬ
	|       	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|           ВтПоступленияТоваров.ВидЗапасов
	|		ИЗ
	|			ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.ИндексБазы,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.ИндексБазы КАК ИндексБазы,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(УчетСебестоимости.Количество) КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость) КАК Стоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументов КАК ТаблицаДокументов
	|			ПО УчетСебестоимости.Регистратор = ТаблицаДокументов.Ссылка
	|	
	|ГДЕ
	|	УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И (УчетСебестоимости.АналитикаУчетаНоменклатуры, УчетСебестоимости.ВидЗапасов) В (
	|		ВЫБРАТЬ
	|       	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|           ВтПоступленияТоваров.ВидЗапасов
	|		ИЗ
	|			ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументов.ИндексБазы,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы,
	|	ВтПоступленияТоваров.Организация КАК Организация,
	|	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВтПоступленияТоваров.ВидЗапасов КАК ВидЗапасов,
	|	СУММА(ВтПоступленияТоваров.Количество) КАК Количество,
	|	СУММА(ВтПоступленияТоваров.Стоимость) КАК Стоимость
	|ИЗ
	|	ВтПоступленияТоваров КАК ВтПоступленияТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО ВтПоступленияТоваров.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|			ПО ВтПоступленияТоваров.Организация = ТаблицаСпособовРаспределения.Организация
	|			И (ТаблицаСпособовРаспределения.АналитикаРасходов = АналитикаНоменклатуры.Склад
	|				ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = АналитикаНоменклатуры.Номенклатура
	|				ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ИЛИ ТаблицаСпособовРаспределения.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСпособовРаспределения.ИндексБазы,
	|	ВтПоступленияТоваров.Организация,
	|	ВтПоступленияТоваров.АналитикаУчетаНоменклатуры,
	|	ВтПоступленияТоваров.ВидЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИндексБазы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаБазыРаспределения()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы,
	|	ТаблицаСпособовРаспределения.Организация КАК Организация,
	|	ТаблицаСпособовРаспределения.ПравилоРаспределения КАК ПравилоРаспределения,
	|	ТаблицаСпособовРаспределения.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаПоступленияТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаПоступленияТоваров.ВидЗапасов КАК ВидЗапасов,
	|	ВЫБОР КОГДА ТаблицаСпособовРаспределения.ПравилоРаспределения
	|		= ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьТоваров.ПропорциональноКоличеству)
	|	ТОГДА
	|		ЕСТЬNULL(ТаблицаПоступленияТоваров.Количество, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаПоступленияТоваров.Стоимость, 0)
	|	КОНЕЦ КАК База
	|
	|ИЗ
	|	ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаПоступленияТоваров КАК ТаблицаПоступленияТоваров
	|	ПО
	|		ТаблицаСпособовРаспределения.ИндексБазы = ТаблицаПоступленияТоваров.ИндексБазы
	|		И ТаблицаСпособовРаспределения.Организация = ТаблицаПоступленияТоваров.Организация
	|ИТОГИ
	|	СУММА(База)
	|ПО
	|	ИндексБазы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Служебная, этап 3.2 (ТаблицаРаспределенияРасходовНаСебестоимостьТоваров)
Функция ТекстЗапросаТаблицаРасходов()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаРасходы.НомерСтроки) КАК НомерСтроки,
	|	&КонецПериода КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах) КАК РазделУчета,
	|	ТаблицаРасходы.Организация КАК Организация,
	|	ТаблицаРасходы.Подразделение КАК Подразделение,
	|	ТаблицаРасходы.СтатьяРасходов КАК СтатьяРасходовСписания,
	|	ТаблицаРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаСпособовРаспределения.ИндексБазы КАК ИндексБазы,
	|	СУММА(ТаблицаРасходы.Сумма) КАК Сумма,
	|	СУММА(ТаблицаРасходы.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ТаблицаРасходы.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаРасходы.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ТаблицаРасходы.ВременнаяРазница) КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика) КАК ХозяйственнаяОперация
	|ИЗ
	|	ВтТаблицаРасходов КАК ТаблицаРасходы
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ТаблицаСпособовРаспределения КАК ТаблицаСпособовРаспределения
	|	ПО
	|		ТаблицаРасходы.ПравилоРаспределения = ТаблицаСпособовРаспределения.ПравилоРаспределения
	|		И ТаблицаРасходы.АналитикаРасходов = ТаблицаСпособовРаспределения.АналитикаРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходы.Организация,
	|	ТаблицаРасходы.Подразделение,
	|	ТаблицаРасходы.СтатьяРасходов,
	|	ТаблицаРасходы.АналитикаРасходов,
	|	ТаблицаСпособовРаспределения.ИндексБазы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции


// Служебная, этап 3.7
Функция ТекстЗапросаДвиженияСтоимости()

	ТекстЗапроса = 
	"
	// В качестве вектора решений на первой итерации берутся свободные коэффициенты.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                             КАК НомерУзла,
	|	УзлыКорректировки.ВременнаяРазницаЗнак                                  КАК ВременнаяРазницаЗнак,
	|	УзлыКорректировки.ПостояннаяРазницаЗнак                                 КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Стоимость КАК ЧИСЛО(23,10))                  КАК Стоимость,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьБезНДС КАК ЧИСЛО(23,10))            КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостояннаяРазница КАК ЧИСЛО(23,10))          КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВременнаяРазница КАК ЧИСЛО(23,10))           КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьДопРасходы КАК ЧИСЛО(23,10))        КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьДопРасходыБезНДС КАК ЧИСЛО(23,10))  КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая КАК ЧИСЛО(23,10))      КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Трудозатраты КАК ЧИСЛО(23,10))  				КАК Трудозатраты,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеСНДС КАК ЧИСЛО(23,10))  			КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеБезНДС КАК ЧИСЛО(23,10))  		КАК ПостатейныеБезНДС
	|
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//++ НЕ УТ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов, 
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС
	|ПОМЕСТИТЬ
	|	Выпуски
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	//-- НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов
	|ПОМЕСТИТЬ
	|	РаботыДляДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	|	И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|	И &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	И НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//-- НЕ УТ
	|
	// Подготовим таблицу списаний за период (коэффициенты уравнения)
	|ВЫБРАТЬ
	|	УчетСебестоимости.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|	ЛОЖЬ 								КАК ПередачаВЭксплуатацию,
	|	ИСТИНА								КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								КАК КосвенныеЗатратыНУ,
	|	МАКСИМУМ(УчетСебестоимости.Постатейные) КАК Постатейные,
	|	МАКСИМУМ(УчетСебестоимости.РаботаДляДавальца) КАК РаботаДляДавальца,
	|	МАКСИМУМ(УчетСебестоимости.ПродукцияДавальца) КАК ПродукцияДавальца,
	|	СУММА(УчетСебестоимости.Количество) КАК Количество
	|
	|ПОМЕСТИТЬ ВтПеремещенияСписания
	|ИЗ (
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет) ТОГДА
	|			УзлыКорректировкиПриемникРеглУчет.НомерУзла
	|		КОГДА УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|			УзлыКорректировкиПриемникПередачи.НомерУзла
	|		ИНАЧЕ
	|			УзлыКорректировкиПриемник.НомерУзла
	|		КОНЕЦ КАК НомерУзлаПриемник,
	|
	|		ВЫБОР КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет) ТОГДА
	|			УзлыКорректировкиПриемникРеглУчет.Количество
	|		КОГДА УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|			УзлыКорректировкиПриемникПередачи.Количество
	|		ИНАЧЕ
	|			УзлыКорректировкиПриемник.Количество
	|		КОНЕЦ КАК ВсегоКоличество,
	|
	|		УчетСебестоимости.Количество КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		(ВЫБОР
	|			КОГДА &ПартионныйУчетВерсии22 И
	|				(ЛОЖЬ
	//++ НЕ УТ
	|				ИЛИ НЕ РаботыДляДавальца.Регистратор ЕСТЬ NULL
	//-- НЕ УТ
	|				) ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета               = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 				 = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорОрганизация 				 = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникПередачи
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемникПередачи.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемникПередачи.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникПередачи.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемникПередачи.Организация
	|			И УчетСебестоимости.КорОрганизация 				 <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.РазделУчета 				 <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемникПередачи.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемникПередачи.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемникПередачи.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемникПередачи.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникРеглУчет
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры 	 = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 				 = УзлыКорректировкиПриемникРеглУчет.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникРеглУчет.ВидЗапасов
	|			И ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация) = УзлыКорректировкиПриемникРеглУчет.Организация
	|			И УчетСебестоимости.КорПартия 					 = УзлыКорректировкиПриемникРеглУчет.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий 	 = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемникРеглУчет.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС 		 = УзлыКорректировкиПриемникРеглУчет.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	//++ НЕ УТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|			ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|			И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|			И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	//-- НЕ УТ
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И НЕ (УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			И УчетСебестоимости.Количество < 0
	|			И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)
	//++ НЕ УТ
	|		И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|			И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	|		И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|			И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	//-- НЕ УТ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  		 КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемникРеглУчет.НомерУзла  КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемникРеглУчет.Количество КАК ВсегоКоличество,
	|		УзлыКорректировкиПриемникРеглУчет.Количество КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета               = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникРеглУчет
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры 	 = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемникРеглУчет.ВидЗапасов
	|			И ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация) = УзлыКорректировкиПриемникРеглУчет.Организация
	|			И УчетСебестоимости.КорПартия 					 = УзлыКорректировкиПриемникРеглУчет.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий 	 = УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемникРеглУчет.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС 		 = УзлыКорректировкиПриемникРеглУчет.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|		И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		И УзлыКорректировкиПриемникРеглУчет.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла  КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		УчетСебестоимости.Количество КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВтПередачиТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиИсточник.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемник.Организация
	|	ГДЕ
	|		УчетСебестоимости.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	//++ НЕ УТ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Списание материалов на производственные статьи расходов
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла  КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА -УчетСебестоимости.Количество
	|			ИНАЧЕ УчетСебестоимости.Количество КОНЕЦ) КАК Количество,
	|		(ВЫБОР
	|			КОГДА &ПартионныйУчетВерсии22 ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Справочник.Назначения КАК СпрНазначения
	|		ПО
	|			КлючиАналитики.Назначение = СпрНазначения.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО
	|			УчетСебестоимости.СтатьяРасходовСписания = Статьи.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтАналитикаУчетаРасходов КАК Аналитика
	|		ПО
	|			УчетСебестоимости.Организация = Аналитика.Организация
	|			И УчетСебестоимости.Подразделение = Аналитика.Подразделение
	|			И УчетСебестоимости.СтатьяРасходовСписания = Аналитика.СтатьяРасходов
	|			И УчетСебестоимости.АналитикаРасходов = Аналитика.АналитикаРасходов
	|			И ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = Аналитика.НаправлениеДеятельности
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			Аналитика.Ссылка = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.Организация = УзлыКорректировкиПриемник.Организация
	|			И УзлыКорректировкиПриемник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ГДЕ
	|		УчетСебестоимости.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаПрочиеЦели))
	|		И Статьи.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение постатейных расходов на этапы производства
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		Расходы.ПоказательОтнесенияНаПартию КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|				ПО Расходы.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|				И Расходы.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|				И Расходы.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Расходы.Регистратор
	|			И УзлыКорректировкиИсточник.Организация = Расходы.Организация
	|			И УзлыКорректировкиИсточник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры = Расходы.ДокументИсточник
	|			И УзлыКорректировкиПриемник.Организация = Расходы.Организация
	|			И УзлыКорректировкиПриемник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			И УзлыКорректировкиПриемник.Партия = ИдентификаторыПартий.ИдентификаторПартии
	|			И УзлыКорректировкиПриемник.АналитикаФинансовогоУчета = Расходы.Подразделение
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Расходы.СлужебноеВидДвиженияПриход
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение постатейных расходов на выпуск продукции 22
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник22.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник22.Количество КАК ВсегоКоличество,
	|		Расходы.ПоказательОтнесенияНаВыпуск КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|				ПО Расходы.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|				И Расходы.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|				И Расходы.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Расходы.ДокументИсточник
	|			И УзлыКорректировкиИсточник.Организация = Расходы.Организация
	|			И УзлыКорректировкиИсточник.Партия = ИдентификаторыПартий.ИдентификаторПартии
	|			И УзлыКорректировкиИсточник.АналитикаФинансовогоУчета = Расходы.Подразделение
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Расходы.АналитикаУчетаПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|			ПО АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|			И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|			И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|			И АналитикаПродукцииБезНазначения.Склад = Аналитика.Склад
	|			И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			И НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Выпуски КАК Выпуски
	|		ПО
	|			Выпуски.Регистратор = Расходы.Регистратор
	|			И ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= Выпуски.АналитикаУчетаНоменклатуры
	|			И Выпуски.РазделУчета = Расходы.РазделУчета
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник22
	|		ПО
	|			ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= УзлыКорректировкиПриемник22.АналитикаУчетаНоменклатуры
	|			И Расходы.РазделУчета = УзлыКорректировкиПриемник22.РазделУчета
	|			И Расходы.Организация = УзлыКорректировкиПриемник22.Организация
	|			И Выпуски.ВидЗапасов = УзлыКорректировкиПриемник22.ВидЗапасов
	|			И Выпуски.Партия = УзлыКорректировкиПриемник22.Партия
	|			И Выпуски.АналитикаУчетаПартий = УзлыКорректировкиПриемник22.АналитикаУчетаПартий
	|			И Выпуски.АналитикаФинансовогоУчета = УзлыКорректировкиПриемник22.АналитикаФинансовогоУчета
	|			И Выпуски.ВидДеятельностиНДС = УзлыКорректировкиПриемник22.ВидДеятельностиНДС
	|	ГДЕ
	|		НЕ Расходы.СлужебноеВидДвиженияПриход
	|		И Расходы.ДокументИсточник <> ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|		И &ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение постатейных расходов на выпуск продукции 21
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник21.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник21.Количество КАК ВсегоКоличество,
	|		Расходы.ДоляСтоимости КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Расходы.ДокументИсточник
	|			И УзлыКорректировкиИсточник.Организация = Расходы.Организация
	|			И УзлыКорректировкиИсточник.Партия = Расходы.ПартияПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Расходы.АналитикаУчетаПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|			ПО АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|			И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|			И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|			И АналитикаПродукцииБезНазначения.Склад = Аналитика.Склад
	|			И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			И НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник21
	|		ПО
	|			ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= УзлыКорректировкиПриемник21.АналитикаУчетаНоменклатуры
	|			И Расходы.РазделУчета = УзлыКорректировкиПриемник21.РазделУчета
	|			И Расходы.Организация = УзлыКорректировкиПриемник21.Организация
	|			И (ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов 
	|				ТОГДА Расходы.ВидЗапасов = УзлыКорректировкиПриемник21.ВидЗапасов
	|				ИНАЧЕ ИСТИНА КОНЕЦ)
	|	ГДЕ
	|		НЕ Расходы.СлужебноеВидДвиженияПриход
	|		И Расходы.ДокументИсточник <> ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|		И НЕ &ПартионныйУчетВерсии22
	|
	// Распределение возвратных отходов
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		УчетСебестоимости.Количество КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ЛОЖЬ КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УзлыКорректировкиИсточник.РазделУчета 	  = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 				 = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорОрганизация 				 = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И УчетСебестоимости.Количество < 0
	|		И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|
	// Распределение затрат на работы по выпуску продукции из давальческого сырья.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		УчетСебестоимости.Количество КАК Количество,
	|		ЛОЖЬ КАК Постатейные,
	|		ИСТИНА КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|			ПО УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета               = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|			ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|			И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|			И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|			ПО РаботыДляДавальца.АналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И РаботыДляДавальца.РазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И РаботыДляДавальца.ВидЗапасов 				     = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 				 = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|			И УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	//-- НЕ УТ
	|	) КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаПриемник
	|";

	Возврат ТекстЗапроса;

КонецФункции

// Служебная, этап 3.11
Функция ТекстЗапросаДвиженияСтоимостиРегл()

	ТекстЗапроса = 
	"
	// В качестве вектора решений на первой итерации берутся свободные коэффициенты.
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла                                            КАК НомерУзла,
	|	УзлыКорректировки.ВременнаяРазницаЗнак                                 КАК ВременнаяРазницаЗнак,
	|	УзлыКорректировки.ПостояннаяРазницаЗнак                                КАК ПостояннаяРазницаЗнак,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Стоимость КАК ЧИСЛО(23,10))                 КАК Стоимость,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьБезНДС КАК ЧИСЛО(23,10))           КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостояннаяРазница КАК ЧИСЛО(23,10))         КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВременнаяРазница КАК ЧИСЛО(23,10))          КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьДопРасходы КАК ЧИСЛО(23,10))       КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьДопРасходыБезНДС КАК ЧИСЛО(23,10)) КАК СтоимостьДопРасходыБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.СтоимостьЗабалансовая КАК ЧИСЛО(23,10))     КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Трудозатраты КАК ЧИСЛО(23,10))  			   КАК Трудозатраты,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеСНДС КАК ЧИСЛО(23,10))  		   КАК ПостатейныеСНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ПостатейныеБезНДС КАК ЧИСЛО(23,10))  	   КАК ПостатейныеБезНДС
	|
	|ПОМЕСТИТЬ ВтТаблицаРешений
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//++ НЕ УТ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов, 
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС
	|ПОМЕСТИТЬ
	|	Выпуски
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И (ДД.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	//-- НЕ УТКА
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//-- НЕ УТ
	|
	// Подготовим таблицу списаний за период (коэффициенты уравнения)
	|ВЫБРАТЬ
	|	УчетСебестоимости.НомерУзлаИсточник 			  КАК НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник 			  КАК НомерУзлаПриемник,
	|	УчетСебестоимости.ПередачаВЭксплуатацию           КАК ПередачаВЭксплуатацию,
	|	МАКСИМУМ(УчетСебестоимости.ПринимаемыеВНУ)        КАК ПринимаемыеВНУ,
	|	МАКСИМУМ(УчетСебестоимости.КосвенныеЗатратыНУ) 	  КАК КосвенныеЗатратыНУ,
	|	МАКСИМУМ(УчетСебестоимости.Постатейные)			  КАК Постатейные,
	|	МАКСИМУМ(УчетСебестоимости.РаботаДляДавальца)	  КАК РаботаДляДавальца,
	|	МАКСИМУМ(УчетСебестоимости.ПродукцияДавальца)	  КАК ПродукцияДавальца,
	|	СУММА(УчетСебестоимости.Количество) 			  КАК Количество
	|
	|ПОМЕСТИТЬ ВтПеремещенияСписания
	|ИЗ (
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УзлыКорректировкиПриемник.Количество  КАК ВсегоКоличество,
	|	УчетСебестоимости.Количество          КАК Количество,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ,
	|	ЛОЖЬ			 					  КАК Постатейные,
	|	ЛОЖЬ								  КАК РаботаДляДавальца,
	|	(ВЫБОР
	|		КОГДА &ПартионныйУчетВерсии22 И
	|			(ЛОЖЬ
	//++ НЕ УТ
	|			ИЛИ НЕ РаботыДляДавальца.Регистратор ЕСТЬ NULL
	//-- НЕ УТ
	|			) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ПродукцияДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|		И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|		И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|		И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|		И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры   = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорРазделУчета 			  	 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 			  	 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И УчетСебестоимости.Организация 			  	 = УзлыКорректировкиПриемник.Организация
	|		И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|		И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|		И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|		И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|
	//++ НЕ УТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	//-- НЕ УТ
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И НЕ (УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И УчетСебестоимости.Количество < 0
	|		И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)
	//++ НЕ УТ
	|	И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|		И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	|	И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УзлыКорректировкиПриемник.Количество  КАК ВсегоКоличество,
	|	УчетСебестоимости.Количество          КАК Количество,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ,
	|	ЛОЖЬ			 					  КАК Постатейные,
	|	ЛОЖЬ								  КАК РаботаДляДавальца,
	|	ЛОЖЬ								  КАК ПродукцияДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|		И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|		И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|		И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|		И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры   = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И УчетСебестоимости.КорОрганизация 				 = УзлыКорректировкиПриемник.Организация
	|		И УчетСебестоимости.КорПартия              	  	 = УзлыКорректировкиПриемник.Партия
	|		И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|		И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|		И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|	И УчетСебестоимости.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УзлыКорректировкиПриемник.Количество  КАК ВсегоКоличество,
	|	УчетСебестоимости.Количество          КАК Количество,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ,
	|	ЛОЖЬ			 					  КАК Постатейные,
	|	ЛОЖЬ								  КАК РаботаДляДавальца,
	|	ЛОЖЬ								  КАК ПродукцияДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|		И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|		И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|		И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|		И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры 	 = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|		И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация) = УзлыКорректировкиПриемник.Организация
	|		И УчетСебестоимости.КорПартия              	  	 = УзлыКорректировкиПриемник.Партия
	|		И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|		И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|		И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УзлыКорректировкиПриемник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировкиИсточник.НомерУзла   КАК НомерУзлаИсточник,
	|	УзлыКорректировкиПриемник.НомерУзла   КАК НомерУзлаПриемник,
	|	УзлыКорректировкиПриемник.Количество  КАК ВсегоКоличество,
	|	УчетСебестоимости.Количество          КАК Количество,
	|	ЛОЖЬ 								  КАК ПередачаВЭксплуатацию,
	|	ИСТИНА 								  КАК ПринимаемыеВНУ,
	|	ЛОЖЬ 								  КАК КосвенныеЗатратыНУ,
	|	ЛОЖЬ			 					  КАК Постатейные,
	|	ЛОЖЬ								  КАК РаботаДляДавальца,
	|	ЛОЖЬ								  КАК ПродукцияДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры   = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.РазделУчета  			  = УзлыКорректировкиИсточник.РазделУчета
	|		И УчетСебестоимости.ВидЗапасов  			  = УзлыКорректировкиИсточник.ВидЗапасов
	|		И УчетСебестоимости.Организация  			  = УзлыКорректировкиИсточник.Организация
	|		И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|		И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|		И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|		И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|	ПО УчетСебестоимости.АналитикаУчетаНоменклатуры 	 = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|		И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|		И ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация) = УзлыКорректировкиПриемник.Организация
	|		И УчетСебестоимости.КорПартия              	  	 = УзлыКорректировкиПриемник.Партия
	|		И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|		И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|		И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|			ИЛИ НЕ &ПартионныйУчетВерсии22)
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Списание материалов на производственные статьи расходов
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла  КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход ТОГДА -УчетСебестоимости.Количество
	|			ИНАЧЕ УчетСебестоимости.Количество КОНЕЦ) КАК Количество,
	|		(ВЫБОР
	|			КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) 				КАК ПередачаВЭксплуатацию,
	|		Статьи.ПринятиеКНалоговомуУчету 	КАК ПринимаемыеВНУ,
	|		Статьи.КосвенныеЗатратыНУ 			КАК КосвенныеЗатратыНУ,
	|		(ВЫБОР
	|			КОГДА &ПартионныйУчетВерсии22 ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ)				КАК Постатейные,
	|		ЛОЖЬ								КАК РаботаДляДавальца,
	|		ЛОЖЬ								КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета 			  = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов 				  = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			  = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Справочник.Назначения КАК СпрНазначения
	|		ПО
	|			КлючиАналитики.Назначение = СпрНазначения.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО
	|			УчетСебестоимости.СтатьяРасходовСписания = Статьи.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтАналитикаУчетаРасходов КАК Аналитика
	|		ПО
	|			УчетСебестоимости.Организация = Аналитика.Организация
	|			И УчетСебестоимости.Подразделение = Аналитика.Подразделение
	|			И УчетСебестоимости.СтатьяРасходовСписания = Аналитика.СтатьяРасходов
	|			И УчетСебестоимости.АналитикаРасходов = Аналитика.АналитикаРасходов
	|			И ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = Аналитика.НаправлениеДеятельности
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			Аналитика.Ссылка = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.Организация = УзлыКорректировкиПриемник.Организация
	|			И УзлыКорректировкиПриемник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ПередачиВЭксплуатацию
	|			ПО ПередачиВЭксплуатацию.Ссылка = УчетСебестоимости.Регистратор
	|			И ПередачиВЭксплуатацию.ИдентификаторСтроки = УчетСебестоимости.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииЭксплуатации КАК Категория
	|			ПО Категория.Ссылка = ПередачиВЭксплуатацию.КатегорияЭксплуатации
	|			И Категория.СпособПогашенияСтоимостиБУ = Категория.СпособПогашенияСтоимостиНУ
	|	ГДЕ
	|		УчетСебестоимости.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию),
	|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаПрочиеЦели))
	|		И Статьи.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И (ЕСТЬNULL(Категория.СпособПогашенияСтоимостиБУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПустаяСсылка))
	|			<> ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПоСроку))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение постатейных расходов на этапы производства
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла		КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла		КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество	КАК ВсегоКоличество,
	|		Расходы.ПоказательОтнесенияНаПартию		КАК Количество,
	|		ЛОЖЬ 								 КАК ПередачаВЭксплуатацию,
	|		Статьи.ПринятиеКНалоговомуУчету 	 КАК ПринимаемыеВНУ,
	|		Статьи.КосвенныеЗатратыНУ 			 КАК КосвенныеЗатратыНУ,
	|		ЛОЖЬ		 					  	 КАК Постатейные,
	|		ЛОЖЬ								 КАК РаботаДляДавальца,
	|		ЛОЖЬ								 КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|			ПО Расходы.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|			И Расходы.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|			И Расходы.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Расходы.Регистратор
	|			И УзлыКорректировкиИсточник.Организация = Расходы.Организация
	|			И УзлыКорректировкиИсточник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры = Расходы.ДокументИсточник
	|			И УзлыКорректировкиПриемник.Организация = Расходы.Организация
	|			И УзлыКорректировкиПриемник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			И УзлыКорректировкиПриемник.Партия = ИдентификаторыПартий.ИдентификаторПартии
	|			И УзлыКорректировкиПриемник.АналитикаФинансовогоУчета = Расходы.Подразделение
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО
	|			Расходы.СтатьяРасходов = Статьи.Ссылка
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Расходы.СлужебноеВидДвиженияПриход
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение постатейных расходов на выпуск продукции 2.1
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник21.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник21.Количество КАК ВсегоКоличество,
	|		Расходы.ДоляСтоимости				 КАК Количество,
	|		ЛОЖЬ 								 КАК ПередачаВЭксплуатацию,
	|		Статьи.ПринятиеКНалоговомуУчету 	 КАК ПринимаемыеВНУ,
	|		Статьи.КосвенныеЗатратыНУ 			 КАК КосвенныеЗатратыНУ,
	|		ЛОЖЬ		 					  	 КАК Постатейные,
	|		ЛОЖЬ								 КАК РаботаДляДавальца,
	|		ЛОЖЬ								 КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Расходы.ДокументИсточник
	|			И УзлыКорректировкиИсточник.Организация = Расходы.Организация
	|			И УзлыКорректировкиИсточник.Партия = Расходы.ПартияПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Расходы.АналитикаУчетаПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|			ПО АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|			И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|			И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|			И АналитикаПродукцииБезНазначения.Склад = Аналитика.Склад
	|			И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			И НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Выпуски КАК Выпуски
	|		ПО
	|			Выпуски.Регистратор = Расходы.Регистратор
	|			И ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= Выпуски.АналитикаУчетаНоменклатуры
	|			И Выпуски.РазделУчета = Расходы.РазделУчета
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник21
	|		ПО
	|			ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= УзлыКорректировкиПриемник21.АналитикаУчетаНоменклатуры
	|			И Расходы.РазделУчета = УзлыКорректировкиПриемник21.РазделУчета
	|			И Расходы.Организация = УзлыКорректировкиПриемник21.Организация
	|			И (ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов 
	|				ТОГДА Расходы.ВидЗапасов = УзлыКорректировкиПриемник21.ВидЗапасов
	|				ИНАЧЕ ИСТИНА КОНЕЦ)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО
	|			Расходы.СтатьяРасходов = Статьи.Ссылка
	|	ГДЕ
	|		НЕ Расходы.СлужебноеВидДвиженияПриход
	|		И Расходы.ДокументИсточник <> ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|		И НЕ &ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение постатейных расходов на выпуск продукции 2.2
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник22.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник22.Количество КАК ВсегоКоличество,
	|		Расходы.ПоказательОтнесенияНаВыпуск	 КАК Количество,
	|		ЛОЖЬ 								 КАК ПередачаВЭксплуатацию,
	|		Статьи.ПринятиеКНалоговомуУчету 	 КАК ПринимаемыеВНУ,
	|		Статьи.КосвенныеЗатратыНУ 			 КАК КосвенныеЗатратыНУ,
	|		ЛОЖЬ		 					  	 КАК Постатейные,
	|		ЛОЖЬ								 КАК РаботаДляДавальца,
	|		ЛОЖЬ								 КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК ИдентификаторыПартий
	|			ПО Расходы.ПартияПроизводства = ИдентификаторыПартий.ПартияПроизводства
	|			И Расходы.ЗаказНаПроизводство = ИдентификаторыПартий.ЗаказНаПроизводство
	|			И Расходы.КодСтрокиПродукция = ИдентификаторыПартий.КодСтрокиПродукция
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Расходы.ДокументИсточник
	|			И УзлыКорректировкиИсточник.Организация = Расходы.Организация
	|			И УзлыКорректировкиИсточник.Партия = ИдентификаторыПартий.ИдентификаторПартии
	|			И УзлыКорректировкиИсточник.АналитикаФинансовогоУчета = Расходы.Подразделение
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Расходы.АналитикаУчетаПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|			ПО АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|			И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|			И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|			И АналитикаПродукцииБезНазначения.Склад = Аналитика.Склад
	|			И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			И НЕ &УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Выпуски КАК Выпуски
	|		ПО
	|			Выпуски.Регистратор = Расходы.Регистратор
	|			И ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= Выпуски.АналитикаУчетаНоменклатуры
	|			И Выпуски.РазделУчета = Расходы.РазделУчета
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник22
	|		ПО
	|			ЕСТЬNULL(АналитикаПродукцииБезНазначения.КлючАналитики, Расходы.АналитикаУчетаПродукции)
	|				= УзлыКорректировкиПриемник22.АналитикаУчетаНоменклатуры
	|			И Расходы.РазделУчета = УзлыКорректировкиПриемник22.РазделУчета
	|			И Расходы.Организация = УзлыКорректировкиПриемник22.Организация
	|			И Выпуски.ВидЗапасов = УзлыКорректировкиПриемник22.ВидЗапасов
	|			И Выпуски.Партия = УзлыКорректировкиПриемник22.Партия
	|			И Выпуски.АналитикаУчетаПартий = УзлыКорректировкиПриемник22.АналитикаУчетаПартий
	|			И Выпуски.АналитикаФинансовогоУчета = УзлыКорректировкиПриемник22.АналитикаФинансовогоУчета
	|			И Выпуски.ВидДеятельностиНДС = УзлыКорректировкиПриемник22.ВидДеятельностиНДС
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО
	|			Расходы.СтатьяРасходов = Статьи.Ссылка
	|	ГДЕ
	|		НЕ Расходы.СлужебноеВидДвиженияПриход
	|		И Расходы.ДокументИсточник <> ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|		И &ПартионныйУчетВерсии22
	|
	// Распределение возвратных отходов
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла  КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		УчетСебестоимости.Количество         КАК Количество,
	|		ЛОЖЬ                                 КАК ПередачаВЭксплуатацию,
	|		ИСТИНА                               КАК ПринимаемыеВНУ,
	|		ЛОЖЬ                                 КАК КосвенныеЗатратыНУ,
	|		ЛОЖЬ		 					  	 КАК Постатейные,
	|		ЛОЖЬ								 КАК РаботаДляДавальца,
	|		ЛОЖЬ								 КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|		ПО
	|			УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УзлыКорректировкиИсточник.РазделУчета 	  = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|		ПО
	|			УчетСебестоимости.КорАналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.КорРазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И УчетСебестоимости.КорВидЗапасов 				 = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 			     = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорОрганизация 				 = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			И УчетСебестоимости.КорПартия              	  	 = УзлыКорректировкиПриемник.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|			И (УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|			И (УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|				ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|			ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|			И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|			И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ГДЕ
	|		НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И УчетСебестоимости.Количество < 0
	|		И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|
	// Распределение затрат на работы по выпуску продукции из давальческого сырья.
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
	|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
	|		УзлыКорректировкиПриемник.Количество КАК ВсегоКоличество,
	|		УчетСебестоимости.Количество КАК Количество,
	|		ЛОЖЬ КАК ПередачаВЭксплуатацию,
	|		ИСТИНА КАК ПринимаемыеВНУ,
	|		ЛОЖЬ КАК КосвенныеЗатратыНУ,
	|		ЛОЖЬ КАК Постатейные,
	|		ИСТИНА КАК РаботаДляДавальца,
	|		ЛОЖЬ КАК ПродукцияДавальца
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
	|			ПО УчетСебестоимости.АналитикаУчетаНоменклатуры  = УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры
	|			И УчетСебестоимости.РазделУчета               = УзлыКорректировкиИсточник.РазделУчета
	|			И УчетСебестоимости.ВидЗапасов                = УзлыКорректировкиИсточник.ВидЗапасов
	|			И УчетСебестоимости.Организация               = УзлыКорректировкиИсточник.Организация
	|			И УчетСебестоимости.Партия              	  = УзлыКорректировкиИсточник.Партия
	|			И УчетСебестоимости.АналитикаУчетаПартий      = УзлыКорректировкиИсточник.АналитикаУчетаПартий
	|			И УчетСебестоимости.АналитикаФинансовогоУчета = УзлыКорректировкиИсточник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.ВидДеятельностиНДС        = УзлыКорректировкиИсточник.ВидДеятельностиНДС
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|			ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|			И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|			И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
	|			ПО РаботыДляДавальца.АналитикаУчетаНоменклатуры  = УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
	|			И РаботыДляДавальца.РазделУчета 				 = УзлыКорректировкиПриемник.РазделУчета
	|			И РаботыДляДавальца.ВидЗапасов 				     = УзлыКорректировкиПриемник.ВидЗапасов
	|			И УчетСебестоимости.Организация 				 = УзлыКорректировкиПриемник.Организация
	|			И УчетСебестоимости.КорПартия              	     = УзлыКорректировкиПриемник.Партия
	|			И УчетСебестоимости.КорАналитикаУчетаПартий      = УзлыКорректировкиПриемник.АналитикаУчетаПартий
	|			И УчетСебестоимости.КорАналитикаФинансовогоУчета = УзлыКорректировкиПриемник.АналитикаФинансовогоУчета
	|			И УчетСебестоимости.КорВидДеятельностиНДС        = УзлыКорректировкиПриемник.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	//-- НЕ УТ
	|	) КАК УчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.НомерУзлаИсточник,
	|	УчетСебестоимости.НомерУзлаПриемник,
	|	УчетСебестоимости.ПередачаВЭксплуатацию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаПриемник
	|";

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ФормированиеДвижений

#Область ДвиженияНоменклатура

// Служебная, этап 2.1, 3.3, 3.14, 3.19
Процедура СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, ДанныеДвижения)
	
	ДанныеСумм = Новый Структура;
	ДанныеСумм.Вставить("Стоимость", 			  0);
	ДанныеСумм.Вставить("СтоимостьБезНДС", 		  0);
	ДанныеСумм.Вставить("СуммаДопРасходов", 	  0);
	ДанныеСумм.Вставить("СуммаДопРасходовБезНДС", 0);
	ДанныеСумм.Вставить("Трудозатраты", 		  0);
	ДанныеСумм.Вставить("ПостатейныеСНДС", 		  0);
	ДанныеСумм.Вставить("ПостатейныеБезНДС", 	  0);
	ДанныеСумм.Вставить("СтоимостьРегл", 		  0);
	ДанныеСумм.Вставить("ДопРасходыРегл", 		  0);
	ДанныеСумм.Вставить("ТрудозатратыРегл", 	  0);
	ДанныеСумм.Вставить("ПостатейныеРегл", 		  0);
	
	ЗаполнитьЗначенияСвойств(ДанныеСумм, ДанныеДвижения);
	
	Стоимость 		= ДанныеСумм.Стоимость + ДанныеСумм.СуммаДопРасходов + ДанныеСумм.Трудозатраты + ДанныеСумм.ПостатейныеСНДС;
	СтоимостьБезНДС = ДанныеСумм.СтоимостьБезНДС + ДанныеСумм.СуммаДопРасходовБезНДС + ДанныеСумм.Трудозатраты + ДанныеСумм.ПостатейныеБезНДС;
	СтоимостьРегл	= ДанныеСумм.СтоимостьРегл + ДанныеСумм.ДопРасходыРегл + ДанныеСумм.ТрудозатратыРегл + ДанныеСумм.ПостатейныеРегл;
	
	Если Стоимость <> 0 ИЛИ СтоимостьБезНДС <> 0 ИЛИ СтоимостьРегл <> 0 Тогда
		
		// Формирование движений Номенклатура - Доходы\Расходы.
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			//++ НЕ УТ
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставОС
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставНМА
			//-- НЕ УТ
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакрытиеМесяца Тогда
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, Стоимость, СтоимостьБезНДС, СтоимостьРегл);
			
		КонецЕсли;
		
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы Тогда
			
			Знак = ?(ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка, 1, -1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				Знак * Стоимость,
				Знак * СтоимостьБезНДС,
				Знак * СтоимостьРегл);
			
		КонецЕсли;
		
		// Формирование движений Номенклатура - Номенклатура.
		Если (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтПереработчика
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаОбособленногоУчета
			ИЛИ ((ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров
					ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеВПроизводстве)
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВПроизводство
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПереработчику
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
			
			СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения,
				Стоимость,
				СтоимостьБезНДС,
				СтоимостьРегл,
				?(ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности,
					Перечисления.ХозяйственныеОперации.ОтгрузкаБезПереходаПраваСобственности,
					Неопределено));
			
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаТоваров Тогда
				СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения,
					Стоимость,
					СтоимостьБезНДС,
					СтоимостьРегл,
					Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих доходов\расходов при пересортице.
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой Тогда

		СуммаПереоценки = Стоимость - ДанныеДвижения.КорСтоимость;
		
		Если СуммаПереоценки > 0 Тогда 
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СуммаПереоценки,
				0,
				СтоимостьРегл,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		ИначеЕсли СуммаПереоценки < 0 Тогда
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				-СуммаПереоценки,
				0,
				-СтоимостьРегл,
				Истина,
				Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих расходов при порче.
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой Тогда
		
		СуммаПереоценки = Стоимость - ДанныеДвижения.КорСтоимость;
		
		Если СуммаПереоценки <> 0 Тогда
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СуммаПереоценки,
				СтоимостьБезНДС,
				СтоимостьРегл,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих доходов/расходов возникших от переоценки товаров.
	Если (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
			И ДанныеДвижения.КорСтоимость <> 0)
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары Тогда
		
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями Тогда
			СуммаПереоценки = 0;
		Иначе
			СуммаПереоценки = Стоимость;
		КонецЕсли;
		
		Если СуммаПереоценки > 0 ИЛИ СтоимостьРегл > 0 Тогда 

			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СуммаПереоценки,
				0,
				СтоимостьРегл,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		ИначеЕсли СуммаПереоценки < 0 Тогда
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				-СуммаПереоценки,
				0,
				-СтоимостьРегл,
				Истина,
				Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14 (СформироватьДвиженияПоОборотнымРегистрамУпрУчета)
Процедура СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
			Стоимость, СтоимостьБезНДС, СтоимостьРегл, ЭтоДоход = Ложь,	ХозяйственнаяОперация = Неопределено)

	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.Стоимость	   = Стоимость;
	Запись.СтоимостьБезНДС = СтоимостьБезНДС;
	Запись.СтоимостьРегл   = СтоимостьРегл;
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		Запись.ХозяйственнаяОперация = ХозяйственнаяОперация;
	КонецЕсли;
	
	Если ЭтоДоход Тогда
		Запись.СтатьяДоходовРасходов = ДанныеДвижения.СтатьяДоходов;
		Запись.АналитикаДоходов 	 = ДанныеДвижения.АналитикаДоходов;
		Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.НаправлениеДеятельности;
		Запись.НаправлениеДеятельностиСтатьи = ДанныеДвижения.НаправлениеДеятельности;
	Иначе
		Запись.СтатьяДоходовРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		Запись.АналитикаРасходов 	 = ДанныеДвижения.АналитикаРасходов;
		Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.НаправлениеДеятельности;
		Запись.НаправлениеДеятельностиСтатьи = ДанныеДвижения.НаправлениеДеятельности;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14 (СформироватьДвиженияПоОборотнымРегистрамУпрУчета)
Процедура СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения,
			Стоимость, СтоимостьБезНДС, СтоимостьРегл, ХозяйственнаяОперация)
	
	Если НЕ ЗначениеЗаполнено(ДанныеДвижения.КорАналитикаУчетаНоменклатуры)
	 И (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров
	 	ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,НаправлениеДеятельности,
	|КорАналитикаУчетаНоменклатуры,КорСклад,КорТипЗапасов,КорВидЗапасов,КорНаправлениеДеятельности,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, ДокументДвижения, КорОрганизация";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Если ХозяйственнаяОперация <> Неопределено Тогда
		Запись.ХозяйственнаяОперация = ХозяйственнаяОперация;
		Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров Тогда
			Запись.Организация    = ДанныеДвижения.КорОрганизация;
			Запись.КорОрганизация = ДанныеДвижения.Организация;
		КонецЕсли;
	КонецЕсли;
	
	Запись.Стоимость		= Стоимость;
	Запись.СтоимостьБезНДС	= СтоимостьБезНДС;
	Запись.СтоимостьРегл	= СтоимостьРегл;
	
	Если ТипЗнч(ДанныеДвижения.Склад) = Тип("СправочникСсылка.Партнеры") Тогда
		Запись.Количество = ДанныеДвижения.Количество;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.18
Процедура СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля = "Период, ХозяйственнаяОперация, Организация,
	|НаправлениеДеятельностиНоменклатуры, НаправлениеДеятельностиСтатьи, АналитикаУчетаНоменклатуры,
	|Склад, Подразделение, СтатьяДоходовРасходов, АналитикаРасходов, ВидЗапасов, ТипЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения, СтоимостьРегл";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период 														КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНДСНаРасходы) 	КАК ХозяйственнаяОперация,
	|	Партии.Организация 													КАК Организация,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельностиНоменклатуры,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельностиСтатьи,
	|	Партии.АналитикаУчетаНоменклатуры 									КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Склад											КАК Склад,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ТОГДА АналитикаНоменклатуры.Склад
	|		ИНАЧЕ ЕСТЬNULL(СпрСклады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ 																КАК Подразделение,
	|	Партии.СтатьяСписанияНДС 											КАК СтатьяДоходовРасходов,
	|	Партии.АналитикаСписанияНДС 										КАК АналитикаРасходов,
	|	Партии.ВидЗапасов													КАК ВидЗапасов,
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(СпрВидыЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ 																КАК ТипЗапасов,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ 																КАК ИсточникГФУНоменклатуры,
	|	Партии.Регистратор 													КАК ДокументДвижения,
	|	СУММА(Партии.СписаниеНДС) 											КАК СтоимостьРегл
	|ИЗ
	|	ВтПартии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО Партии.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
	|			ПО АналитикаНоменклатуры.Склад = СпрСклады.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО АналитикаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ПО Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Склад,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ТОГДА АналитикаНоменклатуры.Склад
	|		ИНАЧЕ ЕСТЬNULL(СпрСклады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	СпрНазначения.НаправлениеДеятельности,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.ВидЗапасов,
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(СпрВидыЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.СписаниеНДС) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияСебестоимостьТоваров

// Служебная, этап 2.1, 3.3, 3.14
Процедура СформироватьДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения, ВидДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	// Кор. стоимость не включается в список полей.
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
	|ХозяйственнаяОперация,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов,КорОрганизация,
	|АналитикаУчетаПоПартнерам, ЗаказКлиента,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|СтатьяАктивовПассивов, АналитикаАктивовПассивов,
	|ИдентификаторСтроки, КодСтроки, ДокументДвижения, ПериодПродажи, ГруппаПродукции,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|ПостояннаяРазница, ВременнаяРазница, СтоимостьРегл, СтоимостьЗабалансоваяРегл";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
		|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
		|НДСРегл, СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, АналитикаУчетаПартийПроизводства,
		|Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
		|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл";
	КонецЕсли;

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвижения;
	Запись.Количество  = 0;

КонецПроцедуры

// Служебная, этап 2.1, 3.14
Процедура СформироватьДвиженияСебестоимостьТоваровСторноВУпрУчете(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, Организация,
	|ХозяйственнаяОперация, ДокументДвижения,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания,
	|Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|ПостояннаяРазница, ВременнаяРазница";

	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник,
		|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
		|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения   = ВидДвиженияНакопления.Приход;
	Запись.Организация   = Справочники.Организации.УправленческаяОрганизация;
	Запись.ВидЗапасов    = ДанныеДвижения.КорВидЗапасов;
	Запись.СтоимостьРегл = ДанныеДвижения.СтоимостьРегл + ДанныеДвижения.НДСРегл;
	Запись.Количество    = 0;
	
	Если ДанныеДвижения.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию Тогда
		Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах;
	Иначе
		Запись.РазделУчета = ДанныеДвижения.РазделУчета;
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		Если ПараметрыРасчета.ОрганизацииСФИФОСкользящая.Найти(Справочники.Организации.УправленческаяОрганизация) <> Неопределено Тогда
			Запись.Партия                 	 = ДанныеДвижения.КорПартия;
			Запись.АналитикаУчетаПартий   	 = ДанныеДвижения.КорАналитикаУчетаПартий;
		КонецЕсли;
		Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
		Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1, 3.14
Процедура СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки,
	|Подразделение, ГруппаПродукции,
	|Стоимость, СтоимостьЗабалансовая, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, ПостояннаяРазница, ВременнаяРазница";

	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, АналитикаУчетаПартийПроизводства,
		|Трудозатраты, ПостатейныеСНДС, ПостатейныеБезНДС,
		|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения                = ВидДвиженияНакопления.Приход;
	Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
	Запись.РазделУчета                = ДанныеДвижения.КорРазделУчета;
	Запись.ВидЗапасов                 = ДанныеДвижения.КорВидЗапасов;
	Запись.Организация                = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
	Запись.Количество 				  = 0;
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		Запись.Партия                 	 = ДанныеДвижения.КорПартия;
		Запись.АналитикаУчетаПартий   	 = ДанныеДвижения.КорАналитикаУчетаПартий;
	КонецЕсли;
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
		Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
		Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
		 И ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
			Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
		КонецЕсли;
	КонецЕсли;
	Если Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение Тогда
		Запись.КорВидЗапасов             = ДанныеДвижения.КорВидЗапасов;
	КонецЕсли;

	Если ДанныеДвижения.ЭтоПередачаМеждуОрганизациями Тогда
		Запись.СтоимостьРегл = 0;
		Запись.СтоимостьЗабалансоваяРегл = 0;
		Запись.ПостояннаяРазница = 0;
		Запись.ВременнаяРазница = 0;
		Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
			Запись.ДопРасходыРегл = 0;
			Запись.ТрудозатратыРегл = 0;
			Запись.ПостатейныеРегл = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеДвижения.НДСРегл <> 0 И НЕ ДанныеДвижения.ЭтоПередачаМеждуОрганизациями Тогда
		
		КопируемыеПоля = "
		|Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки,
		|Подразделение, Организация";
		Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
			КопируемыеПоля = КопируемыеПоля + ",
			|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник";
		КонецЕсли;
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения 				  	 = ВидДвиженияНакопления.Приход;
		Запись.АналитикаУчетаНоменклатуры 	 = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
		Запись.РазделУчета 				  	 = ДанныеДвижения.КорРазделУчета;
		Запись.ВидЗапасов 				  	 = ДанныеДвижения.КорВидЗапасов;
		Запись.Организация                	 = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
		Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
			Запись.Партия                 	 = ДанныеДвижения.КорПартия;
			Запись.АналитикаУчетаПартий   	 = ДанныеДвижения.КорАналитикаУчетаПартий;
		КонецЕсли;
		Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
			Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
			Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			 И ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
				Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
			КонецЕсли;
		КонецЕсли;
		
		Запись.СтоимостьРегл 			  	 = ДанныеДвижения.НДСРегл;
		
	КонецЕсли;

КонецПроцедуры

//++ НЕ УТ

// Служебная, этап 2.3, 3.15
Процедура СформироватьДвиженияСебестоимостьТоваровСписаниеНЗП(ПараметрыРасчета, ДанныеДвижения, Суммы)

	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, РазделУчета, Подразделение, ГруппаПродукции, ДокументДвижения, СтатьяКалькуляции";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ЗаполнитьЗначенияСвойств(Запись, Суммы);
	
	Запись.ВидДвижения 				  = ВидДвиженияНакопления.Приход;
	Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.АналитикаУчетаПродукцииСебестоимость;
	Запись.ХозяйственнаяОперация 	  = Перечисления.ХозяйственныеОперации.ВыпускПродукции;
	Запись.ВидЗапасов 				  = ?(ПараметрыРасчета.ФО.УчитыватьСебестоимостьТоваровПоВидамЗапасов, ДанныеДвижения.ВидЗапасов, Неопределено);

КонецПроцедуры

//-- НЕ УТ
#КонецОбласти

#Область ДвиженияПрочиеРасходы

// Служебная, этап 2.1, 3.18
Процедура СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "Период, ВидДвижения, ХозяйственнаяОперация, Организация, АналитикаУчетаНоменклатуры, НаправлениеДеятельности,
	|Подразделение, СтатьяРасходов, АналитикаРасходов, ДокументДвижения, СуммаРегл";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период 														КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 								КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНДСНаРасходы) 	КАК ХозяйственнаяОперация,
	|	Партии.Организация 													КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры 									КАК АналитикаУчетаНоменклатуры,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ТОГДА АналитикаНоменклатуры.Склад
	|		ИНАЧЕ ЕСТЬNULL(Склады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ 																КАК Подразделение,
	|	Партии.СтатьяСписанияНДС 											КАК СтатьяРасходов,
	|	Партии.АналитикаСписанияНДС 										КАК АналитикаРасходов,
	|	Партии.Регистратор 													КАК ДокументДвижения,
	|	СУММА(Партии.СписаниеНДС) 											КАК СуммаРегл
	|ИЗ
	|	ВтПартии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|			ПО АналитикаНоменклатуры.Склад = Склады.Ссылка
	|		ПО Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ТОГДА АналитикаНоменклатуры.Склад
	|		ИНАЧЕ ЕСТЬNULL(Склады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	СпрНазначения.НаправлениеДеятельности,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.СписаниеНДС) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1, 3.3, 3.14
Процедура СформироватьДвиженияПрочиеРасходы(ПараметрыРасчета, ДанныеДвижения,
			Сумма, СуммаБезНДС, СуммаРегл, ПостояннаяРазница, ВременнаяРазница,
			ФормироватьФинансовыйРезультат = Неопределено)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, АналитикаРасходов, ХозяйственнаяОперация, НаправлениеДеятельности,
	|АналитикаУчетаНоменклатуры, ГруппаПродукции, ДокументДвижения";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
	 И НачалоМесяца(ДанныеДвижения.ПериодПродажи) < НачалоМесяца(ДанныеДвижения.Период) Тогда
		Знак = -1;
	Иначе
		Знак = 1;
	КонецЕсли;
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения       = ВидДвиженияНакопления.Приход;
	Запись.Сумма             = Знак * Сумма;
	Запись.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовСписания;
	//++ НЕ УТ
	Если ДанныеДвижения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты Тогда
		Запись.СуммаБезНДС = Знак * СуммаБезНДС;
	КонецЕсли;
	
	Если НЕ ДанныеДвижения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы
	 И НЕ ДанныеДвижения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы Тогда
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
			Запись.СуммаРегл = 0;
			Запись.ПостояннаяРазница = ?(ДанныеДвижения.СписаниеПриПередачеНУ, ПостояннаяРазница - ?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, СуммаРегл, 0), 0);
			Запись.ВременнаяРазница = ?(ДанныеДвижения.СписаниеПриПередачеНУ, ВременнаяРазница - ?(ДанныеДвижения.ПринятиеКНалоговомуУчету, СуммаРегл, 0), 0);
		Иначе
			Запись.СуммаРегл = Знак * СуммаРегл;
			Запись.ПостояннаяРазница = Знак * ПостояннаяРазница + ?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, Знак * СуммаРегл, 0);
			Запись.ВременнаяРазница  = Знак * ВременнаяРазница;
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	
	Если ФормироватьФинансовыйРезультат = Неопределено Тогда
		ФормироватьФинансовыйРезультат = ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат;
	КонецЕсли;
	
	Если НЕ ФормироватьФинансовыйРезультат
	 И ДанныеДвижения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности
	 И Сумма <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения       = ВидДвиженияНакопления.Расход;
		Запись.Сумма             = Сумма;
		Запись.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовСписания;
		
	КонецЕсли;

КонецПроцедуры

//++ НЕ УТ

// Служебная, этап 2.3, 3.15
Процедура СформироватьДвиженияПрочиеРасходыСписаниеНЗП(ПараметрыРасчета, ДанныеДвижения, Суммы)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности, ДокументДвижения, КорПодразделение";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения 	  		 = ВидДвиженияНакопления.Расход;
	Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции;
	Запись.Подразделение 	  	 = ДанныеДвижения.ИсходноеПодразделение;
	
	Запись.Сумма 			  	 = Суммы.Стоимость + Суммы.СуммаДопРасходов
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.Трудозатраты + Суммы.ПостатейныеСНДС, 0);
	Запись.СуммаБезНДС 	  		 = Суммы.СтоимостьБезНДС + Суммы.СуммаДопРасходовБезНДС
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.Трудозатраты + Суммы.ПостатейныеБезНДС, 0);
	Запись.СуммаРегл 		  	 = Суммы.СтоимостьРегл
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.ДопРасходыРегл + Суммы.ТрудозатратыРегл + Суммы.ПостатейныеРегл, 0);
	
	Запись.ПостояннаяРазница 	 = Суммы.ПостояннаяРазница;
	Запись.ВременнаяРазница  	 = Суммы.ВременнаяРазница;
	
КонецПроцедуры

// Служебная, этап 2.4, 3.16
Процедура СформироватьДвиженияПрочиеРасходыПрочееСписаниеНЗП(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки";
	
	// Расход по исходной статье
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
	Запись.КорСтатьяРасходов = ДанныеДвижения.СтатьяРасходовПолучатель;
	Запись.КорПодразделение = ДанныеДвижения.Подразделение;
	
	Запись.Сумма 			 = ДанныеДвижения.Стоимость + ДанныеДвижения.СуммаДопРасходов;
	Запись.СуммаБезНДС 		 = ДанныеДвижения.СтоимостьБезНДС + ДанныеДвижения.СуммаДопРасходовБезНДС;
	Запись.СуммаРегл 		 = ДанныеДвижения.СтоимостьРегл;
	Запись.ПостояннаяРазница = ДанныеДвижения.ПостояннаяРазница;
	Запись.ВременнаяРазница  = ДанныеДвижения.ВременнаяРазница;
	
	// Приход по новой статье.
	Если ЗначениеЗаполнено(ДанныеДвижения.СтатьяРасходовПолучатель) Тогда
	
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения 		 = ВидДвиженияНакопления.Приход;
		Запись.НаправлениеДеятельности 	 = ДанныеДвижения.НаправлениеДеятельностиПолучатель;
		Запись.СтатьяРасходов 	 = ДанныеДвижения.СтатьяРасходовПолучатель;
		Запись.АналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
		Запись.КорСтатьяРасходов = ДанныеДвижения.СтатьяРасходов;
		Запись.КорПодразделение = ДанныеДвижения.Подразделение;
		
		Запись.Сумма 			 = ДанныеДвижения.Стоимость + ДанныеДвижения.СуммаДопРасходов;
		Запись.СуммаБезНДС 		 = 0;
		Запись.СуммаРегл 		 = ДанныеДвижения.СтоимостьРегл;
		Запись.ПостояннаяРазница = ДанныеДвижения.ПостояннаяРазница;
		Запись.ВременнаяРазница  = ДанныеДвижения.ВременнаяРазница;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДвижения.СтатьяАктивовПассивов) Тогда
		СформироватьДвиженияПрочиеАктивыПассивы(ПараметрыРасчета, ДанныеДвижения, ДанныеДвижения.Стоимость + ДанныеДвижения.СуммаДопРасходов);
	КонецЕсли;
	
КонецПроцедуры

//-- НЕ УТ
#КонецОбласти

#Область ДвиженияПрочиеДоходы

// Служебная, этап 2.1, 3.3, 3.14
Процедура СформироватьДвиженияПрочиеДоходы(ПараметрыРасчета, ДанныеДвижения, Сумма)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяДоходов, АналитикаДоходов, ХозяйственнаяОперация";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Сумма	   = Сумма;
	
	Если НЕ ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Запись.Сумма	   = Сумма;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДвиженияВыручкаИСебестоимостьПродаж

// Служебная, этап 2.2, 3.17, 3.18
Процедура СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, АналитикаУчетаНоменклатуры, Менеджер,
	|АналитикаУчетаПоПартнерам, ТипЗапасов, ВидЗапасов, ЗаказКлиента, ХозяйственнаяОперация,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, НаправлениеДеятельностиНоменклатуры,
	|НаправлениеДеятельностиКонтрагента, 
	|НалогообложениеНДС, ДокументДвижения";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.Себестоимость       = ДанныеДвижения.Стоимость;
	Запись.СебестоимостьБезНДС = ДанныеДвижения.СтоимостьБезНДС;
	Запись.ПостояннаяРазница   = ДанныеДвижения.ПостояннаяРазница;
	Запись.ВременнаяРазница    = ДанныеДвижения.ВременнаяРазница;
	Запись.СебестоимостьРегл   = ДанныеДвижения.СтоимостьРегл;

	Запись.СуммаДополнительныхРасходов       = ДанныеДвижения.СуммаДопРасходов;
	Запись.СуммаДополнительныхРасходовБезНДС = ДанныеДвижения.СуммаДопРасходовБезНДС;
	
	Если ДанныеДвижения.НДСРегл <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.СебестоимостьРегл = ДанныеДвижения.НДСРегл;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 3.3
Процедура СформироватьДвиженияВыручкаИСебестоимостьПродажВозврат(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, АналитикаУчетаПоПартнерам, ЗаказКлиента, ТипЗапасов, ВидЗапасов,
	|ХозяйственнаяОперация, Менеджер, Склад, Соглашение, Договор, ДокументДвижения";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);

	// Заполним дополнительные свойства движения
	Если ЗначениеЗаполнено(ДанныеДвижения.КорАналитикаУчетаНоменклатуры) Тогда
		Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
	Иначе
		Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.АналитикаУчетаНоменклатуры;
	КонецЕсли;

	Запись.Себестоимость					 = - ДанныеДвижения.Стоимость;
	Запись.СебестоимостьБезНДС				 = - ДанныеДвижения.СтоимостьБезНДС;
	Запись.СуммаДополнительныхРасходов		 = - ДанныеДвижения.СуммаДопРасходов;
	Запись.СуммаДополнительныхРасходовБезНДС = - ДанныеДвижения.СуммаДопРасходовБезНДС;
	Запись.СебестоимостьРегл				 = - ДанныеДвижения.СтоимостьРегл;

КонецПроцедуры

#КонецОбласти

#Область ДвиженияЗакупки

// Служебная, этап 2.2, 3.17
Процедура СформироватьДвиженияЗакупки(ПараметрыРасчета, ДанныеДвижения)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.Закупки.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, Менеджер, АналитикаУчетаНоменклатуры,
	|Склад, ТипЗапасов, ВидЗапасов, Партнер, Соглашение, Договор,
	|ВалютаДокумента, ВалютаВзаиморасчетов, ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, ДокументДвижения,
	|Стоимость, СтоимостьБезНДС, СуммаДопРасходов, СуммаДопРасходовБезНДС";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.Организация 			 = ДанныеДвижения.Контрагент;
	Запись.Контрагент 			 = ДанныеДвижения.Организация;
	Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУДругойОрганизации;
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ
#Область ДвиженияПрочиеРасходыНезавершенногоПроизводства

// Служебная, этап 2.3, 3.5.2, 3.15
Процедура СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, ДанныеДвижения, Суммы)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя;
	
	КопируемыеПоля = "
	|Период, ВидДвижения, Организация, Подразделение, ЗаказНаПроизводство, КодСтрокиПродукция, Этап,
	|СтатьяКалькуляции, СтатьяРасходов, АналитикаРасходов, ГруппаПродукции,
	|Стоимость, СтоимостьБезНДС, СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница,
	|Продукция, ХарактеристикаПродукции, АналитикаУчетаПродукции, РазделУчета, ВидЗапасов, ДокументДвижения, ДокументВыпуска,
	|АналитикаУчетаПартийПроизводства, ПравилоОтнесенияНаВыпуск";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля
		+ ", ПартияПроизводства";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ЗаполнитьЗначенияСвойств(Запись, Суммы);
	
	Запись.Стоимость 	   = Суммы.Стоимость + Суммы.СуммаДопРасходов
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.Трудозатраты + Суммы.ПостатейныеСНДС, 0);
	Запись.СтоимостьБезНДС = Суммы.СтоимостьБезНДС + Суммы.СуммаДопРасходовБезНДС
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.Трудозатраты + Суммы.ПостатейныеБезНДС, 0);
	Запись.СтоимостьРегл   = Суммы.СтоимостьРегл
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.ДопРасходыРегл + Суммы.ТрудозатратыРегл + Суммы.ПостатейныеРегл, 0);
	
КонецПроцедуры

Процедура СформироватьПриходПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета, ДанныеДвижения, Суммы)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя;
	
	КопируемыеПоля = "
	|Организация, Подразделение, ЗаказНаПроизводство, КодСтрокиПродукция, Этап,
	|СтатьяКалькуляции, СтатьяРасходов, АналитикаРасходов, ГруппаПродукции,
	|Стоимость, СтоимостьБезНДС, СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница,
	|Продукция, ХарактеристикаПродукции, АналитикаУчетаПродукции, РазделУчета, ВидЗапасов";
	
	Если НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21 Тогда
		КопируемыеПоля = КопируемыеПоля
		+ ", ПартияПроизводства";
	КонецЕсли;
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ЗаполнитьЗначенияСвойств(Запись, Суммы);
	
	Запись.Период          = ДанныеДвижения.ПериодИсточника;
	Запись.Регистратор     = ДанныеДвижения.ДокументИсточник;
	Запись.ДокументДвижения = ДанныеДвижения.ДокументИсточник;
	Запись.ВидДвижения     = ВидДвиженияНакопления.Приход;
	
	Запись.Стоимость 	   = Суммы.Стоимость + Суммы.СуммаДопРасходов
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.Трудозатраты + Суммы.ПостатейныеСНДС, 0);
	Запись.СтоимостьБезНДС = Суммы.СтоимостьБезНДС + Суммы.СуммаДопРасходовБезНДС
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.Трудозатраты + Суммы.ПостатейныеБезНДС, 0);
	Запись.СтоимостьРегл   = Суммы.СтоимостьРегл
		+ ?(НЕ ПараметрыРасчета.ФИФОСкользящаяОценкаВерсии21, Суммы.ДопРасходыРегл + Суммы.ТрудозатратыРегл + Суммы.ПостатейныеРегл, 0);
	
КонецПроцедуры

#КонецОбласти
//-- НЕ УТ

#Область ДвиженияПрочиеАктивыПассивы

// Служебная, этап 2.1
Процедура СформироватьДвиженияПрочиеАктивыПассивы(ПараметрыРасчета, ДанныеДвижения, Сумма)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, НаправлениеДеятельности";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Сумма 	   = Сумма;
	Запись.Статья 	   = ДанныеДвижения.СтатьяАктивовПассивов;
	Запись.Аналитика   = ДанныеДвижения.АналитикаАктивовПассивов;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаспределениеСтоимости

// Служебная, этап 2.1, 2.2
// Формирует ВтПартии
//
Процедура ПолучитьСебестоимостьПартийТоваров(ПараметрыРасчета, ДляСтоимостиПродаж = Ложь)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ДляСтоимостиПродаж", ДляСтоимостиПродаж);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Организация КАК Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	ВЫБОР КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|		И Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Корректировка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорВидЗапасов
	|	ИНАЧЕ
	|		Партии.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаНоменклатуры
	|	КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК КорАналитикаУчетаНоменклатуры,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.Количество
	|			ИНАЧЕ Партии.Количество
	|		КОНЕЦ
	|	)										КАК Количество,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.Стоимость
	|			ИНАЧЕ Партии.Стоимость
	|		КОНЕЦ
	|	)										КАК Стоимость,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.СтоимостьБезНДС
	|			ИНАЧЕ Партии.СтоимостьБезНДС
	|		КОНЕЦ
	|	)										КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.ПостояннаяРазница
	|			ИНАЧЕ Партии.ПостояннаяРазница
	|		КОНЕЦ
	|	)										КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 
	|			ТОГДА 0 - Партии.ВременнаяРазница
	|			ИНАЧЕ Партии.ВременнаяРазница
	|		КОНЕЦ
	|	)										КАК ВременнаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА Партии.Количество < 0 
	|					ТОГДА 0 - Партии.СтоимостьРегл - Партии.НДСРегл 
	|					ИНАЧЕ Партии.СтоимостьРегл + Партии.НДСРегл 
	|				КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР
	|					КОГДА Партии.Количество < 0 
	|					ТОГДА 0 - Партии.СтоимостьРегл 
	|					ИНАЧЕ Партии.СтоимостьРегл
	|				КОНЕЦ
	|		КОНЕЦ
	|	)										КАК СтоимостьРегл,
	|
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Количество < 0 ТОГДА
	|				0 - Партии.НДСРегл
	|			ИНАЧЕ
	|				Партии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Количество < 0 ТОГДА
	|				Партии.НДСРегл
	|			ИНАЧЕ
	|				- Партии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Партии.Количество < 0 ТОГДА -Партии.НДСРегл ИНАЧЕ Партии.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	
	|	Партии.Номенклатура						КАК Номенклатура,
	|	Партии.Характеристика					КАК Характеристика,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|
	|ПОМЕСТИТЬ ТаблицаПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
	|		ПО Потребление.Ссылка = Партии.ДокументИсточник
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		(Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ Партии.Регистратор Ссылка Документ.ВозвратТоваровМеждуОрганизациями
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|			)
	|		) ИЛИ Партии.Регистратор Ссылка Документ.ВозвратТоваровМеждуОрганизациями
	|		)
	|	И НЕ (Партии.Регистратор Ссылка Документ.ВозвратТоваровОтКлиента И Партии.Первичное)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	ВЫБОР КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|		И Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Корректировка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорВидЗапасов
	|	ИНАЧЕ
	|		Партии.ВидЗапасов
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И (НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Возврат.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|			ИЛИ Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ИЛИ &ДляСтоимостиПродаж)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаНоменклатуры 
	|	КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	Партии.Номенклатура,
	|	Партии.Характеристика,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска,
	|	Партии.Регистратор
	|ПОМЕСТИТЬ ЗатратыНаВыпуск
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода	
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|ИНДЕКСИРОВАТЬ ПО
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|
	|ПОМЕСТИТЬ СборкиТоваровВидыЗапасов
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	&УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров)
	|			)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	&УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (
	|		Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ Партии.ХозяйственнаяОперация В(
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Организация КАК Организация,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ЗатратыНаВыпуск КАК ПартииЗатратНаВыпуск
	|	ПО
	|		Партии.Организация = ПартииЗатратНаВыпуск.Организация
	|		И Партии.Регистратор = ПартииЗатратНаВыпуск.Регистратор
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииЗатратНаВыпуск.АналитикаУчетаПродукции
	|		И Партии.ДокументПоступления = ПартииЗатратНаВыпуск.ДокументВыпуска
	|ГДЕ
	|	&УчитыватьСебестоимостьТоваровПоВидамЗапасов
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ НЕ УТ
	|		ИЛИ Партии.Регистратор ССЫЛКА Документ.ВозвратСырьяОтПереработчика
	|		ИЛИ Партии.Регистратор ССЫЛКА Документ.ВозвратМатериаловИзПроизводства
	|		ИЛИ Партии.Регистратор ССЫЛКА Документ.ПеремещениеМатериаловВПроизводстве
	//-- НЕ УТ
	|		)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация 						КАК Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	Партии.Регистратор 						КАК Регистратор,
	|	ВЫБОР
	|		КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|			И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ Партии.АналитикаУчетаПродукции
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|			ТОГДА Партии.КорВидЗапасов
	|		КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		 ИЛИ Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорВидЗапасов,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК КорАналитикаУчетаПродукции,
	|	0 КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.Стоимость
	|		ИНАЧЕ
	|			Партии.Стоимость
	|		КОНЕЦ) КАК Стоимость,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.СтоимостьБезНДС
	|		ИНАЧЕ
	|			Партии.СтоимостьБезНДС
	|		КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.СтоимостьРегл - Партии.НДСРегл 
	|			ИНАЧЕ
	|				Партии.СтоимостьРегл + Партии.НДСРегл 
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.СтоимостьРегл 
	|			ИНАЧЕ
	|				Партии.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ
	|	)										КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				0 - Партии.НДСРегл
	|			ИНАЧЕ
	|				Партии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА Партии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		 И Партии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|		ТОГДА
	|			ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|				Партии.НДСРегл
	|			ИНАЧЕ
	|				- Партии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА -Партии.НДСРегл ИНАЧЕ Партии.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.ПостояннаяРазница
	|		ИНАЧЕ
	|			Партии.ПостояннаяРазница
	|		КОНЕЦ) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.Знаменатель < 0 ТОГДА
	|			0 - Партии.ВременнаяРазница
	|		ИНАЧЕ
	|			Партии.ВременнаяРазница
	|		КОНЕЦ) КАК ВременнаяРазница,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаПродукции 
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаПродукции
	|	КОНЕЦ КАК АналитикаУчетаПродукции,
	|	Партии.АналитикаУчетаПродукции КАК ИсходнаяАналитикаУчетаПродукции,
	|	Партии.ДокументВыпуска,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|ПОМЕСТИТЬ СборкиТоваровПартии
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = Партии.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = Партии.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = Партии.ДокументИсточник
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И Не (Партии.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (Партии.Регистратор ССЫЛКА Документ.КорректировкаВидаДеятельностиНДС И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	//++ НЕ УТ
	|	И НЕ Партии.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|	И НЕ Партии.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|	И НЕ (Партии.Регистратор ССЫЛКА Документ.ОтчетПереработчика И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	//-- НЕ УТ
	//++ НЕ УТКА
	|	И НЕ Партии.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	//-- НЕ УТКА
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	Партии.Регистратор,
	|	ВЫБОР
	|		КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|			И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ Партии.АналитикаУчетаПродукции
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (Не Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL)
	|			И (НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|			ТОГДА Партии.КорВидЗапасов
	|		КОГДА Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		 ИЛИ Партии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Не Возврат.Ссылка ЕСТЬ NULL
	|		И Партии.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	ТОГДА
	|		Партии.КорАналитикаУчетаПродукции 
	|	ИНАЧЕ
	|		Партии.АналитикаУчетаПродукции
	|	КОНЕЦ,
	|	Партии.АналитикаУчетаПродукции,
	|	(ВЫБОР
	|		КОГДА Партии.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Партии.КорАналитикаУчетаПродукции
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	Партии.ДокументВыпуска,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация,
	|	(ВЫБОР
	|		КОГДА Партии.КорВидЗапасов <> НЕОПРЕДЕЛЕНО ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ТаблицаПартий.ВидЗапасов КОНЕЦ) КАК ВидЗапасов,
	|	Партии.Регистратор,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ПериодПродажи,
	|	Партии.Количество,
	|	Партии.Стоимость,
	|	Партии.СтоимостьБезНДС,
	|	Партии.СтоимостьРегл,
	|	Партии.НДСРегл,
	|	Партии.СписаниеНДС,
	|	Партии.ПостояннаяРазница,
	|	Партии.ВременнаяРазница,
	|	Партии.АналитикаУчетаПродукции,
	|	Партии.КорАналитикаУчетаПродукции,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|ПОМЕСТИТЬ СборкиТоваров
	|ИЗ
	|	СборкиТоваровПартии КАК Партии
	|	ЛЕВОЕ СОЕДИНЕНИЕ СборкиТоваровВидыЗапасов КАК ТаблицаПартий
	|		ПО ТаблицаПартий.Организация = Партии.Организация
	|		И ТаблицаПартий.АналитикаУчетаНоменклатуры = Партии.ИсходнаяАналитикаУчетаПродукции
	|		И ТаблицаПартий.ДокументПоступления = Партии.ДокументВыпуска
	|		И ТаблицаПартий.Регистратор = Партии.Регистратор
	|		И Партии.КорВидЗапасов = НЕОПРЕДЕЛЕНО
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Ссылка,
	|	Партии.Период КАК Дата,
	|	Партии.ДокументПоступления,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.КорВидЗапасов
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|ГДЕ
	|	Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В (&МассивОрганизаций)
	|	И (Партии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|		ИЛИ Партии.Регистратор ССЫЛКА Документ.КорректировкаРеализации)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПартииРасходов.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодПродажи,
	|	ПартииРасходов.Регистратор,
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ПартииРасходов.АналитикаУчетаНоменклатуры
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ПартииРасходов.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	
	|	(ВЫБОР
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	//++ НЕ УТКА
	|		КОГДА ПартииРасходов.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА ПартииРасходов.АналитикаУчетаНоменклатуры
	//-- НЕ УТКА
	//++ НЕ УТ
	|		КОГДА ПартииРасходов.Регистратор ССЫЛКА Документ.ВыпускПродукции ТОГДА ПартииРасходов.АналитикаУчетаНоменклатуры
	//-- НЕ УТ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.Стоимость
	|		ИНАЧЕ
	|			ПартииРасходов.Стоимость
	|		КОНЕЦ
	|	) КАК Стоимость,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.СтоимостьБезНДС
	|		ИНАЧЕ
	|			ПартииРасходов.СтоимостьБезНДС
	|		КОНЕЦ
	|	) КАК СтоимостьБезНДС,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.СтоимостьРегл - ПартииРасходов.НДСРегл 
	|			ИНАЧЕ
	|				ПартииРасходов.СтоимостьРегл + ПартииРасходов.НДСРегл 
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.СтоимостьРегл 
	|			ИНАЧЕ
	|				ПартииРасходов.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ
	|		) КАК СтоимостьРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию))
	|		 И ПартииРасходов.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				0 - ПартииРасходов.НДСРегл
	|			ИНАЧЕ
	|				ПартииРасходов.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА ПартииРасходов.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		 И ПартииРасходов.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|				ПартииРасходов.НДСРегл
	|			ИНАЧЕ
	|				- ПартииРасходов.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА -ПартииРасходов.НДСРегл ИНАЧЕ ПартииРасходов.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.ПостояннаяРазница
	|		ИНАЧЕ
	|			ПартииРасходов.ПостояннаяРазница
	|		КОНЕЦ
	|	) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР КОГДА ПартииРасходов.Количество < 0 ТОГДА
	|			0 - ПартииРасходов.ВременнаяРазница
	|		ИНАЧЕ
	|			ПартииРасходов.ВременнаяРазница
	|		КОНЕЦ
	|	) КАК ВременнаяРазница,
	|	ПартииРасходов.Период,
	|	ПартииРасходов.СтатьяСписанияНДС,
	|	ПартииРасходов.АналитикаСписанияНДС
	|ПОМЕСТИТЬ ПартииРасходов
	|ИЗ
	|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ПартииРасходов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Возвраты КАК Партии
	|		ПО Партии.Ссылка = ПартииРасходов.Регистратор
	|		И Партии.ДокументПоступления = ПартииРасходов.ДокументПоступления
	|		И Партии.АналитикаУчетаНоменклатуры = ПартииРасходов.АналитикаУчетаНоменклатуры
	|		И Партии.КорАналитикаУчетаНоменклатуры = ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		И Партии.ВидЗапасов = ПартииРасходов.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК Возврат
	|		ПО Возврат.Ссылка = ПартииРасходов.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|		ПО Корректировка.Ссылка = ПартииРасходов.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Реализация.Ссылка = ПартииРасходов.ДокументИсточник
	|		И Реализация.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Розница
	|		ПО Розница.Ссылка = ПартииРасходов.ДокументИсточник
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
	|		ПО Потребление.Ссылка = ПартииРасходов.ДокументИсточник
	|ГДЕ
	|	ПартииРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииРасходов.Активность
	|	И ПартииРасходов.Организация В (&МассивОрганизаций)
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.КорректировкаПоступления И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	//++ НЕ УТ
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.ОтчетПереработчика И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.ВыпускПродукции И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	//-- НЕ УТ
	//++ НЕ УТКА
	|	И Не (ПартииРасходов.Регистратор ССЫЛКА Документ.ОтчетДавальцу И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	//-- НЕ УТКА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииРасходов.Организация,
	|	(ВЫБОР
	|		КОГДА Возврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL ИЛИ НЕ Корректировка.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСТЬNULL(Реализация.Дата, ЕСТЬNULL(Розница.Дата, ДАТАВРЕМЯ(1,1,1))), ДЕНЬ)
	|		КОГДА НЕ Потребление.Ссылка ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(Потребление.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ),
	|	ПартииРасходов.Регистратор,
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ПартииРасходов.АналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Не Партии.Ссылка ЕСТЬ NULL
	|			И ПартииРасходов.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|			И (НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)
	|				ИЛИ НАЧАЛОПЕРИОДА(Партии.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(Розница.Дата, МЕСЯЦ)
	|				ИЛИ &ДляСтоимостиПродаж)
	|		ТОГДА Партии.КорВидЗапасов
	|		ИНАЧЕ ПартииРасходов.ВидЗапасов
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	|		КОГДА ПартииРасходов.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		 И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииРасходов.КорАналитикаУчетаНоменклатуры
	//++ НЕ УТКА
	|		КОГДА ПартииРасходов.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА ПартииРасходов.АналитикаУчетаНоменклатуры
	//-- НЕ УТКА
	//++ НЕ УТ
	|		КОГДА ПартииРасходов.Регистратор ССЫЛКА Документ.ВыпускПродукции ТОГДА ПартииРасходов.АналитикаУчетаНоменклатуры
	//-- НЕ УТ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ),
	|	ПартииРасходов.Период,
	|	ПартииРасходов.СтатьяСписанияНДС,
	|	ПартииРасходов.АналитикаСписанияНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Партии.Организация,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ КАК ТипЗапасов,
	|	Партии.Регистратор,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаПродукции
	|		КОГДА АналитикаПродукцииБезНазначения.КлючАналитики ЕСТЬ NULL ТОГДА Партии.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	(ВЫБОР
	|		КОГДА &ДляСтоимостиПродаж ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		ИНАЧЕ Партии.ПериодПродажи КОНЕЦ) КАК ПериодПродажи,
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Партии.Количество < 0 ТОГДА 0 - Партии.Количество
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|	СУММА(Партии.Стоимость) КАК Стоимость,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СуммаДопРасходов) КАК СуммаДопРасходов,
	|	СУММА(Партии.СуммаДопРасходовБезНДС) КАК СуммаДопРасходовБезНДС,
	|	СУММА(Партии.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСРегл) КАК НДСРегл,
	|	СУММА(Партии.СписаниеНДС) КАК СписаниеНДС,
	|	СУММА(Партии.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Партии.ВременнаяРазница) КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ВидЗапасов КАК ВидЗапасов,
	|		Таблица.Регистратор КАК Регистратор,
	|		Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Таблица.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|		Таблица.ПериодПродажи КАК ПериодПродажи,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Стоимость КАК Стоимость,
	|		Таблица.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК СуммаДопРасходов,
	|		0 КАК СуммаДопРасходовБезНДС,
	|		Таблица.СтоимостьРегл КАК СтоимостьРегл,
	|		Таблица.НДСРегл КАК НДСРегл,
	|		Таблица.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница КАК ВременнаяРазница,
	|		Таблица.СписаниеНДС КАК СписаниеНДС,
	|		Таблица.Период,
	|		Таблица.СтатьяСписанияНДС,
	|		Таблица.АналитикаСписанияНДС
	|	ИЗ
	|		ТаблицаПартий КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПартииРасходов.Организация КАК Организация,
	|		ПартииРасходов.ВидЗапасов КАК ВидЗапасов,
	|		ПартииРасходов.Регистратор КАК Регистратор,
	|		ПартииРасходов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ПартииРасходов.АналитикаУчетаПродукции,
	|		ПартииРасходов.ПериодПродажи КАК ПериодПродажи,
	|		0 КАК Количество,
	|		0 КАК Стоимость,
	|		0 КАК СтоимостьБезНДС,
	|		ПартииРасходов.Стоимость КАК СуммаДопРасходов,
	|		ПартииРасходов.СтоимостьБезНДС КАК СуммаДопРасходовБезНДС,
	|		ПартииРасходов.СтоимостьРегл КАК СтоимостьРегл,
	|		ПартииРасходов.НДСРегл КАК НДСРегл,
	|		ПартииРасходов.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ПартииРасходов.ВременнаяРазница КАК ВременнаяРазница,
	|		ПартииРасходов.СписаниеНДС КАК СписаниеНДС,
	|		ПартииРасходов.Период,
	|		ПартииРасходов.СтатьяСписанияНДС,
	|		ПартииРасходов.АналитикаСписанияНДС
	|	ИЗ
	|		ПартииРасходов КАК ПартииРасходов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ВидЗапасов КАК ВидЗапасов,
	|		Таблица.Регистратор КАК Регистратор,
	|		Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Таблица.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		Таблица.ПериодПродажи КАК ПериодПродажи,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Стоимость КАК Стоимость,
	|		Таблица.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК СуммаДопРасходов,
	|		0 КАК СуммаДопРасходовБезНДС,
	|		Таблица.СтоимостьРегл КАК СтоимостьРегл,
	|		Таблица.НДСРегл КАК НДСРегл,
	|		Таблица.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница КАК ВременнаяРазница,
	|		Таблица.СписаниеНДС КАК СписаниеНДС,
	|		Таблица.Период,
	|		Таблица.СтатьяСписанияНДС,
	|		Таблица.АналитикаСписанияНДС
	|	ИЗ
	|		СборкиТоваров КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ПартииНаКомиссии.Организация,
	|		ПартииНаКомиссии.ВидЗапасов,
	|		ПартииНаКомиссии.Регистратор,
	|		ПартииНаКомиссии.АналитикаУчетаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|		ДАТАВРЕМЯ(1,1,1) КАК ПериодПродажи,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.Количество
	|			ИНАЧЕ ПартииНаКомиссии.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.Стоимость
	|			ИНАЧЕ ПартииНаКомиссии.Стоимость
	|		КОНЕЦ КАК Стоимость,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.СтоимостьБезНДС
	|			ИНАЧЕ ПартииНаКомиссии.СтоимостьБезНДС
	|		КОНЕЦ КАК СтоимостьБезНДС,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|				ТОГДА
	|					ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|						0 - (ПартииНаКомиссии.СтоимостьРегл + ПартииНаКомиссии.НДСРегл)
	|					ИНАЧЕ
	|						ПартииНаКомиссии.СтоимостьРегл + ПартииНаКомиссии.НДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ
	|				ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|					0 - ПартииНаКомиссии.СтоимостьРегл
	|				ИНАЧЕ
	|					ПартииНаКомиссии.СтоимостьРегл
	|				КОНЕЦ
	|		КОНЕЦ КАК СтоимостьРегл,
	|		ВЫБОР КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию))
	|		 И ПартииНаКомиссии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|				0 - ПартииНаКомиссии.НДСРегл
	|			ИНАЧЕ
	|				ПартииНаКомиссии.НДСРегл
	|			КОНЕЦ
	|
	|		КОГДА ПартииНаКомиссии.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		 И ПартииНаКомиссии.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров))
	|		ТОГДА
	|			ВЫБОР КОГДА ПартииНаКомиссии.Количество < 0 ТОГДА
	|				ПартииНаКомиссии.НДСРегл
	|			ИНАЧЕ
	|				- ПартииНаКомиссии.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК НДСРегл,
	|
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.ПостояннаяРазница
	|			ИНАЧЕ ПартииНаКомиссии.ПостояннаяРазница
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР
	|			КОГДА ПартииНаКомиссии.Количество < 0 
	|				ТОГДА 0 - ПартииНаКомиссии.ВременнаяРазница
	|			ИНАЧЕ ПартииНаКомиссии.ВременнаяРазница
	|		КОНЕЦ КАК ВременнаяРазница,
	|		0 КАК СписаниеНДС,
	|		ПартииНаКомиссии.Период,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК ПартииНаКомиссии
	|	ГДЕ
	|		ПартииНаКомиссии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ПартииНаКомиссии.Активность
	|		И ПартииНаКомиссии.Организация В(&МассивОрганизаций)
	|		И ПартииНаКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ ПартииНаКомиссии.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Затраты.Организация,
	|		Затраты.ВидЗапасов,
	|		Затраты.Регистратор,
	|		Затраты.АналитикаУчетаНоменклатуры,
	|		ВЫБОР
	|			КОГДА Затраты.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	//++ НЕ УТ
	|			КОГДА (Затраты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|			 		И Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			 		И Затраты.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			 		И Затраты.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|				ТОГДА Затраты.АналитикаУчетаНоменклатуры
	//-- НЕ УТ
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КОНЕЦ КАК АналитикаУчетаПродукции,
	|		ЕСТЬNULL(НАЧАЛОПЕРИОДА(Корректировка.ДокументОснование.Дата, ДЕНЬ), ДАТАВРЕМЯ(1,1,1)) КАК ПериодПродажи,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.Количество
	|		ИНАЧЕ
	|			Затраты.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.Стоимость
	|		ИНАЧЕ
	|			Затраты.Стоимость
	|		КОНЕЦ КАК Стоимость,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.СтоимостьБезНДС
	|		ИНАЧЕ
	|			Затраты.СтоимостьБезНДС
	|		КОНЕЦ КАК СтоимостьБезНДС,
	|		0 КАК СуммаДопРасходов,
	|		0 КАК СуммаДопРасходовБезНДС,
	|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|				0 - (Затраты.СтоимостьРегл + Затраты.НДСРегл )
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл + Затраты.НДСРегл
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|				0 - Затраты.СтоимостьРегл
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл
	|			КОНЕЦ
	|		КОНЕЦ КАК СтоимостьРегл,
	|		0 КАК НДСРегл,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.ПостояннаяРазница
	|		ИНАЧЕ
	|			Затраты.ПостояннаяРазница
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА
	|			0 - Затраты.ВременнаяРазница
	|		ИНАЧЕ
	|			Затраты.ВременнаяРазница
	|		КОНЕЦ КАК ВременнаяРазница,
	|		ВЫБОР КОГДА Затраты.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВЫБОР КОГДА Затраты.Количество < 0 ТОГДА -Затраты.НДСРегл ИНАЧЕ Затраты.НДСРегл КОНЕЦ
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СписаниеНДС,
	|		Затраты.Период,
	|		Затраты.СтатьяСписанияНДС,
	|		Затраты.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Корректировка
	|			ПО Корректировка.Ссылка = Затраты.Регистратор
	|	ГДЕ
	|		Затраты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Затраты.Активность
	|		И Затраты.Организация В(&МассивОрганизаций)
	|		И (Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПрочееОприходованиеТоваров
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПередачаТоваровМеждуОрганизациями
	//++ НЕ УТ
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ВозвратМатериаловИзПроизводства
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПеремещениеМатериаловВПроизводстве
	//-- НЕ УТ
	|			)
	//++ НЕ УТ
	|		И Не (Затраты.Регистратор ССЫЛКА Документ.ВозвратМатериаловИзПроизводства
	|			И Затраты.ДокументПоступления = НЕОПРЕДЕЛЕНО)
	|		И Не Затраты.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|		И Не (Затраты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|			И Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|		И Не (Затраты.Регистратор ССЫЛКА Документ.РаспределениеПроизводственныхЗатрат 
	|				И Затраты.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Затраты.Организация,
	|		ВЫБОР КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			Затраты.КорВидЗапасов
	|		ИНАЧЕ
	|			Затраты.ВидЗапасов
	|		КОНЕЦ КАК ВидЗапасов,
	|		Затраты.Регистратор,
	|		ВЫБОР КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			Затраты.АналитикаУчетаПродукции
	|		ИНАЧЕ
	|			Затраты.АналитикаУчетаНоменклатуры
	|		КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|		(ВЫБОР
	|			КОГДА Затраты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	|			 И Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			 И СтатьиРасходов.Ссылка ЕСТЬ НЕ NULL
	|				ТОГДА Затраты.АналитикаУчетаПродукции
	|			КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|				Затраты.КорАналитикаУчетаПродукции
	|			ИНАЧЕ Затраты.АналитикаУчетаПродукции КОНЕЦ) КАК АналитикаУчетаПродукции,
	|		ДАТАВРЕМЯ(1,1,1) КАК ПериодПродажи,
	|		(ВЫБОР
	|			КОГДА Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 0
	|			КОГДА Затраты.Количество < 0 ТОГДА 0 - Затраты.Количество
	|			ИНАЧЕ Затраты.Количество КОНЕЦ) КАК Количество,
	|		Затраты.Стоимость КАК Стоимость,
	|		Затраты.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК СуммаДопРасходов,
	|		0 КАК СуммаДопРасходовБезНДС,
	|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА
	|			Затраты.СтоимостьРегл + Затраты.НДСРегл
	|		ИНАЧЕ
	|			Затраты.СтоимостьРегл
	|		КОНЕЦ КАК СтоимостьРегл,
	|		ВЫБОР КОГДА Затраты.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Затраты.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|				ИЛИ Затраты.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг) ТОГДА
	|			0
	|		КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС <> Затраты.НалогообложениеНДС
	|			И Затраты.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ТОГДА
	|			Затраты.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК НДСРегл,
	|		Затраты.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Затраты.ВременнаяРазница КАК ВременнаяРазница,
	|		ВЫБОР КОГДА Затраты.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Затраты.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК СписаниеНДС,
	|		Затраты.Период,
	|		Затраты.СтатьяСписанияНДС,
	|		Затраты.АналитикаСписанияНДС
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Затраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО Затраты.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		Затраты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Затраты.Активность
	|		И Затраты.Организация В(&МассивОрганизаций)
	|		И ЕСТЬNULL(Затраты.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		И ЕСТЬNULL(Затраты.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|		И ЕСТЬNULL(Затраты.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|		И Затраты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И (Затраты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//++ НЕ УТКА
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	//-- НЕ УТКА
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Затраты.Организация,
	|		Затраты.ВидЗапасов,
	|		Затраты.Регистратор,
	|		Затраты.АналитикаУчетаНоменклатуры,
	|		Затраты.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		ДАТАВРЕМЯ(1,1,1) КАК ПериодПродажи,
	|		Затраты.Количество КАК Количество,
	|		Затраты.Стоимость КАК Стоимость,
	|		Затраты.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		0 КАК СуммаДопРасходов,
	|		0 КАК СуммаДопРасходовБезНДС,
	|		ВЫБОР КОГДА Затраты.АналитикаУчетаПартий.НалогообложениеНДС В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА
	|				Затраты.СтоимостьРегл + Затраты.НДСРегл
	|			ИНАЧЕ
	|				Затраты.СтоимостьРегл
	|		КОНЕЦ КАК СтоимостьРегл,
	|		0 КАК НДСРегл,
	|		Затраты.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Затраты.ВременнаяРазница КАК ВременнаяРазница,
	|		0 КАК СписаниеНДС,
	|		Затраты.Период,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПартииНезавершенногоПроизводства КАК Затраты
	|	ГДЕ
	|		НЕ Затраты.СлужебноеВидДвиженияПриход
	|		И ЕСТЬNULL(Затраты.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		И ЕСТЬNULL(Затраты.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|		И Затраты.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И (Затраты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//++ НЕ УТКА
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	//-- НЕ УТКА
	|			ИЛИ Затраты.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Выпуск.Организация,
	|		Выпуск.ВидЗапасов,
	|		Выпуск.Регистратор,
	|		(ВЫБОР
	|			КОГДА Выпуск.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			 И Выпуск.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Выпуск.АналитикаУчетаПродукции
	|			ИНАЧЕ Выпуск.АналитикаУчетаНоменклатуры КОНЕЦ) КАК АналитикаУчетаНоменклатуры,
	//++ НЕ УТКА
	|		(ВЫБОР 
	|			КОГДА Выпуск.Регистратор ССЫЛКА Документ.ОтчетДавальцу ТОГДА Выпуск.АналитикаУчетаНоменклатуры
	|			ИНАЧЕ
	//-- НЕ УТКА
	|			ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	//++ НЕ УТКА
	|			КОНЕЦ)
	//-- НЕ УТКА
	|				КАК АналитикаУчетаПродукции,
	|		ДАТАВРЕМЯ(1,1,1) КАК ПериодПродажи,
	|		Выпуск.Количество,
	|		0 КАК Стоимость,
	|		0 КАК СтоимостьБезНДС,
	|		0 КАК СуммаДопРасходов,
	|		0 КАК СуммаДопРасходовБезНДС,
	|		0 КАК СтоимостьРегл,
	|		0 КАК НДСРегл,
	|		0 КАК ПостояннаяРазница,
	|		0 КАК ВременнаяРазница,
	|		0 КАК СписаниеНДС,
	|		Выпуск.Период,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка),
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.ВыпускПродукции КАК Выпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускВПодразделение
	|			ПО ВыпускВПодразделение.Ссылка = Выпуск.Регистратор
	|			И ВыпускВПодразделение.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)
	|	ГДЕ
	|		Выпуск.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Выпуск.Активность
	|		И Выпуск.Организация В(&МассивОрганизаций)
	|		И (
	//++ НЕ УТКА
	|			Выпуск.Регистратор ССЫЛКА Документ.ОтчетДавальцу ИЛИ
	//-- НЕ УТКА
	|			НЕ ВыпускВПодразделение.Ссылка ЕСТЬ NULL)
	//-- НЕ УТ
	|
	|	) КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Партии.АналитикаУчетаНоменклатуры
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО АналитикаБезНазначения.Номенклатура = Аналитика.Номенклатура
	|		И АналитикаБезНазначения.Характеристика = Аналитика.Характеристика
	|		И АналитикаБезНазначения.Серия = Аналитика.Серия
	|		И АналитикаБезНазначения.Склад = Аналитика.Склад
	|		И АналитикаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	//++ НЕ УТ
	|		И АналитикаБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	//-- НЕ УТ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО АналитикаПродукции.Ссылка = Партии.АналитикаУчетаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|		ПО АналитикаПродукцииБезНазначения.Номенклатура = АналитикаПродукции.Номенклатура
	|		И АналитикаПродукцииБезНазначения.Характеристика = АналитикаПродукции.Характеристика
	|		И АналитикаПродукцииБезНазначения.Серия = АналитикаПродукции.Серия
	|		И АналитикаПродукцииБезНазначения.Склад = АналитикаПродукции.Склад
	|		И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	//++ НЕ УТ
	|		И АналитикаБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	//-- НЕ УТ
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Организация,
	|	ВЫБОР КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА
	|		Партии.ВидЗапасов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Партии.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(Партии.ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоВидамЗапасов ТОГДА Партии.АналитикаУчетаПродукции
	|		КОГДА АналитикаПродукцииБезНазначения.КлючАналитики ЕСТЬ NULL ТОГДА Партии.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА &ДляСтоимостиПродаж ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		ИНАЧЕ Партии.ПериодПродажи КОНЕЦ),
	|	Партии.Период,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС
	|";
	
	Запрос.Выполнить();
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ТаблицаПартий, ЗатратыНаВыпуск, СборкиТоваровВидыЗапасов,
		|СборкиТоваровПартии, СборкиТоваров, Возвраты, ПартииРасходов");
	
КонецПроцедуры


// Служебная, этап 2.1, 2.2, 3.1, 3.18
Процедура РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Знач КоличествоКРаспределению)
	
	Если КоличествоКРаспределению >= СтрокаОстатка.Количество Тогда
		
		КоличествоКРаспределению 	= КоличествоКРаспределению - СтрокаОстатка.Количество;
			
		КоличествоКСписанию 			= СтрокаОстатка.Количество;
		СтоимостьКСписанию				= СтрокаОстатка.Стоимость;
		СтоимостьБезНДСКСписанию		= СтрокаОстатка.СтоимостьБезНДС;
		СтоимостьЗабалансоваяКСписанию	= СтрокаОстатка.СтоимостьЗабалансовая;
		СтоимостьРеглКСписанию			= СтрокаОстатка.СтоимостьРегл;
		СтоимостьЗабалансоваяРеглКСписанию = СтрокаОстатка.СтоимостьЗабалансоваяРегл;
		НДСРеглКСписанию				= СтрокаОстатка.НДСРегл;
		СуммаДопРасходовКСписанию		= СтрокаОстатка.СуммаДопРасходов;
		СуммаДопРасходовБезНДСКСписанию	= СтрокаОстатка.СуммаДопРасходовБезНДС;
		ПостояннаяРазницаКСписанию		= СтрокаОстатка.ПостояннаяРазница;
		ВременнаяРазницаКСписанию		= СтрокаОстатка.ВременнаяРазница;
		
		//++ НЕ УТ
		Если НЕ (ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ВыпускПродукции")
		 И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход) Тогда
			СтрокаОстатка.Количество = 0;
		КонецЕсли;
		//-- НЕ УТ

	ИначеЕсли КоличествоКРаспределению < СтрокаОстатка.Количество Тогда
		
		СтоимостьКСписанию				= Окр((КоличествоКРаспределению * СтрокаОстатка.Стоимость / СтрокаОстатка.Количество),2);
		СтоимостьБезНДСКСписанию		= Окр((КоличествоКРаспределению * СтрокаОстатка.СтоимостьБезНДС / СтрокаОстатка.Количество),2);
		СтоимостьЗабалансоваяКСписанию	= Окр((КоличествоКРаспределению * СтрокаОстатка.СтоимостьЗабалансовая / СтрокаОстатка.Количество),2);
		СтоимостьРеглКСписанию			= Окр((КоличествоКРаспределению * СтрокаОстатка.СтоимостьРегл / СтрокаОстатка.Количество),2);
		СтоимостьЗабалансоваяРеглКСписанию = Окр((КоличествоКРаспределению * СтрокаОстатка.СтоимостьЗабалансоваяРегл / СтрокаОстатка.Количество),2);
		НДСРеглКСписанию				= Окр((КоличествоКРаспределению * СтрокаОстатка.НДСРегл / СтрокаОстатка.Количество),2);
		СуммаДопРасходовКСписанию		= Окр((КоличествоКРаспределению * СтрокаОстатка.СуммаДопРасходов / СтрокаОстатка.Количество),2);
		СуммаДопРасходовБезНДСКСписанию	= Окр((КоличествоКРаспределению * СтрокаОстатка.СуммаДопРасходовБезНДС / СтрокаОстатка.Количество),2);
		ПостояннаяРазницаКСписанию		= Окр((КоличествоКРаспределению * СтрокаОстатка.ПостояннаяРазница / СтрокаОстатка.Количество),2);
		ВременнаяРазницаКСписанию		= Окр((КоличествоКРаспределению * СтрокаОстатка.ВременнаяРазница / СтрокаОстатка.Количество),2);
			
		КоличествоКСписанию	 		    = КоличествоКРаспределению;
		КоличествоКРаспределению 	    = 0;
		
		СтрокаОстатка.Количество 			 = СтрокаОстатка.Количество - КоличествоКСписанию;
		СтрокаОстатка.Стоимость 			 = СтрокаОстатка.Стоимость - СтоимостьКСписанию;
		СтрокаОстатка.СтоимостьБезНДС 		 = СтрокаОстатка.СтоимостьБезНДС - СтоимостьБезНДСКСписанию;
		СтрокаОстатка.СтоимостьЗабалансовая  = СтрокаОстатка.СтоимостьЗабалансовая - СтоимостьЗабалансоваяКСписанию;
		СтрокаОстатка.СтоимостьРегл 		 = СтрокаОстатка.СтоимостьРегл - СтоимостьРеглКСписанию;
		СтрокаОстатка.СтоимостьЗабалансоваяРегл = СтрокаОстатка.СтоимостьЗабалансоваяРегл - СтоимостьЗабалансоваяРеглКСписанию;
		СтрокаОстатка.НДСРегл 				 = СтрокаОстатка.НДСРегл - НДСРеглКСписанию;
		СтрокаОстатка.СуммаДопРасходов 		 = СтрокаОстатка.СуммаДопРасходов - СуммаДопРасходовКСписанию;
		СтрокаОстатка.СуммаДопРасходовБезНДС = СтрокаОстатка.СуммаДопРасходовБезНДС - СуммаДопРасходовБезНДСКСписанию;
		СтрокаОстатка.ПостояннаяРазница 	 = СтрокаОстатка.ПостояннаяРазница - ПостояннаяРазницаКСписанию;
		СтрокаОстатка.ВременнаяРазница 		 = СтрокаОстатка.ВременнаяРазница - ВременнаяРазницаКСписанию;

	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
	Если Выборка.ИсходноеКоличество < 0 Тогда
		ЗаписьРаспределения.Количество				= 0 - КоличествоКСписанию;
		ЗаписьРаспределения.Стоимость				= 0 - СтоимостьКСписанию;
		ЗаписьРаспределения.СтоимостьБезНДС			= 0 - СтоимостьБезНДСКСписанию;
		ЗаписьРаспределения.СтоимостьЗабалансовая	= 0 - СтоимостьЗабалансоваяКСписанию;
		ЗаписьРаспределения.СтоимостьРегл			= 0 - СтоимостьРеглКСписанию;
		ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = 0 - СтоимостьЗабалансоваяРеглКСписанию;
		ЗаписьРаспределения.НДСРегл					= 0 - НДСРеглКСписанию;
		ЗаписьРаспределения.СуммаДопРасходов		= 0 - СуммаДопРасходовКСписанию;
		ЗаписьРаспределения.СуммаДопРасходовБезНДС	= 0 - СуммаДопРасходовБезНДСКСписанию;
		ЗаписьРаспределения.ПостояннаяРазница		= 0 - ПостояннаяРазницаКСписанию;
		ЗаписьРаспределения.ВременнаяРазница		= 0 - ВременнаяРазницаКСписанию;
	Иначе
		ЗаписьРаспределения.Количество				= КоличествоКСписанию;
		ЗаписьРаспределения.Стоимость				= СтоимостьКСписанию - Выборка.Стоимость;
		ЗаписьРаспределения.СтоимостьБезНДС			= СтоимостьБезНДСКСписанию;
		ЗаписьРаспределения.СтоимостьЗабалансовая	= СтоимостьЗабалансоваяКСписанию;
		ЗаписьРаспределения.СтоимостьРегл			= СтоимостьРеглКСписанию - Выборка.СтоимостьРегл;
		ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = СтоимостьЗабалансоваяРеглКСписанию;
		ЗаписьРаспределения.НДСРегл					= НДСРеглКСписанию;
		ЗаписьРаспределения.СуммаДопРасходов		= СуммаДопРасходовКСписанию;
		ЗаписьРаспределения.СуммаДопРасходовБезНДС	= СуммаДопРасходовБезНДСКСписанию;
		ЗаписьРаспределения.ПостояннаяРазница		= ПостояннаяРазницаКСписанию;
		ЗаписьРаспределения.ВременнаяРазница		= ВременнаяРазницаКСписанию;
	КонецЕсли;
					
КонецПроцедуры

// Служебная, этап 2.1, 3.1
Процедура ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения)
	
	ЗаписьРаспределения.Стоимость 				= ЗаписьРаспределения.Стоимость + СуммыРаспределения.Стоимость;
	ЗаписьРаспределения.СтоимостьБезНДС 		= ЗаписьРаспределения.СтоимостьБезНДС + СуммыРаспределения.СтоимостьБезНДС;
	ЗаписьРаспределения.СтоимостьЗабалансовая   = ЗаписьРаспределения.СтоимостьЗабалансовая + СуммыРаспределения.СтоимостьЗабалансовая;
	ЗаписьРаспределения.СтоимостьРегл 			= ЗаписьРаспределения.СтоимостьРегл + СуммыРаспределения.СтоимостьРегл;
	ЗаписьРаспределения.СтоимостьЗабалансоваяРегл = ЗаписьРаспределения.СтоимостьЗабалансоваяРегл + СуммыРаспределения.СтоимостьЗабалансоваяРегл;
	ЗаписьРаспределения.НДСРегл 				= ЗаписьРаспределения.НДСРегл + СуммыРаспределения.НДСРегл;
	ЗаписьРаспределения.СуммаДопРасходов 		= ЗаписьРаспределения.СуммаДопРасходов + СуммыРаспределения.СуммаДопРасходов;
	ЗаписьРаспределения.СуммаДопРасходовБезНДС 	= ЗаписьРаспределения.СуммаДопРасходовБезНДС + СуммыРаспределения.СуммаДопРасходовБезНДС;
	ЗаписьРаспределения.ПостояннаяРазница 		= ЗаписьРаспределения.ПостояннаяРазница + СуммыРаспределения.ПостояннаяРазница;
	ЗаписьРаспределения.ВременнаяРазница 		= ЗаписьРаспределения.ВременнаяРазница + СуммыРаспределения.ВременнаяРазница;
	
КонецПроцедуры

// Служебная, этап 3.2
// Формирует таблицу расходов, распределенных на себестоимость товаров
// по указанному в статьях расходов правилу распределения.
//
// Параметры:
//	Дата - Дата, на которую выполняется получение остатка расходов
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица распределения расходов на себестоимость
//
Функция ТаблицаРаспределенияРасходовНаСебестоимостьТоваров(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	0                               КАК НомерСтроки,
	|	ПрочиеРасходы.Организация       КАК Организация,
	|	ПрочиеРасходы.Подразделение     КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов    КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.СтатьяРасходов.ПравилоРаспределенияНаСебестоимость КАК ПравилоРаспределения,
	|	ПрочиеРасходы.Стоимость 		КАК Сумма,
	|	ПрочиеРасходы.СтоимостьБезНДС 	КАК СуммаБезНДС,
	|	ПрочиеРасходы.СтоимостьРегл +
	|	ВЫБОР КОГДА ПрочиеРасходы.АналитикаУчетаПартий.НалогообложениеНДС В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|		ТОГДА ПрочиеРасходы.НДСРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ 							КАК СуммаРегл,
	|	ПрочиеРасходы.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ПрочиеРасходы.ВременнаяРазница 	КАК ВременнаяРазница
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПартииПрочихРасходов КАК ПрочиеРасходы
	|ГДЕ
	|	(ПрочиеРасходы.Стоимость > 0 ИЛИ ПрочиеРасходы.СтоимостьБезНДС > 0)
	|	И ПрочиеРасходы.СтатьяРасходов.ПравилоРаспределенияНаСебестоимость <> ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьТоваров.ПустаяСсылка)
	|	И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходов = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|";
	
	ТаблицаРасходов = Запрос.Выполнить().Выгрузить();
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаРасходов Цикл
		СтрокаТаблицы.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаРасходов", ТаблицаРасходов);
	
	Запрос.Текст = ""
		+ ТекстЗапросаВтТаблицаРасходовПоОстаткам()
		+ ТекстЗапросаТаблицаСпособовРаспределения()
		+ ТекстЗапросаТаблицаДокументов()
		+ ТекстЗапросаТаблицаПоступленияТоваров()
		+ ТекстЗапросаТаблицаБазыРаспределения()
		+ ТекстЗапросаТаблицаРасходов();
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// МассивРезультатов[0] - временная таблица "ВтТаблицаРасходов"
	// МассивРезультатов[1] - временная таблица "ТаблицаСпособовРаспределения"
	// МассивРезультатов[2] - временная таблица "ТаблицаДокументов"
	// МассивРезультатов[3] - временная таблица "ВтПоступленияТоваров"
	// МассивРезультатов[4] - временная таблица "ТаблицаПоступленияТоваров"
	РезультатЗапросаПоБазе = МассивРезультатов[5];
	ТаблицаРасходов = МассивРезультатов[6].Выгрузить();
	
	// Сформируем таблицу распределения расходов.
	ТаблицаРаспределенияРасходов = Новый ТаблицаЗначений;
	Колонки = ТаблицаРаспределенияРасходов.Колонки;
	Колонки.Добавить("Организация",                Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Колонки.Добавить("Подразделение",              Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Колонки.Добавить("СтатьяРасходовСписания",     Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	Колонки.Добавить("АналитикаРасходов");
	Колонки.Добавить("АналитикаУчетаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	Колонки.Добавить("ВидЗапасов",                 Новый ОписаниеТипов("СправочникСсылка.ВидыЗапасов"));
	
	Колонки.Добавить("СуммаДопРасходов",           ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15,2));
	Колонки.Добавить("СуммаДопРасходовБезНДС",     ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15,2));
	Колонки.Добавить("ДопРасходыРегл",             ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15,2));
	Колонки.Добавить("ПостояннаяРазница",          ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15,2));
	Колонки.Добавить("ВременнаяРазница",           ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15,2));
	
	
	СтруктураОтбора = Новый Структура("ИндексБазы");

	// Выборка строк базы распределения по индексу аналитики.
	ВыборкаПоИндексу = РезультатЗапросаПоБазе.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоИндексу.Следующий() Цикл
		
		Если ВыборкаПоИндексу.База = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора.ИндексБазы = ВыборкаПоИндексу.ИндексБазы;

		// Получаем массив расходов, имеющих одинаковый индекс аналитики, соответствующий текущей выборки базы распределения.
		// Данные затраты будут распределены по одинаковой базе распределения.
		МассивРасходов = ТаблицаРасходов.НайтиСтроки(СтруктураОтбора);
		Если МассивРасходов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаПоИндексу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Для Каждого СтрокаРасходов Из МассивРасходов Цикл
		
			СуммаКРаспределению				= СтрокаРасходов.Сумма;
			СуммаБезНДСКРаспределению		= СтрокаРасходов.СуммаБезНДС;
			СуммаРеглКРаспределению			= СтрокаРасходов.СуммаРегл;
			ПостояннаяРазницаКРаспределению	= СтрокаРасходов.ПостояннаяРазница;
			ВременнаяРазницаКРаспределению	= СтрокаРасходов.ВременнаяРазница;
			БазаВсего						= ВыборкаПоИндексу.База;
		
			// Выборка строк базы распределения по индексу базы распределения
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл

				Если БазаВсего <> 0 Тогда
					Стоимость			= Окр(СуммаКРаспределению * Выборка.База / БазаВсего, 2, 1); 
					СтоимостьБезНДС		= Окр(СуммаБезНДСКРаспределению * Выборка.База / БазаВсего, 2, 1);
					СтоимостьРегл		= Окр(СуммаРеглКРаспределению * Выборка.База / БазаВсего, 2, 1);
					ПостояннаяРазница	= Окр(ПостояннаяРазницаКРаспределению * Выборка.База / БазаВсего, 2, 1);
					ВременнаяРазница	= Окр(ВременнаяРазницаКРаспределению * Выборка.База / БазаВсего, 2, 1);
				Иначе
					Стоимость			= 0;
					СтоимостьБезНДС		= 0;
					СтоимостьРегл		= 0;
					ПостояннаяРазница	= 0;
					ВременнаяРазница	= 0;
				КонецЕсли;

				СуммаКРаспределению = СуммаКРаспределению - Стоимость;
				СуммаБезНДСКРаспределению = СуммаБезНДСКРаспределению - СтоимостьБезНДС;
				СуммаРеглКРаспределению = СуммаРеглКРаспределению - СтоимостьРегл;
				ПостояннаяРазницаКРаспределению = ПостояннаяРазницаКРаспределению - ПостояннаяРазница;
				ВременнаяРазницаКРаспределению = ВременнаяРазницаКРаспределению - ВременнаяРазница;
				БазаВсего = БазаВсего - Выборка.База;

				НоваяСтрока = ТаблицаРаспределенияРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасходов);
				НоваяСтрока.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры;
				НоваяСтрока.ВидЗапасов                 = Выборка.ВидЗапасов;
				НоваяСтрока.Организация                = Выборка.Организация;
				НоваяСтрока.СуммаДопРасходов           = Стоимость;
				НоваяСтрока.СуммаДопРасходовБезНДС     = СтоимостьБезНДС;
				НоваяСтрока.ДопРасходыРегл             = СтоимостьРегл;
				НоваяСтрока.ПостояннаяРазница          = ПостояннаяРазница;
				НоваяСтрока.ВременнаяРазница           = ВременнаяРазница;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтТаблицаРасходов, ТаблицаСпособовРаспределения,
		|ТаблицаДокументов, ВтПоступленияТоваров, ТаблицаПоступленияТоваров");
	
	Возврат ТаблицаРаспределенияРасходов;
	
КонецФункции

#КонецОбласти

#Область ПодготовкаИРешениеСЛУ

// Служебная, этап 3.6
// Функция выполняет корректировку стоимости и количества внешних приходов в узлах при расчете стоимости по ФИФО (Скользящая оценка).
//
// Параметры:
// Запрос - запрос по формированию узлов корректировки.
//
// Возвращаемое значение
// Таблица значений - узлы корректировки стоимости.
//
Процедура ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета, Запрос)

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|			Организация В (&МассивОрганизаций)
	|				И (АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов) В
	|					(ВЫБРАТЬ
	|						Таблица.АналитикаУчетаНоменклатуры,
	|						Таблица.РазделУчета,
	|						Таблица.ВидЗапасов
	|					ИЗ
	|						ВтАналитикаНоменклатуры КАК Таблица)) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	Себестоимость.Количество 			 КАК КоличествоОстаток,
	|	Себестоимость.СуммаДопРасходов 		 КАК СуммаДопРасходовОстаток,
	|	Себестоимость.СуммаДопРасходовБезНДС КАК СуммаДопРасходовБезНДСОстаток,
	|	Себестоимость.Трудозатраты 			 КАК ТрудозатратыОстаток,
	|	Себестоимость.ПостатейныеСНДС 		 КАК ПостатейныеСНДСОстаток,
	|	Себестоимость.ПостатейныеБезНДС 	 КАК ПостатейныеБезНДСОстаток
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|		И Себестоимость.РазделУчета = Таблица.РазделУчета
	|		И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|			И Себестоимость.РазделУчета = Таблица.РазделУчета
	|			И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|	КонечныеОстатки.Партия,
	|	КонечныеОстатки.АналитикаУчетаПартий,
	|	КонечныеОстатки.АналитикаФинансовогоУчета,
	|	КонечныеОстатки.ВидДеятельностиНДС,
	|
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьОстаток,
	|	0 КАК СтоимостьБезНДСОстаток,
	|	0 КАК СтоимостьЗабалансоваяОстаток,
	|	0 КАК ПостояннаяРазницаОстаток,
	|	0 КАК ВременнаяРазницаОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.СуммаДопРасходовОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.СуммаДопРасходовБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыБезНДСОстаток,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеСНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеСНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеБезНДСОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = НачальныеОстатки.ВидЗапасов
	|		И КонечныеОстатки.Партия = НачальныеОстатки.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий = НачальныеОстатки.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета = НачальныеОстатки.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС = НачальныеОстатки.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = Приходы.ВидЗапасов
	|		И КонечныеОстатки.Партия = Приходы.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий = Приходы.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета = Приходы.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС = Приходы.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	Запрос.Выполнить();

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	СебестоимостьТоваров.Партия 							   КАК Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий 				   КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета 			   КАК АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС 				   КАК ВидДеятельностиНДС,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|				И СебестоимостьТоваров.РазделУчета 				 = ТаблицаОстатков.РазделУчета
	|				И СебестоимостьТоваров.ВидЗапасов  				 = ТаблицаОстатков.ВидЗапасов
	|				И СебестоимостьТоваров.Организация 				 = ТаблицаОстатков.Организация
	|				И СебестоимостьТоваров.Партия 					 = ТаблицаОстатков.Партия
	|				И СебестоимостьТоваров.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|				И СебестоимостьТоваров.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|				И СебестоимостьТоваров.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|				И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И СебестоимостьТоваров.Стоимость <> 0
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Период                                КАК Период,
	|	Себестоимость.Организация                           КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                           КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                            КАК ВидЗапасов,
	|	Себестоимость.Партия 							    КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий 				    КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета 			КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС 				    КАК ВидДеятельностиНДС,
	|	СУММА(Себестоимость.Количество)        				КАК Количество,
	|	СУММА(Себестоимость.Стоимость)         				КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)   				КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)   		КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.ПостояннаяРазница) 				КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)  				КАК ВременнаяРазница
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПериодыПартий.Период                                КАК Период,
	|		ПериодыПартий.Организация                           КАК Организация,
	|		ПериодыПартий.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|		ПериодыПартий.РазделУчета                           КАК РазделУчета,
	|		ПериодыПартий.ВидЗапасов                            КАК ВидЗапасов,
	|		ПериодыПартий.Партия 							    КАК Партия,
	|		ПериодыПартий.АналитикаУчетаПартий 				    КАК АналитикаУчетаПартий,
	|		ПериодыПартий.АналитикаФинансовогоУчета 			КАК АналитикаФинансовогоУчета,
	|		ПериодыПартий.ВидДеятельностиНДС 				    КАК ВидДеятельностиНДС,
	|		ЕСТЬNULL(Себестоимость.Количество, 0)        		КАК Количество,
	|		ЕСТЬNULL(Себестоимость.Стоимость, 0)         		КАК Стоимость,
	|		ЕСТЬNULL(Себестоимость.СтоимостьБезНДС, 0)   		КАК СтоимостьБезНДС,
	|		ЕСТЬNULL(Себестоимость.СтоимостьЗабалансовая, 0)   	КАК СтоимостьЗабалансовая,
	|		ЕСТЬNULL(Себестоимость.ПостояннаяРазница, 0) 		КАК ПостояннаяРазница,
	|		ЕСТЬNULL(Себестоимость.ВременнаяРазница, 0)  		КАК ВременнаяРазница
	|	ИЗ
	|		ТаблицаПериодыПартий КАК ПериодыПартий
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|			ПО ПериодыПартий.АналитикаУчетаНоменклатуры   = Себестоимость.АналитикаУчетаНоменклатуры
	|				И ПериодыПартий.РазделУчета               = Себестоимость.РазделУчета
	|				И ПериодыПартий.ВидЗапасов                = Себестоимость.ВидЗапасов
	|				И ПериодыПартий.Организация               = Себестоимость.Организация
	|				И ПериодыПартий.Партия 					  = Себестоимость.Партия
	|				И ПериодыПартий.АналитикаУчетаПартий 	  = Себестоимость.АналитикаУчетаПартий
	|				И ПериодыПартий.АналитикаФинансовогоУчета = Себестоимость.АналитикаФинансовогоУчета
	|				И ПериодыПартий.ВидДеятельностиНДС 		  = Себестоимость.ВидДеятельностиНДС
	|				И Себестоимость.СлужебноеВидДвиженияПриход
	|				И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|				И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|	) КАК Себестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	ТаблицаОстатков.Партия,
	|	ТаблицаОстатков.АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаОстатков.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьОстаток,
	|
	|	ТаблицаОстатков.СтоимостьБезНДСОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьБезНДСОстаток,
	|
	|	ТаблицаОстатков.СтоимостьЗабалансоваяОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьЗабалансоваяОстаток,
	|
	|	ТаблицаОстатков.ПостояннаяРазницаОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.ПостояннаяРазница, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.ПостояннаяРазница, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяПостояннаяРазницаОстаток,
	|
	|	ТаблицаОстатков.ВременнаяРазницаОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.ВременнаяРазница, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.ВременнаяРазница, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяВременнаяРазницаОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток 		 КАК НоваяСтоимостьДопРасходыОстаток,
	|	ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток КАК НоваяСтоимостьДопРасходыБезНДСОстаток,
	|	ТаблицаОстатков.ТрудозатратыОстаток 			 КАК НоваяТрудозатратыОстаток,
	|	ТаблицаОстатков.ПостатейныеСНДСОстаток 			 КАК НоваяПостатейныеСНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеБезНДСОстаток 		 КАК НоваяПостатейныеБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.Партия 					= ТаблицаВнешнихПоступлений.Партия
	|			И ТаблицаОстатков.АналитикаУчетаПартий 	  	= ТаблицаВнешнихПоступлений.АналитикаУчетаПартий
	|			И ТаблицаОстатков.АналитикаФинансовогоУчета = ТаблицаВнешнихПоступлений.АналитикаФинансовогоУчета
	|			И ТаблицаОстатков.ВидДеятельностиНДС 		= ТаблицаВнешнихПоступлений.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|	ТаблицаНовыхОстатков.Партия,
	|	ТаблицаНовыхОстатков.АналитикаУчетаПартий,
	|	ТаблицаНовыхОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаНовыхОстатков.ВидДеятельностиНДС,
	|
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьОстаток КАК СтоимостьОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьБезНДСОстаток КАК СтоимостьБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяОстаток КАК СтоимостьЗабалансоваяОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостояннаяРазницаОстаток КАК ПостояннаяРазницаОстаток,
	|	ТаблицаНовыхОстатков.НоваяВременнаяРазницаОстаток КАК ВременнаяРазницаОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток КАК СтоимостьДопРасходыОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыБезНДСОстаток КАК СтоимостьДопРасходыБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыОстаток КАК ТрудозатратыОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеСНДСОстаток КАК ПостатейныеСНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеБезНДСОстаток КАК ПостатейныеБезНДСОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока НЕ Запрос.Выполнить().Пустой() Цикл 
		// Максимальное количество выполнений запроса = максимальному количеству поступлений товара на склад.
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.Партия 					КАК Партия,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаПартий 		КАК АналитикаУчетаПартий,
	|	ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета 	КАК АналитикаФинансовогоУчета,
	|	ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		КАК ВидДеятельностиНДС,
	|
	|	ТаблицаУзлыКорректировки.Количество
	|		 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК Стоимость,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьБезНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьБезНДС,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьЗабалансовая
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостояннаяРазница
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостояннаяРазницаОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК ПостояннаяРазница,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазницаЗнак,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ВременнаяРазница
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ВременнаяРазницаОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК ВременнаяРазница,
	|	ТаблицаУзлыКорректировки.ВременнаяРазницаЗнак,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьДопРасходы
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК СтоимостьДопРасходы,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.СтоимостьБезНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьДопРасходыБезНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК СтоимостьДопРасходыБезНДС,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.Трудозатраты
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК Трудозатраты,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеСНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеСНДСОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеСНДС,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.СтоимостьБезНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеБезНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеБезНДСОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеБезНДС
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета               = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов                = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация               = ТаблицаОстатков.Организация
	|			И ТаблицаУзлыКорректировки.Партия 					 = ТаблицаОстатков.Партия
	|			И ТаблицаУзлыКорректировки.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|			И ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Служебная, этап 3.10
Процедура ПодготовитьДанныеДляРасчетаСтоимостиРеглПоФИФО(ПараметрыРасчета, Запрос)

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|		Организация В (&МассивОрганизаций)
	|		И (АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов) В (
	|			ВЫБРАТЬ
	|				Таблица.АналитикаУчетаНоменклатуры,
	|				Таблица.РазделУчета,
	|				Таблица.ВидЗапасов
	|			ИЗ ВтАналитикаНоменклатуры КАК Таблица)
	|	) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.Количество КАК КоличествоОстаток,
	|	Себестоимость.ДопРасходыРегл КАК ДопРасходыРеглОстаток,
	|	Себестоимость.ТрудозатратыРегл КАК ТрудозатратыРеглОстаток,
	|	Себестоимость.ПостатейныеРегл  КАК ПостатейныеРеглОстаток
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|		И Себестоимость.РазделУчета = Таблица.РазделУчета
	|		И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход,
	|	СУММА(ВЫБОР
	|		КОГДА Себестоимость.Количество = 0
	|		 И НЕ Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|		 И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
	|			ВЫБОР
	|				КОГДА &ПартионныйУчетВерсии22 ТОГДА Себестоимость.ДопРасходыРегл
	|				ИНАЧЕ Себестоимость.СтоимостьРегл КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьДопРасходы
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитикаНоменклатуры КАК Таблица
	|		ПО Себестоимость.АналитикаУчетаНоменклатуры = Таблица.АналитикаУчетаНоменклатуры
	|			И Себестоимость.РазделУчета = Таблица.РазделУчета
	|			И Себестоимость.ВидЗапасов = Таблица.ВидЗапасов
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|	КонечныеОстатки.Партия,
	|	КонечныеОстатки.АналитикаУчетаПартий,
	|	КонечныеОстатки.АналитикаФинансовогоУчета,
	|	КонечныеОстатки.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьРеглОстаток,
	|	0 КАК СтоимостьЗабалансоваяРеглОстаток,
	|	(ВЫБОР
	|		КОГДА &ПартионныйУчетВерсии22 
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		КОГДА ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * ЕСТЬNULL(Приходы.СтоимостьДопРасходы, 0) /
	|					(ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеРеглОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация 				 = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета 				 = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов 				 = НачальныеОстатки.ВидЗапасов
	|		И КонечныеОстатки.Партия 					 = НачальныеОстатки.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий 		 = НачальныеОстатки.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета  = НачальныеОстатки.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС 		 = НачальныеОстатки.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация 				 = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета 				 = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов 				 = Приходы.ВидЗапасов
	|		И КонечныеОстатки.Партия 					 = Приходы.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий 		 = Приходы.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета  = Приходы.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС 		 = Приходы.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	Запрос.Выполнить();

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	СебестоимостьТоваров.Партия                          	   КАК Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий                  КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета             КАК АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС                    КАК ВидДеятельностиНДС,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры 		= ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И СебестоимостьТоваров.РазделУчета 					= ТаблицаОстатков.РазделУчета
	|			И СебестоимостьТоваров.ВидЗапасов  					= ТаблицаОстатков.ВидЗапасов
	|			И СебестоимостьТоваров.Организация 					= ТаблицаОстатков.Организация
	|			И СебестоимостьТоваров.Партия 						= ТаблицаОстатков.Партия
	|			И СебестоимостьТоваров.АналитикаУчетаПартий 		= ТаблицаОстатков.АналитикаУчетаПартий
	|			И СебестоимостьТоваров.АналитикаФинансовогоУчета 	= ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И СебестоимостьТоваров.ВидДеятельностиНДС 			= ТаблицаОстатков.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И НЕ СебестоимостьТоваров.РасчетСебестоимости
	|	И СебестоимостьТоваров.СтоимостьРегл <> 0
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПериодыПартий.Организация                         			 КАК Организация,
	|	ПериодыПартий.АналитикаУчетаНоменклатуры          			 КАК АналитикаУчетаНоменклатуры,
	|	ПериодыПартий.РазделУчета                         			 КАК РазделУчета,
	|	ПериодыПартий.ВидЗапасов                          			 КАК ВидЗапасов,
	|	ПериодыПартий.Партия                          	  			 КАК Партия,
	|	ПериодыПартий.АналитикаУчетаПартий                			 КАК АналитикаУчетаПартий,
	|	ПериодыПартий.АналитикаФинансовогоУчета           			 КАК АналитикаФинансовогоУчета,
	|	ПериодыПартий.ВидДеятельностиНДС                  			 КАК ВидДеятельностиНДС,
	|	ПериодыПартий.Период                              			 КАК Период,
	|
	|	СУММА(ЕСТЬNULL(Себестоимость.Количество, 0))             	 КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА ЕСТЬNULL(Себестоимость.Количество, 0) <> 0 ТОГДА ЕСТЬNULL(Себестоимость.СтоимостьРегл, 0)
	|		ИНАЧЕ 0 КОНЕЦ
	|	) КАК СтоимостьРегл,
	|	СУММА(ЕСТЬNULL(Себестоимость.СтоимостьЗабалансоваяРегл, 0))  КАК СтоимостьЗабалансоваяРегл
	|
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|
	|ИЗ
	|	ТаблицаПериодыПартий КАК ПериодыПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|		ПО ПериодыПартий.АналитикаУчетаНоменклатуры 	= Себестоимость.АналитикаУчетаНоменклатуры
	|			И ПериодыПартий.РазделУчета             	= Себестоимость.РазделУчета
	|			И ПериодыПартий.ВидЗапасов              	= Себестоимость.ВидЗапасов
	|			И ПериодыПартий.Организация             	= Себестоимость.Организация
	|			И ПериодыПартий.Партия 						= Себестоимость.Партия
	|			И ПериодыПартий.АналитикаУчетаПартий 		= Себестоимость.АналитикаУчетаПартий
	|			И ПериодыПартий.АналитикаФинансовогоУчета 	= Себестоимость.АналитикаФинансовогоУчета
	|			И ПериодыПартий.ВидДеятельностиНДС 			= Себестоимость.ВидДеятельностиНДС
	|			И Себестоимость.СлужебноеВидДвиженияПриход
	|			И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|			И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыПартий.АналитикаУчетаНоменклатуры,
	|	ПериодыПартий.РазделУчета,
	|	ПериодыПартий.ВидЗапасов,
	|	ПериодыПартий.Организация,
	|	ПериодыПартий.Партия,
	|	ПериодыПартий.АналитикаУчетаПартий,
	|	ПериодыПартий.АналитикаФинансовогоУчета,
	|	ПериодыПартий.ВидДеятельностиНДС,
	|	ПериодыПартий.Период
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	ТаблицаОстатков.Партия,
	|	ТаблицаОстатков.АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаОстатков.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьРеглОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьРеглОстаток,
	|	ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток +
	|	ВЫБОР КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0) ТОГДА
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0)
	|	ИНАЧЕ
	|		ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ КАК НоваяСтоимостьЗабалансоваяРеглОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток КАК НоваяСтоимостьДопРасходыОстаток,
	|	ТаблицаОстатков.ТрудозатратыРеглОстаток    КАК НоваяТрудозатратыРеглОстаток,
	|	ТаблицаОстатков.ПостатейныеРеглОстаток 	   КАК НоваяПостатейныеРеглОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.Партия 					= ТаблицаВнешнихПоступлений.Партия
	|			И ТаблицаОстатков.АналитикаУчетаПартий 		= ТаблицаВнешнихПоступлений.АналитикаУчетаПартий
	|			И ТаблицаОстатков.АналитикаФинансовогоУчета = ТаблицаВнешнихПоступлений.АналитикаФинансовогоУчета
	|			И ТаблицаОстатков.ВидДеятельностиНДС 		= ТаблицаВнешнихПоступлений.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|	ТаблицаНовыхОстатков.Партия,
	|	ТаблицаНовыхОстатков.АналитикаУчетаПартий,
	|	ТаблицаНовыхОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаНовыхОстатков.ВидДеятельностиНДС,
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток          		КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода 		КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход				 		КАК КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьРеглОстаток       		КАК СтоимостьРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяРеглОстаток 	КАК СтоимостьЗабалансоваяРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток 		КАК СтоимостьДопРасходыОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыРеглОстаток 	 		КАК ТрудозатратыРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеРеглОстаток 	 		КАК ПостатейныеРеглОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока НЕ Запрос.Выполнить().Пустой() Цикл 
		// Максимальное количество выполнений запроса - максимальному количеству поступлений товара на склад.
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.Партия 					КАК Партия,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаПартий 		КАК АналитикаУчетаПартий,
	|	ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	ТаблицаУзлыКорректировки.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|
	|	ТаблицаУзлыКорректировки.Количество
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КАК Количество,
	|
	|	(ВЫБОР КОГДА ТаблицаУзлыКорректировки.Количество
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаУзлыКорректировки.Стоимость
	|			* ТаблицаУзлыКорректировки.Количество
	|			- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.Стоимость
	|			* ТаблицаУзлыКорректировки.Количество
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0))
	|		/ (ТаблицаУзлыКорректировки.Количество
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		+ ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ)
	|	+ (
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА 0
	|	КОГДА ТаблицаУзлыКорректировки.Количество
	|			- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0 ИЛИ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаУзлыКорректировки.Стоимость
	|			* ТаблицаУзлыКорректировки.Количество
	|			- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) = 0
	|		И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|		ТОГДА 0	
	|	ИНАЧЕ
	|		(ТаблицаУзлыКорректировки.СтоимостьДопРасходы
	|			* ТаблицаУзлыКорректировки.Количество
	|		- ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0))
	|		/ (ТаблицаУзлыКорректировки.Количество
	|		- ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ) КАК Стоимость,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьЗабалансовая
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 	 	  + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0))
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|	ТаблицаУзлыКорректировки.СтоимостьБезНДС           КАК СтоимостьБезНДС,
	|	
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22 ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.СтоимостьДопРасходы
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                              КАК СтоимостьДопРасходы,
	|
	|	ТаблицаУзлыКорректировки.СтоимостьДопРасходыБезНДС КАК СтоимостьДопРасходыБезНДС,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазница         КАК ПостояннаяРазница,
	|	ТаблицаУзлыКорректировки.ПостояннаяРазницаЗнак,
	|	ТаблицаУзлыКорректировки.ВременнаяРазница          КАК ВременнаяРазница,
	|	ТаблицаУзлыКорректировки.ВременнаяРазницаЗнак,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.Трудозатраты
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыРеглОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК Трудозатраты,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА ТаблицаУзлыКорректировки.Стоимость
	|				* ТаблицаУзлыКорректировки.Количество
	|				- ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ (ТаблицаУзлыКорректировки.ПостатейныеСНДС
	|				* ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеРеглОстаток, 0))
	|			 	 / (ТаблицаУзлыКорректировки.Количество
	|			 	 	 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0))
	|	КОНЕЦ                                 КАК ПостатейныеСНДС,
	|	0 КАК ПостатейныеБезНДС
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры 	 = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета             	 = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов              	 = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация           	 = ТаблицаОстатков.Организация
	|			И ТаблицаУзлыКорректировки.Партия 					 = ТаблицаОстатков.Партия
	|			И ТаблицаУзлыКорректировки.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|			И ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры


// Служебная, этап 3.7, 3.11
// Процедура выполняет расчет себестоимости аналитики номенклатуры в узлах корректировки стоимости списания.
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений", содержащая себестоимость
// в каждом узле корректировки.
//
Процедура РешитьСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("ЗащитаОтПереполненияПоля", 999999999.999999999);
	
	СчетчикИтераций   = 1;
	ТекущееОтклонение = 1;
	
	Пока ТекущееОтклонение > ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность
	 И СчетчикИтераций <= ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций Цикл
		
		Запрос.Текст = 
		"
		// 0 Расчет коэффициентов (количество перехода из состояния в состояние) уравнения.
		|ВЫБРАТЬ
		|	УзлыКорректировки.НомерУзла                                     КАК НомерУзла,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.Стоимость)                  КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициент,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.СтоимостьБезНДС)            КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентБезНДС,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.ПостояннаяРазница)          КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентПостояннаяРазница,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.ВременнаяРазница)           КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентВременнаяРазница,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.СтоимостьДопРасходы)        КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентДопРасходы,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.СтоимостьДопРасходыБезНДС)  КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентДопРасходыБезНДС,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.СтоимостьЗабалансовая)      КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентСтоимостьЗабалансовая,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.Трудозатраты)  				КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентТрудозатраты,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.ПостатейныеСНДС)  			КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентПостатейныеСНДС,
		|	ВЫРАЗИТЬ(МАКСИМУМ(УзлыКорректировки.ПостатейныеБезНДС)  		КАК ЧИСЛО(23,10)) КАК СвободныйКоэффициентПостатейныеБезНДС,
		|
		|	МАКСИМУМ(УзлыКорректировки.ВременнаяРазницаЗнак)  КАК ВременнаяРазницаЗнак,
		|	МАКСИМУМ(УзлыКорректировки.ПостояннаяРазницаЗнак) КАК ПостояннаяРазницаЗнак,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.Постатейные, ЛОЖЬ) ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Стоимость, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10)) КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.Постатейные, ЛОЖЬ) ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьБезНДС, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10)) КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК СтоимостьБезНДС,
		|
		|	ВЫРАЗИТЬ(СУММА((
		|       ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(НЕ ПеремещенияСписания.ПринимаемыеВНУ, ЛОЖЬ)
		|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Стоимость, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьДопРасходы, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Трудозатраты, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеСНДС, 0) КАК ЧИСЛО(23,10))
		|			ИНАЧЕ
		|				ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазница, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазницаЗнак, 0) КАК ЧИСЛО(1,0)) КОНЕЦ)
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10))) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК ПостояннаяРазница,
		|
		|	ВЫРАЗИТЬ(СУММА((
		|       ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ)
		|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.Стоимость, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(-ВтТаблицаРешений.СтоимостьДопРасходы, 0) КАК ЧИСЛО(23,10))
		|			ИНАЧЕ 0 КОНЕЦ
		|       + ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.КосвенныеЗатратыНУ, ЛОЖЬ) И ЕСТЬNULL(ПеремещенияСписания.ПринимаемыеВНУ, ИСТИНА)
		|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Стоимость, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьДопРасходы, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Трудозатраты, 0) КАК ЧИСЛО(23,10))
		|					+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеСНДС, 0) КАК ЧИСЛО(23,10))
		|					- ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазница, 0) КАК ЧИСЛО(23,10))
		|						* ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазницаЗнак, 0) КАК ЧИСЛО(1,0))
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазница, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазницаЗнак, 0) КАК ЧИСЛО(1,0)) КОНЕЦ)
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10))) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК ВременнаяРазница,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|       ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьДопРасходы, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10)) КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК СтоимостьДопРасходы,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|       ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10)) КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК СтоимостьДопРасходыБезНДС,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.РаботаДляДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10)) КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК СтоимостьЗабалансовая,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
		|		ИНАЧЕ
		|			(ВЫБОР
		|				КОГДА ЕСТЬNULL(ПеремещенияСписания.Постатейные, ЛОЖЬ)
		|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Стоимость, 0) КАК ЧИСЛО(23,10))
		|				ИНАЧЕ 0 КОНЕЦ
		|			+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеСНДС, 0) КАК ЧИСЛО(23,10)))
		|			* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10))
		|		КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК ПостатейныеСНДС,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|       ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Трудозатраты, 0) КАК ЧИСЛО(23,10))
		|				* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10)) КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК Трудозатраты,
		|
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
		|			КОГДА ЕСТЬNULL(ПеремещенияСписания.ПередачаВЭксплуатацию, ЛОЖЬ) ТОГДА 0
		|		ИНАЧЕ
		|			(ВЫБОР
		|				КОГДА ЕСТЬNULL(ПеремещенияСписания.Постатейные, ЛОЖЬ)
		|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьБезНДС, 0) КАК ЧИСЛО(23,10))
		|				ИНАЧЕ 0 КОНЕЦ
		|			+ ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеБезНДС, 0) КАК ЧИСЛО(23,10)))
		|			* ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(23,10))
		|		КОНЕЦ) КАК ЧИСЛО(23,10))
		|		/ ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(23,10)) КАК ПостатейныеБезНДС
		|
		|ПОМЕСТИТЬ ВременнаяТаблицаРешений
		|ИЗ
		|	ВтУзлыКорректировки КАК УзлыКорректировки
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК ПеремещенияСписания
		|		ПО УзлыКорректировки.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений КАК ВтТаблицаРешений
		|		ПО ПеремещенияСписания.НомерУзлаИсточник = ВтТаблицаРешений.НомерУзла
		|ГДЕ
		|	УзлыКорректировки.Количество <> 0
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Стоимость, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьБезНДС, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостояннаяРазница, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ВременнаяРазница, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьДопРасходы, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеСНДС, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.ПостатейныеБезНДС, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|	И ВЫРАЗИТЬ(ЕСТЬNULL(ВтТаблицаРешений.Трудозатраты, 0) КАК ЧИСЛО(23,10)) * ВЫРАЗИТЬ(ЕСТЬNULL(ПеремещенияСписания.Количество, 0) КАК ЧИСЛО(15,3)) МЕЖДУ -&ЗащитаОтПереполненияПоля И &ЗащитаОтПереполненияПоля
		|
		|СГРУППИРОВАТЬ ПО
		|	УзлыКорректировки.НомерУзла,
		|	УзлыКорректировки.Количество
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|////////////////////////////////////////////////////////////////////////////////
		// 1 Расчет ошибки расчета.
		|ВЫБРАТЬ
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.Стоимость,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициент
		|			 + ВременнаяТаблицаРешений.Стоимость)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.Стоимость,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициент
		|				 		+ ВременнаяТаблицаРешений.Стоимость)
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.Стоимость,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициент
		|						+ ВременнаяТаблицаРешений.Стоимость)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК Отклонение,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.СтоимостьБезНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентБезНДС
		|			 + ВременнаяТаблицаРешений.СтоимостьБезНДС)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьБезНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентБезНДС
		|				 		+ ВременнаяТаблицаРешений.СтоимостьБезНДС)
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьБезНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентБезНДС
		|						+ ВременнаяТаблицаРешений.СтоимостьБезНДС)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеБезНДС,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.СтоимостьДопРасходы,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|					 + ВременнаяТаблицаРешений.СтоимостьДопРасходы)) >  0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьДопРасходы,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|					 	+ ВременнаяТаблицаРешений.СтоимостьДопРасходы)
		|
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьДопРасходы,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|						+ ВременнаяТаблицаРешений.СтоимостьДопРасходы)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеДопРасходы,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.СтоимостьДопРасходы,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|					 + ВременнаяТаблицаРешений.СтоимостьДопРасходы)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьДопРасходы,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|						+ ВременнаяТаблицаРешений.СтоимостьДопРасходы)
		|
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьДопРасходы,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|						+ ВременнаяТаблицаРешений.СтоимостьДопРасходы)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеДопРасходыБезНДС,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентСтоимостьЗабалансовая
		|			 + ВременнаяТаблицаРешений.СтоимостьЗабалансовая)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентСтоимостьЗабалансовая
		|				 		+ ВременнаяТаблицаРешений.СтоимостьЗабалансовая)
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентСтоимостьЗабалансовая
		|						+ ВременнаяТаблицаРешений.СтоимостьЗабалансовая)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеЗабалансовая,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.Трудозатраты,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентТрудозатраты
		|			 + ВременнаяТаблицаРешений.Трудозатраты)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.Трудозатраты,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентТрудозатраты
		|				 		+ ВременнаяТаблицаРешений.Трудозатраты)
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.Трудозатраты,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентТрудозатраты
		|						+ ВременнаяТаблицаРешений.Трудозатраты)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеТрудозатраты,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.ПостатейныеСНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеСНДС
		|			 + ВременнаяТаблицаРешений.ПостатейныеСНДС)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеСНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеСНДС
		|				 		+ ВременнаяТаблицаРешений.ПостатейныеСНДС)
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеСНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеСНДС
		|						+ ВременнаяТаблицаРешений.ПостатейныеСНДС)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеПостатейныеСНДС,
		|	ЕСТЬNULL(
		|		МАКСИМУМ(
		|			ВЫБОР КОГДА (ЕСТЬNULL(ТаблицаРешений.ПостатейныеБезНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеБезНДС
		|			 + ВременнаяТаблицаРешений.ПостатейныеБезНДС)) > 0 ТОГДА
		|
		|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеБезНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеБезНДС
		|				 		+ ВременнаяТаблицаРешений.ПостатейныеБезНДС)
		|			ИНАЧЕ
		|				-(
		|					ЕСТЬNULL(ТаблицаРешений.ПостатейныеБезНДС,0) - (ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеБезНДС
		|						+ ВременнаяТаблицаРешений.ПостатейныеБезНДС)
		|					)
		|			КОНЕЦ
		|			)
		|		,0) КАК ОтклонениеПостатейныеБезНДС
		|ИЗ
		|	ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений КАК ТаблицаРешений
		|		ПО ВременнаяТаблицаРешений.НомерУзла = ТаблицаРешений.НомерУзла
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		// 2 Удаление таблиц.
		|УНИЧТОЖИТЬ ВтТаблицаРешений
		|;
		|////////////////////////////////////////////////////////////////////////////////
		// 3 Суммирование коэффициентов.
		|ВЫБРАТЬ
		|	ВременнаяТаблицаРешений.НомерУзла  КАК НомерУзла,
		|	ВЫБОР
		|	 	КОГДА ВременнаяТаблицаРешений.СвободныйКоэффициентВременнаяРазница * ВременнаяТаблицаРешений.ВременнаяРазницаЗнак + ВременнаяТаблицаРешений.ВременнаяРазница < 0
		|			ТОГДА -1
		|			ИНАЧЕ 1
	    |	КОНЕЦ КАК ВременнаяРазницаЗнак,
		|	ВЫБОР
		|	 	КОГДА ВременнаяТаблицаРешений.СвободныйКоэффициентПостояннаяРазница * ВременнаяТаблицаРешений.ПостояннаяРазницаЗнак	+ ВременнаяТаблицаРешений.ПостояннаяРазница < 0
		|			ТОГДА -1
		|			ИНАЧЕ 1
	    |	КОНЕЦ КАК ПостояннаяРазницаЗнак,
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициент
		|			+ ВременнаяТаблицаРешений.Стоимость
		|		КАК ЧИСЛО(23,10))              КАК Стоимость,
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентБезНДС
		|			+ ВременнаяТаблицаРешений.СтоимостьБезНДС
		|		КАК ЧИСЛО(23,10))              КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|	 	КОГДА ВременнаяТаблицаРешений.СвободныйКоэффициентВременнаяРазница * ВременнаяТаблицаРешений.ВременнаяРазницаЗнак + ВременнаяТаблицаРешений.ВременнаяРазница < 0
		|			ТОГДА -(ВременнаяТаблицаРешений.СвободныйКоэффициентВременнаяРазница * ВременнаяТаблицаРешений.ВременнаяРазницаЗнак + ВременнаяТаблицаРешений.ВременнаяРазница)
		|			ИНАЧЕ ВременнаяТаблицаРешений.СвободныйКоэффициентВременнаяРазница * ВременнаяТаблицаРешений.ВременнаяРазницаЗнак + ВременнаяТаблицаРешений.ВременнаяРазница
	    |	КОНЕЦ КАК ЧИСЛО(23,10)) КАК ВременнаяРазница,
		|	ВЫРАЗИТЬ(ВЫБОР
		|	 	КОГДА ВременнаяТаблицаРешений.СвободныйКоэффициентПостояннаяРазница * ВременнаяТаблицаРешений.ПостояннаяРазницаЗнак	+ ВременнаяТаблицаРешений.ПостояннаяРазница < 0
		|			ТОГДА -(ВременнаяТаблицаРешений.СвободныйКоэффициентПостояннаяРазница * ВременнаяТаблицаРешений.ПостояннаяРазницаЗнак	+ ВременнаяТаблицаРешений.ПостояннаяРазница)
		|			ИНАЧЕ ВременнаяТаблицаРешений.СвободныйКоэффициентПостояннаяРазница * ВременнаяТаблицаРешений.ПостояннаяРазницаЗнак	+ ВременнаяТаблицаРешений.ПостояннаяРазница
	    |	КОНЕЦ КАК ЧИСЛО(23,10)) КАК ПостояннаяРазница,
		|
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходы
		|			+ ВременнаяТаблицаРешений.СтоимостьДопРасходы 
		|		КАК ЧИСЛО(23,10))              КАК СтоимостьДопРасходы,
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентДопРасходыБезНДС
		|			+ ВременнаяТаблицаРешений.СтоимостьДопРасходыБезНДС 
		|		КАК ЧИСЛО(23,10))              КАК СтоимостьДопРасходыБезНДС,
		|
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентСтоимостьЗабалансовая
		|			+ ВременнаяТаблицаРешений.СтоимостьЗабалансовая
		|		КАК ЧИСЛО(23,10))              КАК СтоимостьЗабалансовая,
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентТрудозатраты
		|			+ ВременнаяТаблицаРешений.Трудозатраты
		|		КАК ЧИСЛО(23,10))              КАК Трудозатраты,
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеСНДС
		|			+ ВременнаяТаблицаРешений.ПостатейныеСНДС
		|		КАК ЧИСЛО(23,10))              КАК ПостатейныеСНДС,
		|	ВЫРАЗИТЬ(
		|		ВременнаяТаблицаРешений.СвободныйКоэффициентПостатейныеБезНДС
		|			+ ВременнаяТаблицаРешений.ПостатейныеБезНДС
		|		КАК ЧИСЛО(23,10))              КАК ПостатейныеБезНДС
		|
		|ПОМЕСТИТЬ ВтТаблицаРешений
		|
		|ИЗ
		|	ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		// 4 Удаление таблицы.
		|	УНИЧТОЖИТЬ ВременнаяТаблицаРешений
		|";
		
		ПротоколРасчетаПартийИСебестоимости.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВтТаблицаРешений");
		РезультатЗапроса = Запрос.ВыполнитьПакет()[1];
		ПротоколРасчетаПартийИСебестоимости.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ТекущееОтклонение =	Макс(
				Выборка.Отклонение,
				Выборка.ОтклонениеБезНДС,
				Выборка.ОтклонениеДопРасходы,
				Выборка.ОтклонениеДопРасходыБезНДС,
				Выборка.ОтклонениеЗабалансовая,
				Выборка.ОтклонениеТрудозатраты,
				Выборка.ОтклонениеПостатейныеСНДС,
				Выборка.ОтклонениеПостатейныеБезНДС);
		Иначе
			ТекущееОтклонение = 0;
		КонецЕсли;
		
		// Добавим запись в протокол расчета
		СтрокаПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Отклонение на текущей итерации: %1'"),
			ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ТекущееОтклонение));
			
		ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
		
		СчетчикИтераций = СчетчикИтераций + 1;
		
	КонецЦикла;
	
	// Добавим запись в протокол расчета
	СтрокаПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выполнено решение СЛУ (итерации / итоговое отклонение): %1 / %2'"),
		ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(СчетчикИтераций - 1),
		ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ТекущееОтклонение));
		
	ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	// Для целей отладки сохраним СЛУ
	СохранитьДанныеСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл);
	
КонецПроцедуры

#КонецОбласти


#Область Отладка

// Сохраняет временные таблицы, используемые для решения СЛУ, в файлы на диск.
//
Процедура СохранитьДанныеСЛУ(ПараметрыРасчета, РасчетСтоимостиРегл)
	
	ИмяКаталога = ПараметрыРасчета.Отладка.КаталогДляСохраненияДанныхСЛУ;
	Если НЕ ЗначениеЗаполнено(ИмяКаталога) Тогда
		Возврат; // выгрузка СЛУ не требуется
	КонецЕсли;
	
	Каталог = Новый Файл(ИмяКаталога);
	
	Если НЕ Каталог.Существует() ИЛИ НЕ Каталог.ЭтоКаталог() Тогда
		
		СтрокаПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не найден каталог для сохранения данных СЛУ: ""%1""'"),
			ПротоколРасчетаПартийИСебестоимости.ПредставлениеЗначения(ИмяКаталога));
		
		ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
		
		Возврат; // каталог для выгрузки не найден
		
	КонецЕсли;
	
	// ВтУзлыКорректировки и ВтТаблицаРешений выгружаем в один файл "...Узлы".
	//	- одноименным колонкам этих таблиц присвоим префиксы "Узел" и "Решение" соответственно
	// ВтПеремещенияСписания выгружаем в файл "...Дуги".
	
	ИмяКаталога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталога);
	
	ШаблонИмениФайла =
		Формат(ТекущаяДатаСеанса() - Дата(1,1,1), "ЧЦ=12; ЧВН=; ЧГ=")      // дата-время выгрузки
		+ "_" + ?(ПараметрыРасчета.ПредварительныйРасчет, "Предв", "Факт") // какой вид расчета
		+ "_" + ?(РасчетСтоимостиРегл, "Регл", "Упр")					   // какую себестоимость рассчитываем
		+ "_%1.mxl";													   // какую временную таблицу выгружаем
	
	// Получим данные из временных таблиц
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла					 	КАК НомерУзла,
	|	УзлыКорректировки.Организация                	КАК Организация,
	|	УзлыКорректировки.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	УзлыКорректировки.РазделУчета                	КАК РазделУчета,
	|	УзлыКорректировки.ВидЗапасов                 	КАК ВидЗапасов,
	|	УзлыКорректировки.Партия					 	КАК Партия,
	|	УзлыКорректировки.АналитикаУчетаПартий		 	КАК АналитикаУчетаПартий,
	|	УзлыКорректировки.АналитикаФинансовогоУчета	 	КАК АналитикаФинансовогоУчета,
	|	УзлыКорректировки.ВидДеятельностиНДС		 	КАК ВидДеятельностиНДС,
	|
	|	УзлыКорректировки.Количество          		 	КАК Количество,
	|
	|	УзлыКорректировки.Стоимость 				 	КАК УзелСтоимость,
	|	УзлыКорректировки.СтоимостьБезНДС 				КАК УзелСтоимостьБезНДС,
	|	УзлыКорректировки.ПостояннаяРазница
	|		* УзлыКорректировки.ПостояннаяРазницаЗнак 	КАК УзелПостояннаяРазница,
	|	УзлыКорректировки.ВременнаяРазница
	|		* УзлыКорректировки.ВременнаяРазницаЗнак 	КАК УзелВременнаяРазница,
	|	УзлыКорректировки.СтоимостьДопРасходы 			КАК УзелСтоимостьДопРасходы,
	|	УзлыКорректировки.СтоимостьДопРасходыБезНДС 	КАК УзелСтоимостьДопРасходыБезНДС,
	|	УзлыКорректировки.СтоимостьЗабалансовая 		КАК УзелСтоимостьЗабалансовая,
	|	УзлыКорректировки.Трудозатраты 					КАК УзелТрудозатраты,
	|	УзлыКорректировки.ПостатейныеСНДС 				КАК УзелПостатейныеСНДС,
	|	УзлыКорректировки.ПостатейныеБезНДС 			КАК УзелПостатейныеБезНДС,
	|
	|	ТаблицаРешений.Стоимость 				 		КАК РешениеСтоимость,
	|	ТаблицаРешений.СтоимостьБезНДС 					КАК РешениеСтоимостьБезНДС,
	|	ТаблицаРешений.ПостояннаяРазница
	|		* ТаблицаРешений.ПостояннаяРазницаЗнак 		КАК РешениеПостояннаяРазница,
	|	ТаблицаРешений.ВременнаяРазница
	|		* ТаблицаРешений.ВременнаяРазницаЗнак 		КАК РешениеВременнаяРазница,
	|	ТаблицаРешений.СтоимостьДопРасходы 				КАК РешениеСтоимостьДопРасходы,
	|	ТаблицаРешений.СтоимостьДопРасходыБезНДС 		КАК РешениеСтоимостьДопРасходыБезНДС,
	|	ТаблицаРешений.СтоимостьЗабалансовая 			КАК РешениеСтоимостьЗабалансовая,
	|	ТаблицаРешений.Трудозатраты 					КАК РешениеТрудозатраты,
	|	ТаблицаРешений.ПостатейныеСНДС 					КАК РешениеПостатейныеСНДС,
	|	ТаблицаРешений.ПостатейныеБезНДС 				КАК РешениеПостатейныеБезНДС
	|ИЗ
	|	ВТУзлыКорректировки КАК УзлыКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаРешений КАК ТаблицаРешений
	|		ПО УзлыКорректировки.НомерУзла = ТаблицаРешений.НомерУзла
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник 		КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник 		КАК НомерУзлаПриемник,
	|	ПеремещенияСписания.Количество 				КАК Количество,
	|	ПеремещенияСписания.ПередачаВЭксплуатацию	КАК ПередачаВЭксплуатацию,
	|	ПеремещенияСписания.ПринимаемыеВНУ			КАК ПринимаемыеВНУ,
	|	ПеремещенияСписания.КосвенныеЗатратыНУ		КАК КосвенныеЗатратыНУ
	|ИЗ
	|	ВТПеремещенияСписания КАК ПеремещенияСписания
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзлаПриемник,
	|	НомерУзлаИсточник
	|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Сохраним первый файл
	СтрокаПротокола = ОбщегоНазначенияУТ.СохранитьТаблицуЗначенийВФайл(
		РезультатЗапроса[0].Выгрузить(),
		ИмяКаталога + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, "Узлы"));
	
	Если ЗначениеЗаполнено(СтрокаПротокола) Тогда
		ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола); // ошибка записи файла
	КонецЕсли;
	
	// Сохраним второй файл
	СтрокаПротокола = ОбщегоНазначенияУТ.СохранитьТаблицуЗначенийВФайл(
		РезультатЗапроса[1].Выгрузить(),
		ИмяКаталога + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, "Дуги"));
	
	Если ЗначениеЗаполнено(СтрокаПротокола) Тогда
		ПротоколРасчетаПартийИСебестоимости.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола); // ошибка записи файла
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область УниверсальныеПроцедурыРаботыСЗапросами

// Устанавливает общие параметры запроса из параметров расчета.
// Следует использовать для идентичности имен и значений параметров во всех запросах.
//
Процедура ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета, ИспользоватьОбщийМенеджерВТ = Истина)
	
	// Общие параметры.
	УниверсальныеМеханизмыПартийИСебестоимости.ИнициализироватьСвойстваЗапроса(
		Запрос,
		ПараметрыРасчета,
		ИспользоватьОбщийМенеджерВТ);
	
	// Параметры, относящиеся только к расчету себестоимости.
	Запрос.УстановитьПараметр("ПредварительныйРасчет",         ПараметрыРасчета.ПредварительныйРасчет);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиСтоимость",  ПараметрыРасчета.РешениеСЛУ.ЗначениеПогрешностиСтоимость);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиКоличество", ПараметрыРасчета.РешениеСЛУ.ЗначениеПогрешностиКоличество);
	
	Запрос.УстановитьПараметр("СредняяЗаМесяц", ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.СредняяЗаМесяц);
	
	// Отборы по хозяйственным операциям.
	Запрос.УстановитьПараметр("МассивОперацийРеализации",				МассивОперацийРеализации());
	Запрос.УстановитьПараметр("МассивОперацийВозвратыПрошлыхПериодов",  МассивОперацийВозвратыПрошлыхПериодов());
	Запрос.УстановитьПараметр("МассивОперацийПередачи",                 МассивОперацийПередачиТоваров());
	Запрос.УстановитьПараметр("МассивОперацийПоступление",              МассивОперацийВнешнееПоступление());
	Запрос.УстановитьПараметр("МассивОперацийПоступлениеВнешнее",       МассивОперацийДляОценкиОстаткаТоваровПоФИФО());
	
КонецПроцедуры

#Область ОтборыПоХозяйственнымОперациям

Функция МассивОперацийРеализации()
	
	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияВРозницу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.СторноРеализации);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионера);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями);;
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДавальцу);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция МассивОперацийПередачиТоваров()

	Массив = Новый Массив;
	
	Массив.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
	
	Возврат Массив;
	
КонецФункции

Функция МассивОперацийВозвратыПрошлыхПериодов()

	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция МассивОперацийВнешнееПоступление()

	// Формируется список всех хоз. операций, которые являются внешним поступлением (известна их стоимость).
	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеТоваров);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоВозврату);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет); // сторнирование реализации регл. учета по управленческой организации
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаВПроизводство);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	
	// Таможенная декларация (старые и новые хоз. операции).
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыБезПартии);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыСПартией);
	
	// Возврат прошлого периода используется только для операций расчета по среднему,
	// т.к. оценивать остатки для ФИФО не корректно.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов);
	
	// Операции по комиссионным и давальческим товарам.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	
	Возврат ХозОперации;

КонецФункции

Функция МассивОперацийДляОценкиОстаткаТоваровПоФИФО()

	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеТоваров);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоВозврату);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет); // сторнирование реализации регл. учета по управленческой организации
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаВПроизводство);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
	
	// Таможенная декларация (старые и новые хоз. операции).
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыБезПартии);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыСПартией);
	
	// Операции по комиссионным и давальческим товарам.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	
	Возврат ХозОперации;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область УниверсальныеПроцедурыРаботыСДвижениями

// Добавляет новую строку в таблицу движений указанного регистра и заполняет служебные поля.
// Сделана экспортной для вызова из модуля универсальных механизмов расчетов.
//
Функция ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля = Неопределено) Экспорт
	
	ОписаниеРегистра = ПараметрыРасчета.Движения[ИмяРегистра];
	
	// Добавим запись универсальной процедурой, а потом дозаполним поля, относящиеся только к расчету себестоимости
	Запись = УниверсальныеМеханизмыПартийИСебестоимости.ДобавитьЗаписьВТаблицуДвижений(
		ПараметрыРасчета,
		ОписаниеРегистра,
		ДанныеДвижения,
		КопируемыеПоля);
	
	// Заполним поле Регистратор из обязательного свойства ДокументДвижения источника ДанныеДвижения.
	Запись.Регистратор = ДанныеДвижения.ДокументДвижения;
	
	// Заполним пустой регистратор соответствующим документом расчета себестоимости
	Если ПараметрыРасчета.Отладка.ИсправлятьПустойРегистратор И НЕ ЗначениеЗаполнено(Запись.Регистратор) Тогда
		
		Если ОписаниеРегистра.ЕстьОрганизация Тогда
			Запись.Регистратор = ПараметрыРасчета.ДокументыРасчетаПоОрганизациям.Получить(ДанныеДвижения.Организация);
		ИначеЕсли ОписаниеРегистра.ЕстьАналитикаПартнеров Тогда
			Запись.Регистратор = ПараметрыРасчета.ДокументыРасчетаПоОрганизациям.Получить(
				ПараметрыРасчета.Отладка.ОрганизацияПоАналитикеПартнеров.Получить(ДанныеДвижения.АналитикаУчетаПоПартнерам));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.Регистратор) Тогда
			ТекстОшибки = НСтр("ru='Документ %1 установлен регистратором движения регистра %2 вместо %3,
				|который не может иметь движений по данному регистру.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				Запись.Регистратор,
				ИмяРегистра,
				ДанныеДвижения.ДокументДвижения);
			ЗаписьЖурналаРегистрации(
				УниверсальныеМеханизмыПартийИСебестоимости.ИмяСобытияОшибкиДляЖурналаРегистрации(ПараметрыРасчета),
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	// Если регистратор не заполнен, то запомним информацию об ошибке
	Если НЕ ЗначениеЗаполнено(Запись.Регистратор) Тогда
		
		Если НЕ ЗначениеЗаполнено(ДанныеДвижения.ДокументДвижения) Тогда
			// Ошибка в запросах - не заполнено обязательное поле ДокументДвижения.
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнено свойство ДокументДвижения для движения по регистру ""%1""'"),
				ИмяРегистра);
		Иначе
			// Ошибка в метаданных - документ не является регистратором для данного регистра.
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ ""%1"" не может иметь движений по регистру ""%2""'"),
				СокрЛП(ДанныеДвижения.ДокументДвижения),
				ИмяРегистра);
		КонецЕсли;
		
		ПротоколРасчетаПартийИСебестоимости.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаФормированияДвиженийПоРегистрам,
			ТекстДляПротокола);
		
		Для Каждого КлючИЗначение Из ПараметрыРасчета.ДокументыРасчетаПоОрганизациям Цикл
			// Заполним регистратор произвольным "первым" документом расчета себестоимости - чтобы движения можно было записать.
			// Расчет все равно в итоге будет завершен с ошибкой, но т.о. можно получить информацию о всех ошибочных регистраторах.
			Запись.Регистратор = КлючИЗначение.Ключ;
			Прервать;
		КонецЦикла;

	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

#КонецОбласти

#Область УниверсальныеПроцедурыОписанияДанныхМеханизма

// Возвращает перечень объектов метаданных, на основании данных которых выполняется расчет себестоимости.
// В перечень не включаются объекты, которые являются одновременно и исходящими данными механизмов расчета партий и себестоимости.
//
// Параметры:
//	ВходящиеДанные - Соответствие - уже инициализированное хранилище для описания входящих данных
//	ТолькоТребующиеПерерасчета - Булево - если установлен, то будет возвращен перечень только тех данных,
//		изменение которых влечет за собой необходимость перерасчета партий и себестоимости
//		При изменении этих данных должна создаваться запись в регистре сведений ЗаданияКРасчетуСебестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных
//
Функция ВходящиеДанныеМеханизма(ВходящиеДанные = Неопределено, ТолькоТребующиеПерерасчета = Ложь) Экспорт
	
	Если ВходящиеДанные = Неопределено Тогда
		ВходящиеДанные = Новый Соответствие;
	КонецЕсли;
	
	Если ТолькоТребующиеПерерасчета Тогда
		Значение = Истина; // чтобы можно было проверить вхождение объекта метаданных в это соответствие
	Иначе
		Значение = Неопределено;
	КонецЕсли;
	
	Если НЕ ТолькоТребующиеПерерасчета Тогда 
		
		ВходящиеДанные.Вставить(Метаданные.Документы.ВнутреннееПотреблениеТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ВозвратТоваровОтКлиента, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.КорректировкаРеализации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПеремещениеТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПоступлениеТоваровУслуг, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, Значение);
		//++ НЕ УТ
		ВходящиеДанные.Вставить(Метаданные.Документы.ВыпускПродукции, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.МодернизацияОС, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПринятиеКУчетуНМА, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПринятиеКУчетуОС, Значение);
		//-- НЕ УТ
		
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаНоменклатуры, Значение);
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаПоПартнерам, Значение);
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.Справочники.КатегорииЭксплуатации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.КлючиАналитикиУчетаНоменклатуры, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.Назначения, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.ПартииТМЦВЭксплуатации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.СпособыРаспределенияПоНаправлениямДеятельности, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.ПланыВидовХарактеристик.СтатьиРасходов, Значение);
		
	КонецЕсли;

	//++ НЕ УТ
	ВходящиеДанные.Вставить(Метаданные.Документы.РаспределениеПрочихЗатрат, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыпускПродукции, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииНезавершенногоПроизводства, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТрудозатратыНезавершенногоПроизводства, Значение);
	//-- НЕ УТ
	
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, Значение);
	
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизаций, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизацийКПередаче, Значение);
	
	// Добавим регистры партионного учета версии 2.1
	ПартионныйУчет22.НеиспользуемыеДанныеМеханизмаВерсии21(ВходящиеДанные, Значение);
	
	Возврат ВходящиеДанные;
	
КонецФункции

// Возвращает перечень регистров, обслуживаемых механизмом расчета себестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных
//
Функция ИсходящиеДанныеМеханизма(ИсходящиеДанные = Неопределено) Экспорт
	
	// Перечень метаданных регистров, по которым формируются движения при расчете себестоимости.
	Если ИсходящиеДанные = Неопределено Тогда
		ИсходящиеДанные = Новый Соответствие;
	КонецЕсли;
	
	ИсходящиеДанные.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, 							Истина);
	
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, 			Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, 					Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.Закупки, 								Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, 							Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, 							Истина);
	//++ НЕ УТ
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства, Истина);
	//-- НЕ УТ
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, 					Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ФинансовыеРезультаты, 					Истина);
	
	Возврат ИсходящиеДанные;
	
КонецФункции

// Возвращает перечень регистров, рассчитываемых механизмом партионного учета версии 2.2, и используемых при расчете себестоимости.
//
Функция ИспользуемыеКэшиРегистровПартионногоУчета() Экспорт
	
	// Здесь перечислены регистры, которые (по И)
	// - рассчитываются механизмом партионного учета версии 2.2
	// - не рассчитываются механизмом расчета себестоимости
	// - являются входящими данными для механизма расчета себестоимости (используются кэши данных регистров)
	//
	// В случае, если выполняется отдельный запуск расчета себестоимости (не из партионного учета версии 2.2),
	// эти регистры не будут инициализированы - к их кэшам обращаться нельзя.
	//
	// Для этого делается следующее:
	// - перед началом расчета себестоимости "принудительно" инициализируются эти регистры (для того, чтобы сформировались их расчетные кэши)
	// - перед записью движений эти регистры удаляются из параметров расчета (записывать их не надо - движения по ним не формировались)
	
	ВходящиеДанные = Новый Соответствие;
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, 	  Истина);
	//++ НЕ УТ
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииНезавершенногоПроизводства,       Истина);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТрудозатратыНезавершенногоПроизводства, Истина);
	//-- НЕ УТ
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, 			  	  Истина);
	
	Возврат ВходящиеДанные;
	
КонецФункции

// Возвращает название данного механизма и его номер версии.
//
Функция ТекущаяВерсияМеханизма() Экспорт
	Возврат НСтр("ru='Расчет себестоимости, версия 2.2'");
КонецФункции

#КонецОбласти

#КонецОбласти
