
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивИсключаемыхЗначений = Новый Массив;
	МассивИсключаемыхЗначений.Добавить(Перечисления.АмортизационныеГруппы.ДесятаяГруппа);
	МассивИсключаемыхЗначений.Добавить(Перечисления.АмортизационныеГруппы.ОтдельнаяГруппа);
		
	ОбщегоНазначенияУТВызовСервера.ПолучитьСписокВыбораПеречисления(
		"АмортизационныеГруппы",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	
КонецПроцедуры

#КонецОбласти
