#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьЕТС();
	
КонецПроцедуры

Процедура ЗаполнитьЕТС()
	
	ЗаполнитьЭлемент("Разряд1",1);
	ЗаполнитьЭлемент("Разряд2",1.16);
	ЗаполнитьЭлемент("Разряд3",1.35);
	ЗаполнитьЭлемент("Разряд4",1.57);
	ЗаполнитьЭлемент("Разряд5",1.73);
	ЗаполнитьЭлемент("Разряд6",1.9);
	ЗаполнитьЭлемент("Разряд7",2.03);
	ЗаполнитьЭлемент("Разряд8",2.17);
	ЗаполнитьЭлемент("Разряд9",2.32);
	ЗаполнитьЭлемент("Разряд10",2.48);
	ЗаполнитьЭлемент("Разряд11",2.65);
	ЗаполнитьЭлемент("Разряд12",2.84);
	ЗаполнитьЭлемент("Разряд13",3.04);
	ЗаполнитьЭлемент("Разряд14",3.25);
	ЗаполнитьЭлемент("Разряд15",3.48);
	ЗаполнитьЭлемент("Разряд16",3.72);
	ЗаполнитьЭлемент("Разряд17",3.98);
	ЗаполнитьЭлемент("Разряд18",4.26);
	ЗаполнитьЭлемент("Разряд19",4.56);
	ЗаполнитьЭлемент("Разряд20",4.88);
	ЗаполнитьЭлемент("Разряд21",5.22);
	ЗаполнитьЭлемент("Разряд22",5.59);
	ЗаполнитьЭлемент("Разряд23",5.98);
	ЗаполнитьЭлемент("Разряд24",6.4);
	ЗаполнитьЭлемент("Разряд25",6.85);
	ЗаполнитьЭлемент("Разряд26",7.33);
	ЗаполнитьЭлемент("Разряд27",7.84); 

КонецПроцедуры

Процедура ЗаполнитьЭлемент(СсылкаИлиИмяПредопределенныхДанных,Коэффициент)
	
	Если ТипЗнч(СсылкаИлиИмяПредопределенныхДанных) = Тип("Строка") И Не ПустаяСтрока(СсылкаИлиИмяПредопределенныхДанных) Тогда
		
		СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ЕдинаяТарифнаяСетка." + СсылкаИлиИмяПредопределенныхДанных);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ЕдинаяТарифнаяСетка.СоздатьЭлемент();
			Элемент.ИмяПредопределенныхДанных = СсылкаИлиИмяПредопределенныхДанных;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(СсылкаИлиИмяПредопределенныхДанных) Тогда
			СсылкаНаЭлемент = СсылкаИлиИмяПредопределенныхДанных;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
			Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ЕдинаяТарифнаяСетка.СоздатьЭлемент();
		КонецЕсли;
		
	КонецЕсли;
	
	Элемент.Коэффициент			= Коэффициент;
	
	Элемент.ОбменДанными.Загрузка = Истина;
	Элемент.Записать();    	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
