// 4D:ERP для Беларуси
// {
// Форма изменена
// }
// 4D

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// 4D:ERP для Беларуси, Юлия, 11.01.2018 12:13:16 
	// При работе с регистром "Вычеты к доходам по НДФЛ" не дает редактировать и вносить новые данные
	// {
	// Дейтвтие не требуется.
	// }
	// 4D
	
КонецПроцедуры

#КонецОбласти
