////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с СППР"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает прокси веб-сервиса СППР. В случае ошибки при создании вызывается исключение.
//
// Возвращаемое значение:
//	WSПрокси - Прокси веб-сервиса
//
Функция ПолучитьПрокси() Экспорт

	Возврат ИнтеграцияССППР.ПолучитьПрокси();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьДанныеФунциональнойМодели() Экспорт

	ВебСервис = ПолучитьПрокси();
	
	ДанныеФунциональнойМодели = Новый Структура;
	
	СписокФункцийДерево = ИнтеграцияССППР.СписокФункций(ВебСервис);
	ДанныеФунциональнойМодели.Вставить("СписокФункцийДерево", СписокФункцийДерево);
	
	СписокОбъектовДерево = ИнтеграцияССППР.СписокОбъектов(ВебСервис);
	ДанныеФунциональнойМодели.Вставить("СписокОбъектовДерево", СписокОбъектовДерево);
	
	СписокПрофилейДерево = ИнтеграцияССППР.СписокПрофилей(ВебСервис);
	ДанныеФунциональнойМодели.Вставить("СписокПрофилейДерево", СписокПрофилейДерево);
	
	Возврат ДанныеФунциональнойМодели;

КонецФункции

Функция ОписаниеРазделаИнтерфейса(РазделИнтерфейса) Экспорт

	Возврат ИнтеграцияССППР.ОписаниеРазделаИнтерфейса(РазделИнтерфейса);
	
КонецФункции

Функция ОписаниеФормы(ИмяФормы, ИмяМетаданных, ЗаголовокФормы) Экспорт

	Возврат ИнтеграцияССППР.ОписаниеФормы(ИмяФормы, ИмяМетаданных, ЗаголовокФормы);

КонецФункции

#КонецОбласти

