#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	УчетНДФЛВызовСервера.ВидыВычетовНДФЛОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьКодыВычетовНДФЛ();
	
	// 4D:ERP для Беларуси, Петр, 19.12.2017 9:26:42 
	// Спр. Виды вычетов по подоходному налогу, № 17173
	// {
	ЗаполнитьКодыВычетовНДФЛНеИспользуется();
	// }
	// 4D
	
КонецПроцедуры

Процедура ЗаполнитьКодыВычетовНДФЛ() Экспорт
	
	// 4D:ERP для Беларуси, Анна, 08.06.2017 17:54:49 
	// Виды налоговых вычетов для физ. лиц не соответствуют установленным в РБ, №14906
	// Редактировать справочник "Виды вычетов подоходного налога", № 16279
	// Изменить группу на "Социальные" для вычетов с кодами 630 и 640, № 17687
	// {
	ВычетыНДФЛ = Справочники.ВидыВычетовНДФЛ;
	ГруппыВычетов = Перечисления.ГруппыВычетовПоНДФЛ;
	
	ОписатьКодВычетаНДФЛ("Код600", "600", "Личный вычет по основному месту работы согласно ст.164 НК РБ ОЧ", Ложь, ГруппыВычетов.Стандартные, , "600");
	ОписатьКодВычетаНДФЛ("Код620", "620", "Дополнительный личный согласно ст.164  НК РБ ОЧ", Ложь, ГруппыВычетов.Стандартные,,"620");
	ОписатьКодВычетаНДФЛ("Код610", "610", "Вычет на  ребенка и иждивенца согласно ст.164 НК РБ ОЧ", Ложь, ГруппыВычетов.СтандартныеНаДетей,,"610");
	ОписатьКодВычетаНДФЛ("Код611", "611", "Льготный вычет на двух и более детей согласно ст.164 НК РБ ОЧ", Ложь, ГруппыВычетов.СтандартныеНаДетей,,"611");
	
	ОписатьКодВычетаНДФЛ("Код640", "630", "Сумма, уплаченная плательщиком за обучение в учреждениях образования РБ согласно пп.1.1 п.1 ст.165 НК РБ ОЧ", Ложь, ГруппыВычетов.Социальные,,"630");
	ОписатьКодВычетаНДФЛ("Код640страх", "640", "Сумма, уплаченная по договорам добровол. страх-ния жизни и доп. пенсии, заключенным на срок не менее 3 лет согласно пп.1.2 п.1 ст.165 НК РБ ОЧ", Ложь, ГруппыВычетов.Социальные,,"640");
	ОписатьКодВычетаНДФЛ("Код650", "650", "Фактические расходы на новое строительство (приобретение) жилья, состоящими на учете нуждающихся в улучшении жилищных услов пп.1.1 п.1 ст.166 НК РБ ОЧ", Ложь, ГруппыВычетов.Имущественные,,"650");
	ОписатьКодВычетаНДФЛ("Код7000", "660", "В размере 10 процентов общей суммы, подлеж. налогообл. дох., от реал. возмездно отчуждаемого имущ-ва пп.1.2 п.1 ст.166 НК РБ ОЧ", Ложь, ГруппыВычетов.Имущественные,,"660");	
	
	ОписатьКодВычетаНДФЛ("Код571", 		  "163115", "Доходы, получаемые от реализации продукции животноводства, растениеводства и пчеловодства пп.1.15 п.1 ст.163 НК РБ ОЧ", Истина,,,"163115");														
	ОписатьКодВычетаНДФЛ("Код1613", 	  "16811", "Профес. налог. вычет в размере 10 процентов суммы доходов, от предпринимательской деятельности согласно пп.1.1 п.1 ст.168 НК РБ ОЧ", Истина,,,"16811");								
	ОписатьКодВычетаНДФЛ("Код404", 		  "16813", "Сумма фактически произведенных расходов, связанных с получением авторских вознаграждений согласно пп.1.3 п.1 ст.168 НК РБ ОЧ", Истина,,,"16813");								
	ОписатьКодВычетаНДФЛ("Код1614", 	  "16814", "Сумма фактически произведенных расходов, плательщиков спортсменов согласно пп.1.4 п.1 ст.168 НК РБ ОЧ", Истина,,,16814);								
	ОписатьКодВычетаНДФЛ("Код500иныеорг", "500иные", "Доходы, не явл.вознг.за труд от иных орг-ций и ИП в сумме, не превыш. установл. абз.3 части 1.пп.1.19 п.1 ст.163 НК РБ размер", Истина,,,"500иные");								
	ОписатьКодВычетаНДФЛ("Код500",    	  "500", "Доходы, не явл. вознагр. за труд, получаемые по месту осн. работы, в сумме, не превыш. установл. абз.2 части 1 пп.1.19 п.1 ст.163 НК РБ размер", Истина,,,"500");								
	ОписатьКодВычетаНДФЛ("Код3136", 	  "501", "Спонсор.помощь в ден/натур.формах от орг-ций, физ.лиц. инвалидами, сиротами и др, в сумме непревыш. установл. абз.2 пп.1.21 п.1 ст.163 НК РБ размер", Истина,,,"501");								
	ОписатьКодВычетаНДФЛ("Код540", 		  "502", "Сумма мат помощи, стоим-ть подарков из средств профсоюзов, в сумме, не превыш. установл. частью 1 пп.1.26 п.1 ст.163 НК РБ размер", Истина,,,"502");
	ОписатьКодВычетаНДФЛ("Код1503",       "503", "Оплата страх.услуг страх.орг., получаемых от орг. и ИП, по осн.месту (в т.ч. пенсионерами), в сумме, не превыш. установл. пп.1.19_1 п.1 ст.163 размер", Истина,,,"503");
	ОписатьКодВычетаНДФЛ("Код163110_1",   "504", "Стоимость путевок в орг-ции РБ, д/детей до 18 лет и оплач.засчет средств бел.орг.; ИП, в сумме, не превыш. установл. пп.1.10_1 п.1 ст.163 НК РБ размер", Истина,,,"504");
	ОписатьКодВычетаНДФЛ("Код1505",       "505", "Доходы, освобожд.от налогообл.мест.Советами депутатов (мест.исполнит.и распоряд.органами)", Истина,,,"505");
	ОписатьКодВычетаНДФЛ("Код3117", 	  "16317", "Ежемес. ден. выплаты физ лицам имеющим звание ""народный"" согласно пп.1.7 п.1 ст.163 НК РБ ОЧ", Истина,,,"16317");															
	ОписатьКодВычетаНДФЛ("Код510", 		  "163120", "Призы, получ.спортсменами в размерах опред.Президентом и (или) Советом Министров РБ согласно пп.1.20 п.1 ст.163 НК РБ ОЧ", Истина,,,"163120");
	ОписатьКодВычетаНДФЛ("Код163120_1",   "163120_1", "Ден. премии, выплач. победит. ежегодн. соревнований за достижение высоких показ.на уборке урожая зерновых и зернобобовых пп.1.20_1 п.1 ст.163 НК РБ ОЧ", Истина,,,"163120_1");
	ОписатьКодВычетаНДФЛ("Код520", 		  "163118", "Доходы от физ.лиц, не явл. индив. предпр-ми, размере не превыш.заданный предел в НК (дарение, недвиж.имущ-во по дог.ренты) пп.1.18 п.1 ст.163 НК РБ ОЧ", Истина,,,"163118");																																			
	ОписатьКодВычетаНДФЛ("Код405", 		  "16813абз2", "Профес. вычет в размере 20 % суммы начислен. дохода согл. абзаца 2 пп.1.3 п.1 ст.168 НК РБ ОЧ", Истина,,,"16813абз2");								
	ОписатьКодВычетаНДФЛ("Код168133", 	  "16813абз3", "Профес. вычет в размере 30 % суммы начислен. дохода согл. абзаца 3 пп.1.3 п.1 ст.168 НК РБ ОЧ", Истина,,,"16813абз3");								
	ОписатьКодВычетаНДФЛ("Код168134", 	  "16813абз3", "Профес. вычет в размере 40 % суммы начислен. дохода согл. абзаца 4 пп.1.3 п.1 ст.168 НК РБ ОЧ", Истина,,,"16813абз3");	
	ОписатьКодВычетаНДФЛ("Код16313",      "16313вых", "Вых. пособия с вых. на пенсию, не превыш. 9-ти среднемес. зарплат пп.1.3 п.1 ст.163 НК РБ ОЧ", Истина,,,"16313вых");
	ОписатьКодВычетаНДФЛ("Код16313выхпос", "16313вых.пос", "Вых.пособия в связи с прекращением труд. договора (контракта) в  пределах норм согл. абзаца 5 пп.1.3 п.1 ст.163 НК РБ ОЧ", Истина,,,"16313вых.пос");
	ОписатьКодВычетаНДФЛ("Код163113",     "163113", "Доходы в виде опл.труда и иные суммы в иностр.валюте,получ. за работу за предел. террит.РБ плательщиками от гос.органов и др. юр.лиц пп.1.13 п.1 ст163", Истина,,,"163113");
	// }
	// 4D

КонецПроцедуры

// 4D:ERP для Беларуси, Петр, 19.12.2017 9:26:42 
// Спр. Виды вычетов по подоходному налогу, № 17173
// {
Процедура ЗаполнитьКодыВычетовНДФЛНеИспользуется() Экспорт
	
	ОписатьКодВычетаНДФЛНеИспользуется("Код103");
	ОписатьКодВычетаНДФЛНеИспользуется("Код104");
	ОписатьКодВычетаНДФЛНеИспользуется("Код105");
	ОписатьКодВычетаНДФЛНеИспользуется("Код108");
	ОписатьКодВычетаНДФЛНеИспользуется("Код115");
	ОписатьКодВычетаНДФЛНеИспользуется("Код116");
	ОписатьКодВычетаНДФЛНеИспользуется("Код117о");
	ОписатьКодВычетаНДФЛНеИспользуется("Код109");
	ОписатьКодВычетаНДФЛНеИспользуется("Код110");
	ОписатьКодВычетаНДФЛНеИспользуется("Код163119_1");
	ОписатьКодВычетаНДФЛНеИспользуется("Код119");
	ОписатьКодВычетаНДФЛНеИспользуется("Код120");
	ОписатьКодВычетаНДФЛНеИспользуется("Код121о");
	ОписатьКодВычетаНДФЛНеИспользуется("Код112");
	ОписатьКодВычетаНДФЛНеИспользуется("Код111");
	ОписатьКодВычетаНДФЛНеИспользуется("Код123");
	ОписатьКодВычетаНДФЛНеИспользуется("Код124");
	ОписатьКодВычетаНДФЛНеИспользуется("Код125о");
	ОписатьКодВычетаНДФЛНеИспользуется("Код113");
	ОписатьКодВычетаНДФЛНеИспользуется("Код130");
	ОписатьКодВычетаНДФЛНеИспользуется("Код131");
	ОписатьКодВычетаНДФЛНеИспользуется("Код132");
	ОписатьКодВычетаНДФЛНеИспользуется("Код135");
	ОписатьКодВычетаНДФЛНеИспользуется("Код137");
	ОписатьКодВычетаНДФЛНеИспользуется("Код139");
	ОписатьКодВычетаНДФЛНеИспользуется("Код143");
	ОписатьКодВычетаНДФЛНеИспользуется("Код145");
	ОписатьКодВычетаНДФЛНеИспользуется("Код147");
	ОписатьКодВычетаНДФЛНеИспользуется("Код1611");
	ОписатьКодВычетаНДФЛНеИспользуется("Код1612");
	
	Для Номер = 1 по 9 Цикл
		ОписатьКодВычетаНДФЛНеИспользуется("Код20"+Строка(Номер));
	КонецЦикла;
	
	Для Номер = 10 по 32 Цикл
		Если Номер <> 25 Тогда
			ОписатьКодВычетаНДФЛНеИспользуется("Код2"+Строка(Номер));
		КонецЕсли; 
	КонецЦикла;
	
	ОписатьКодВычетаНДФЛНеИспользуется("Код235");
	ОписатьКодВычетаНДФЛНеИспользуется("Код311");
	ОписатьКодВычетаНДФЛНеИспользуется("Код312");
	ОписатьКодВычетаНДФЛНеИспользуется("Код318");
	ОписатьКодВычетаНДФЛНеИспользуется("Код319");
	ОписатьКодВычетаНДФЛНеИспользуется("Код320");
	ОписатьКодВычетаНДФЛНеИспользуется("Код320о");
	ОписатьКодВычетаНДФЛНеИспользуется("Код403");
	ОписатьКодВычетаНДФЛНеИспользуется("Код404_");
	ОписатьКодВычетаНДФЛНеИспользуется("Код405_");
	ОписатьКодВычетаНДФЛНеИспользуется("Код502");
	ОписатьКодВычетаНДФЛНеИспользуется("Код501");
	ОписатьКодВычетаНДФЛНеИспользуется("Код503");
	ОписатьКодВычетаНДФЛНеИспользуется("Код504");
	ОписатьКодВычетаНДФЛНеИспользуется("Код505");
	ОписатьКодВычетаНДФЛНеИспользуется("Код506");
	ОписатьКодВычетаНДФЛНеИспользуется("Код507");
	ОписатьКодВычетаНДФЛНеИспользуется("Код508");
	ОписатьКодВычетаНДФЛНеИспользуется("Код3127");
	ОписатьКодВычетаНДФЛНеИспользуется("Код509");
	ОписатьКодВычетаНДФЛНеИспользуется("Код3133");
	ОписатьКодВычетаНДФЛНеИспользуется("Код3146");
	ОписатьКодВычетаНДФЛНеИспользуется("Код580");
	ОписатьКодВычетаНДФЛНеИспользуется("Код601");
	ОписатьКодВычетаНДФЛНеИспользуется("Код607");
	ОписатьКодВычетаНДФЛНеИспользуется("Код6201");

КонецПроцедуры

Процедура ОписатьКодВычетаНДФЛНеИспользуется(ИмяПредопределенныхДанных, Изменение = "(не используется)")
	
	СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыВычетовНДФЛ." + ИмяПредопределенныхДанных);
	
	Если СсылкаПредопределенного <> Неопределено Тогда 
		
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		
		Если СтрЧислоВхождений(Элемент.Наименование, Изменение) = 0 Тогда
			
			Элемент.Наименование = Изменение + Элемент.Наименование;
			
			Если Элемент.Модифицированность() Тогда
				Элемент.ОбменДанными.Загрузка = Истина;
				Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
				Элемент.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// }
// 4D

Процедура ОписатьКодВычетаНДФЛ(ИмяПредопределенныхДанных, Код, Наименование, ВычетКДоходу = Истина, ГруппаВычета = Неопределено, Код2010 = "", Код2011 = "", Код2015 = "", Код2016 = "", НеПредоставляетсяНерезидентам = Ложь) 

	СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыВычетовНДФЛ." + ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВидыВычетовНДФЛ.СоздатьЭлемент();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Если Элемент.Код <> Код Тогда
		Элемент.Код = Код
	КонецЕсли;
	Если Элемент.Наименование <> Наименование Тогда
		Элемент.Наименование = Наименование
	КонецЕсли;
	Если Элемент.ПолноеНаименование <> Наименование Тогда
		Элемент.ПолноеНаименование = Наименование
	КонецЕсли;
	Если Элемент.ВычетКДоходу <> ВычетКДоходу Тогда
		Элемент.ВычетКДоходу = ВычетКДоходу
	КонецЕсли;
	Если Элемент.ГруппаВычета <> ГруппаВычета Тогда
		Элемент.ГруппаВычета = ГруппаВычета	
	КонецЕсли;
	Если Элемент.НеПредоставляетсяНерезидентам <> НеПредоставляетсяНерезидентам Тогда
		Элемент.НеПредоставляетсяНерезидентам = НеПредоставляетсяНерезидентам	
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2010Года <> Код2010 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2010Года = Код2010
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года <> Код2011 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года = Код2011
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года <> Код2015 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года = Код2015
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2016Года <> Код2016 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2016Года = Код2016
	КонецЕсли;

	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли

